// WidgetBlueprintGeneratedClass AgentLeptonInfo.AgentLeptonInfo_C
class UAgentLeptonInfo_C : public UPDAgentLeptonInfo {

public:

	struct UImage IMG_AgentName_Deco; // 0x360 (8)
	struct UImage IMG_BackBoard; // 0x368 (8)
	struct UImage IMG_Divider; // 0x370 (8)
	struct UImage IMG_EquipSlot_Locked1; // 0x378 (8)
	struct UImage IMG_EquipSlot_Locked2; // 0x380 (8)
	struct UImage IMG_EquipSlot_Locked3; // 0x388 (8)
	struct UImage IMG_EquipSlot_UnEquipped_2; // 0x390 (8)
	struct UImage IMG_EquipSlot_UnEquipped1; // 0x398 (8)
	struct UImage IMG_EquipSlot_UnEquipped3; // 0x3A0 (8)
	struct UImage IMG_MainMission_Deco; // 0x3A8 (8)
	struct UImage IMG_ModeName_Deco; // 0x3B0 (8)
	struct UImage IMG_PopupBoard; // 0x3B8 (8)
	struct UImage IMG_Signature_Guide; // 0x3C0 (8)
	struct UPDKeyButton_C KBtn_Close; // 0x3C8 (8)
	struct UPersonalMissionModule_C PersonalMissionModule; // 0x3D0 (8)
	struct UPersonalMissionModule_C PersonalMissionModule_2; // 0x3D8 (8)
	struct UPersonalMissionModule_C PersonalMissionModule_3; // 0x3E0 (8)
	struct UPersonalMissionModule_C PersonalMissionModule_4; // 0x3E8 (8)
	struct UPersonalMissionModule_C PersonalMissionModule_5; // 0x3F0 (8)
};

