// WidgetBlueprintGeneratedClass AgentSlotListItem.AgentSlotListItem_C
class UAgentSlotListItem_C : public UPDAgentSlotListItemUI {

public:

	struct UWidgetAnimation Anim_OverSelect_Loop; // 0x318 (8)
	struct UImage IMG_CharacterSlot_Divider_01; // 0x320 (8)
	struct UImage IMG_CharacterSlot_Divider_02; // 0x328 (8)
	struct UImage IMG_CharacterSlot_Outline; // 0x330 (8)
	struct UImage IMG_CharacterSlot_OverDivider_01; // 0x338 (8)
	struct UImage IMG_CharacterSlot_OverDivider_02; // 0x340 (8)
	struct UImage IMG_CharacterSlot_OverOutline; // 0x348 (8)
	struct UImage IMG_CharacterSlot_PortraitBg; // 0x350 (8)
	struct UImage IMG_CharacterSlot_PortraitDeco; // 0x358 (8)
	struct UImage IMG_CharacterSlot_PortraitOutline; // 0x360 (8)
	struct UImage IMG_CharacterSlot_SelectDivider_01; // 0x368 (8)
	struct UImage IMG_CharacterSlot_SelectDivider_02; // 0x370 (8)
	struct UImage IMG_CharacterSlot_SelectOutline; // 0x378 (8)
	struct UImage IMG_Empty_Divider_01; // 0x380 (8)
	struct UImage IMG_Empty_Divider_02; // 0x388 (8)
	struct UImage IMG_Empty_Outline; // 0x390 (8)
	struct UImage IMG_Empty_OverDivider_01; // 0x398 (8)
	struct UImage IMG_Empty_OverDivider_02; // 0x3A0 (8)
	struct UImage IMG_Empty_OverOutline; // 0x3A8 (8)
	struct UImage IMG_Empty_Portrait; // 0x3B0 (8)
	struct UImage IMG_Empty_PortraitBg; // 0x3B8 (8)
	struct UImage IMG_Empty_PortraitDeco; // 0x3C0 (8)
	struct UImage IMG_Empty_PortraitOutline; // 0x3C8 (8)
	struct UImage IMG_Expired_Bg; // 0x3D0 (8)
	struct UImage IMG_Expired_Deco; // 0x3D8 (8)
	struct UImage IMG_OverDeco_LB; // 0x3E0 (8)
	struct UImage IMG_OverDeco_LT; // 0x3E8 (8)
	struct UImage IMG_OverDeco_RB; // 0x3F0 (8)
	struct UImage IMG_OverDeco_RT; // 0x3F8 (8)
	struct UImage IMG_SLotBg; // 0x400 (8)
};

