// WidgetBlueprintGeneratedClass AgentInventory.AgentInventory_C
class UAgentInventory_C : public UPDAgentInventoryUI {

public:

	struct UWidgetAnimation Anim_SceneOut_Confirm; // 0x558 (8)
	struct UWidgetAnimation Anim_CustomFocus_Loop; // 0x560 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x568 (8)
	struct UWidgetAnimation Anim_FocusShowUp; // 0x570 (8)
	struct UImage IMG_ActiveBarDeco; // 0x578 (8)
	struct UImage IMG_AgentFocus_Deco_LB; // 0x580 (8)
	struct UImage IMG_AgentFocus_Deco_LT; // 0x588 (8)
	struct UImage IMG_AgentFocus_Deco_RB; // 0x590 (8)
	struct UImage IMG_AgentFocus_Deco_RT; // 0x598 (8)
	struct UImage IMG_AgentFocus_Deco_Ruler; // 0x5A0 (8)
	struct UImage IMG_AgentSign_Underbar; // 0x5A8 (8)
	struct UImage IMG_CustomAgent_Decco_LB; // 0x5B0 (8)
	struct UImage IMG_CustomAgent_Decco_LT; // 0x5B8 (8)
	struct UImage IMG_CustomAgent_Decco_RB; // 0x5C0 (8)
	struct UImage IMG_CustomAgent_Decco_RT; // 0x5C8 (8)
	struct UImage IMG_CustomAgent_Deco01; // 0x5D0 (8)
	struct UImage IMG_CustomAgent_Deco02; // 0x5D8 (8)
	struct UImage IMG_CustomAgent_Deco03; // 0x5E0 (8)
	struct UImage IMG_CustomAgent_Deco03_Fx; // 0x5E8 (8)
	struct UImage IMG_CustomGame_Decco_LB; // 0x5F0 (8)
	struct UImage IMG_CustomGame_Decco_LT; // 0x5F8 (8)
	struct UImage IMG_CustomGame_Decco_RB; // 0x600 (8)
	struct UImage IMG_CustomGame_Decco_RT; // 0x608 (8)
	struct UImage IMG_CustomGame_Deco01; // 0x610 (8)
	struct UImage IMG_CustomGame_Deco02; // 0x618 (8)
	struct UImage IMG_CustomGame_Deco03; // 0x620 (8)
	struct UImage IMG_CustomGame_Deco03_Fx; // 0x628 (8)
	struct UImage IMG_CustomWeapon_Decco_LB; // 0x630 (8)
	struct UImage IMG_CustomWeapon_Decco_LT; // 0x638 (8)
	struct UImage IMG_CustomWeapon_Decco_RB; // 0x640 (8)
	struct UImage IMG_CustomWeapon_Decco_RT; // 0x648 (8)
	struct UImage IMG_CustomWeapon_Deco01; // 0x650 (8)
	struct UImage IMG_CustomWeapon_Deco02; // 0x658 (8)
	struct UImage IMG_CustomWeapon_Deco03; // 0x660 (8)
	struct UImage IMG_CustomWeapon_Deco03_Fx; // 0x668 (8)
	struct UImage IMG_Outglow_Agent; // 0x670 (8)
	struct UImage IMG_QuickDeco_Bottom_Normal; // 0x678 (8)
	struct UImage IMG_QuickDeco_Bottom_Over; // 0x680 (8)
	struct UImage IMG_QuickDeco_LB_Normal; // 0x688 (8)
	struct UImage IMG_QuickDeco_LB_Over; // 0x690 (8)
	struct UImage IMG_QuickDeco_LT_Normal; // 0x698 (8)
	struct UImage IMG_QuickDeco_LT_Over; // 0x6A0 (8)
	struct UImage IMG_QuickDeco_RB_Normal; // 0x6A8 (8)
	struct UImage IMG_QuickDeco_RB_Over; // 0x6B0 (8)
	struct UImage IMG_QuickDeco_RT_Normal; // 0x6B8 (8)
	struct UImage IMG_QuickDeco_RT_Over; // 0x6C0 (8)
	struct UImage IMG_QuickDeco_Top_Normal; // 0x6C8 (8)
	struct UImage IMG_QuickDeco_Top_Over; // 0x6D0 (8)
	struct UImage IMG_Rental_Alert; // 0x6D8 (8)
	struct UImage IMG_Rental_Bg; // 0x6E0 (8)
	struct UImage IMG_Rental_Outline; // 0x6E8 (8)
	struct UImage IMG_SCLDeco_Arrow_Normal; // 0x6F0 (8)
	struct UImage IMG_SCLDeco_Arrow_Over; // 0x6F8 (8)
	struct UImage IMG_SCLDeco_Bottom_Normal; // 0x700 (8)
	struct UImage IMG_SCLDeco_Bottom_Over; // 0x708 (8)
	struct UImage IMG_SCLDeco_LB_Normal; // 0x710 (8)
	struct UImage IMG_SCLDeco_LB_Over; // 0x718 (8)
	struct UImage IMG_SCLDeco_LT_Normal; // 0x720 (8)
	struct UImage IMG_SCLDeco_LT_Over; // 0x728 (8)
	struct UImage IMG_SCLDeco_RB_Normal; // 0x730 (8)
	struct UImage IMG_SCLDeco_RB_Over; // 0x738 (8)
	struct UImage IMG_SCLDeco_RT_Normal; // 0x740 (8)
	struct UImage IMG_SCLDeco_RT_Over; // 0x748 (8)
	struct UImage IMG_SCLDeco_Top_Normal; // 0x750 (8)
	struct UImage IMG_SCLDeco_Top_Over; // 0x758 (8)
	struct UImage IMG_SCRDeco_Arrow_Normal; // 0x760 (8)
	struct UImage IMG_SCRDeco_Arrow_Over; // 0x768 (8)
	struct UImage IMG_SCRDeco_Bottom_Normal; // 0x770 (8)
	struct UImage IMG_SCRDeco_Bottom_Over; // 0x778 (8)
	struct UImage IMG_SCRDeco_LB_Normal; // 0x780 (8)
	struct UImage IMG_SCRDeco_LB_Over; // 0x788 (8)
	struct UImage IMG_SCRDeco_LT_Normal; // 0x790 (8)
	struct UImage IMG_SCRDeco_LT_Over; // 0x798 (8)
	struct UImage IMG_SCRDeco_RB_Normal; // 0x7A0 (8)
	struct UImage IMG_SCRDeco_RB_Over; // 0x7A8 (8)
	struct UImage IMG_SCRDeco_RT_Normal; // 0x7B0 (8)
	struct UImage IMG_SCRDeco_RT_Over; // 0x7B8 (8)
	struct UImage IMG_SCRDeco_Top_Normal; // 0x7C0 (8)
	struct UImage IMG_SCRDeco_Top_Over; // 0x7C8 (8)
	struct UImage IMG_TitleActiveBar; // 0x7D0 (8)
	struct UWidgetSwitcher WS_QuickContract; // 0x7D8 (8)
};

