// BlueprintGeneratedClass BP_Ai_BigForklift_002_Auto_Exp.BP_Ai_BigForklift_002_Auto_Exp_C
class ABP_Ai_BigForklift_002_Auto_Exp_C : public APDDynamicObject {

public:

	struct UStaticMeshComponent MDESTROY_Front_Defence; // 0x670 (8)
	struct UStaticMeshComponent ALIVEOBJ_Front_Defence; // 0x678 (8)
	struct UStaticMeshComponent MDESTROY_Back; // 0x680 (8)
	struct UStaticMeshComponent MDESTROY_Front; // 0x688 (8)
	struct UStaticMeshComponent ALIVEOBJ_Back; // 0x690 (8)
	struct UStaticMeshComponent ALIVEOBJ_Front; // 0x698 (8)
	struct UStaticMeshComponent WHEEL1#SM_AiBigForkliftWheel_003; // 0x6A0 (8)
	struct UStaticMeshComponent WHEEL2#SM_AiBigForkliftWheel_006; // 0x6A8 (8)
	struct UStaticMeshComponent WHEEL3#SM_AiBigForkliftWheel_004; // 0x6B0 (8)
	struct UStaticMeshComponent WHEEL4#SM_AiBigForkliftWheel_005; // 0x6B8 (8)
	struct UStaticMeshComponent WHEEL1#SM_AiBigForkliftWheel_002; // 0x6C0 (8)
	struct UStaticMeshComponent WHEEL4#SM_AiBigForkliftWheel_004; // 0x6C8 (8)
	struct UStaticMeshComponent WHEEL3#SM_AiBigForkliftWheel_003; // 0x6D0 (8)
	struct UStaticMeshComponent WHEEL2#SM_AiBigForkliftWheel_005; // 0x6D8 (8)
	struct UStaticMeshComponent WHEEL4#SM_AiBigForkliftWheel_003; // 0x6E0 (8)
	struct UStaticMeshComponent WHEEL2#SM_AiBigForkliftWheel_004; // 0x6E8 (8)
	struct UStaticMeshComponent BAGGAGE1#SM_AiBigForklift_004; // 0x6F0 (8)
	struct UPDDynamicObjectPoint POINT1#Smoke1_4; // 0x6F8 (8)
	struct UPDDynamicObjectPoint POINT1#Smoke1_3; // 0x700 (8)
	struct UPDDynamicObjectPoint POINT2#Fire2_4; // 0x708 (8)
	struct UPDDynamicObjectPoint POINT2#Fire2_3; // 0x710 (8)
	struct UPDDynamicObjectPoint POINT2#Fire2_2; // 0x718 (8)
	struct UPDDynamicObjectPoint POINT1#Smoke1_2; // 0x720 (8)
	struct UStaticMeshComponent BAGGAGE2#SM_AiBigForkliftBeam_003; // 0x728 (8)
	struct UStaticMeshComponent BODY#SM_AiBigForklift_003; // 0x730 (8)
	struct USceneComponent FDESTROY#1; // 0x738 (8)
	struct UStaticMeshComponent BAGGAGE2#SM_AiBigForkliftBeam_002; // 0x740 (8)
	struct UStaticMeshComponent BAGGAGE1#SM_AiBigForklift_003; // 0x748 (8)
	struct UStaticMeshComponent BODY#SM_AiBigForklift_002; // 0x750 (8)
	struct UStaticMeshComponent WHEEL1#SM_AiBigForkliftWheel_001; // 0x758 (8)
	struct UStaticMeshComponent WHEEL3#SM_AiBigForkliftWheel_002; // 0x760 (8)
	struct UStaticMeshComponent BAGGAGE2#SM_AiBigForkliftBeam_001; // 0x768 (8)
	struct UStaticMeshComponent BAGGAGE1#SM_AiBigForklift_002; // 0x770 (8)
	struct USceneComponent MDESTROY#; // 0x778 (8)
	struct UStaticMeshComponent BODY#SM_AiBigForklift_001; // 0x780 (8)
	struct USplineComponent SPLINE1#Spline; // 0x788 (8)
	struct USceneComponent ALIVEOBJ#; // 0x790 (8)
};

