// BlueprintGeneratedClass BP_Ai_Forklift_Auto_40sec.BP_Ai_Forklift_Auto_40sec_C
class ABP_Ai_Forklift_Auto_40sec_C : public APDDynamicObject {

public:

	struct UStaticMeshComponent MDESTROY_Front; // 0x670 (8)
	struct UStaticMeshComponent MDESTROY_Back; // 0x678 (8)
	struct UStaticMeshComponent ALIVEOBJ_Front; // 0x680 (8)
	struct UStaticMeshComponent ALIVEOBJ_Back; // 0x688 (8)
	struct UStaticMeshComponent BAGGAGE#BOX_M; // 0x690 (8)
	struct UStaticMeshComponent BAGGAGE#BOX_F; // 0x698 (8)
	struct UStaticMeshComponent BAGGAGE#BOX; // 0x6A0 (8)
	struct UStaticMeshComponent WHEEL#TireFL2; // 0x6A8 (8)
	struct UStaticMeshComponent WHEEL#TireRR2; // 0x6B0 (8)
	struct UStaticMeshComponent WHEEL#TireRL2; // 0x6B8 (8)
	struct UStaticMeshComponent WHEEL#TireFR2; // 0x6C0 (8)
	struct UStaticMeshComponent WHEEL#TireFL1; // 0x6C8 (8)
	struct UStaticMeshComponent WHEEL#TireRR1; // 0x6D0 (8)
	struct UStaticMeshComponent WHEEL#TireRL1; // 0x6D8 (8)
	struct UStaticMeshComponent WHEEL#TireFR1; // 0x6E0 (8)
	struct UStaticMeshComponent WHEEL#TireRR; // 0x6E8 (8)
	struct UStaticMeshComponent WHEEL#TireRL; // 0x6F0 (8)
	struct UStaticMeshComponent WHEEL#TireFR; // 0x6F8 (8)
	struct UStaticMeshComponent WHEEL#TireFL; // 0x700 (8)
	struct UStaticMeshComponent SM_Ai_Forklift_Destroyed_Mid; // 0x708 (8)
	struct USceneComponent MDESTROY#; // 0x710 (8)
	struct UPDDynamicObjectPoint POINT2#Fire; // 0x718 (8)
	struct UPDDynamicObjectPoint POINT1#Smoke; // 0x720 (8)
	struct USplineComponent SPLINE1#Spline; // 0x728 (8)
	struct UPDDynamicObjectPoint POINT3#Explosion; // 0x730 (8)
	struct UStaticMeshComponent BODY#SM_Ai_Forklift_Destroyed; // 0x738 (8)
	struct USceneComponent FDESTROY#; // 0x740 (8)
	struct UStaticMeshComponent BODY#SM_Ai_Forklift; // 0x748 (8)
	struct USceneComponent ALIVEOBJ#; // 0x750 (8)
};

