// BlueprintGeneratedClass BP_AgentSUV_001_01.BP_AgentSUV_001_01_C
class ABP_AgentSUV_001_01_C : public UActor {

public:

	struct UChildActorComponent BP_AgentSUV_Glass_Headlight_004; // 0x220 (8)
	struct UChildActorComponent BP_AgentSUV_Glass_Headlight_001; // 0x228 (8)
	struct UChildActorComponent BP_AgentSUV_Glass_Back_004; // 0x230 (8)
	struct UChildActorComponent BP_AgentSUV_Glass_Back_003; // 0x238 (8)
	struct UChildActorComponent BP_AgentSUV_Glass_Back_002; // 0x240 (8)
	struct UChildActorComponent BP_AgentSUV_Glass_Back_001; // 0x248 (8)
	struct UBoxComponent Parkour_Vol_003; // 0x250 (8)
	struct UBoxComponent Parkour_Vol_002; // 0x258 (8)
	struct UStaticMeshComponent SM_AgentSUV_001_03; // 0x260 (8)
	struct UStaticMeshComponent SM_AgentSUV_001_02; // 0x268 (8)
	struct UStaticMeshComponent SM_AgentSUV_001_01; // 0x270 (8)
	struct USceneComponent DefaultSceneRoot; // 0x278 (8)
};

