// BlueprintGeneratedClass BP_AGVTrailer.BP_AGVTrailer_C
class ABP_AGVTrailer_C : public UActor {

public:

	struct UStaticMeshComponent SM_AGVTrailer; // 0x220 (8)
	struct UBoxComponent Parkour_Volume01; // 0x228 (8)
	struct UStaticMeshComponent SM_AGVTrailer_Tire; // 0x230 (8)
	struct UStaticMeshComponent SM_AGVTrailer_Tire3; // 0x238 (8)
	struct UStaticMeshComponent SM_AGVTrailer_Tire1; // 0x240 (8)
	struct UStaticMeshComponent SM_AGVTrailer_Tire2; // 0x248 (8)
	struct UStaticMeshComponent AGV_Trailer_glass1; // 0x250 (8)
	struct UStaticMeshComponent AGV_Trailer_glass3; // 0x258 (8)
	struct UStaticMeshComponent AGV_Trailer_glass2; // 0x260 (8)
	struct UStaticMeshComponent AGV_Trailer_glass; // 0x268 (8)
	struct USceneComponent DefaultSceneRoot; // 0x270 (8)
};

