// BlueprintGeneratedClass BP_Club_K_002.BP_Club_K_002_C
class ABP_Club_K_002_C : public UActor {

public:

	struct UStaticMeshComponent SM_Club_K_002_010; // 0x220 (8)
	struct UStaticMeshComponent SM_Club_K_002_09; // 0x228 (8)
	struct UStaticMeshComponent SM_Club_K_001_04; // 0x230 (8)
	struct UStaticMeshComponent SM_Club_K_002_05; // 0x238 (8)
	struct UStaticMeshComponent SM_Club_K_002_08; // 0x240 (8)
	struct UStaticMeshComponent SM_Club_K_002_07; // 0x248 (8)
	struct UStaticMeshComponent SM_Club_K_002_06; // 0x250 (8)
	struct UStaticMeshComponent SM_Door_R_002; // 0x258 (8)
	struct UStaticMeshComponent SM_Door_L_002; // 0x260 (8)
	struct UStaticMeshComponent SM_Club_K_002_01_StaticMeshComponent0; // 0x268 (8)
	struct UStaticMeshComponent SM_Club_K_002_02_StaticMeshComponent0; // 0x270 (8)
	struct USceneComponent SharedRoot; // 0x278 (8)
};

