// BlueprintGeneratedClass BP_Container_Ship_002.BP_Container_Ship_002_C
class ABP_Container_Ship_002_C : public UActor {

public:

	struct UStaticMeshComponent SM_Container_Ship_002_10; // 0x220 (8)
	struct UStaticMeshComponent StaticMesh13; // 0x228 (8)
	struct UStaticMeshComponent StaticMesh12; // 0x230 (8)
	struct UStaticMeshComponent StaticMesh11; // 0x238 (8)
	struct UStaticMeshComponent StaticMesh10; // 0x240 (8)
	struct UStaticMeshComponent StaticMesh9; // 0x248 (8)
	struct UStaticMeshComponent StaticMesh8; // 0x250 (8)
	struct UStaticMeshComponent SM_Container_Ship_002_9; // 0x258 (8)
	struct UStaticMeshComponent StaticMesh; // 0x260 (8)
	struct UStaticMeshComponent SM_Container_Ship_002_8; // 0x268 (8)
	struct UStaticMeshComponent SM_Container_Ship_002_7; // 0x270 (8)
	struct UStaticMeshComponent SM_Container_Ship_002_5; // 0x278 (8)
	struct UStaticMeshComponent SM_Container_Ship_002_6; // 0x280 (8)
	struct UStaticMeshComponent SM_Container_Ship_002_3; // 0x288 (8)
	struct UStaticMeshComponent 003; // 0x290 (8)
	struct UStaticMeshComponent 002; // 0x298 (8)
	struct UStaticMeshComponent SM_Container_Ship_002_2; // 0x2A0 (8)
	struct USceneComponent DefaultSceneRoot; // 0x2A8 (8)
};

