// BlueprintGeneratedClass BP_Container_40ft_002.BP_Container_40ft_002_C
class ABP_Container_40ft_002_C : public UActor {

public:

	struct UStaticMeshComponent SM_Container_FakeMesh_003; // 0x220 (8)
	struct UStaticMeshComponent SM_Container_FakeMesh_002; // 0x228 (8)
	struct UStaticMeshComponent SM_Container_FakeMesh_001; // 0x230 (8)
	struct UStaticMeshComponent SM_NewDoor_L_002; // 0x238 (8)
	struct UStaticMeshComponent SM_NewDoor_R_002; // 0x240 (8)
	struct UStaticMeshComponent SM_NewDoor_L_001; // 0x248 (8)
	struct UStaticMeshComponent SM_NewDoor_R_001; // 0x250 (8)
	struct UStaticMeshComponent SM_Container_10ft_001; // 0x258 (8)
	struct USceneComponent DefaultSceneRoot; // 0x260 (8)
};

