// BlueprintGeneratedClass BP_Dock_001_02.BP_Dock_001_02_C
class ABP_Dock_001_02_C : public UActor {

public:

	struct UStaticMeshComponent SM_SignC_03; // 0x220 (8)
	struct UStaticMeshComponent Cube; // 0x228 (8)
	struct UStaticMeshComponent Cube1; // 0x230 (8)
	struct UStaticMeshComponent SM_Dock_FM_033; // 0x238 (8)
	struct UStaticMeshComponent SM_Dock_FM_037; // 0x240 (8)
	struct UStaticMeshComponent SM_Dock_FM_038; // 0x248 (8)
	struct UStaticMeshComponent SM_Dock_FM_034; // 0x250 (8)
	struct UStaticMeshComponent SM_Dock_FM_035; // 0x258 (8)
	struct UStaticMeshComponent SM_Dock_DA_05; // 0x260 (8)
	struct UStaticMeshComponent SM_Dock_DA_06; // 0x268 (8)
	struct UStaticMeshComponent SM_Dock_FM_036; // 0x270 (8)
	struct UStaticMeshComponent SM_Dock_02_05; // 0x278 (8)
	struct UStaticMeshComponent SM_MERGED_DockPipe_016; // 0x280 (8)
	struct UStaticMeshComponent SM_MERGED_DockPipe_015; // 0x288 (8)
	struct UStaticMeshComponent SM_MERGED_DockPipe_013; // 0x290 (8)
	struct UStaticMeshComponent SM_Dock_03_04_01; // 0x298 (8)
	struct UStaticMeshComponent SM_Dock_02_06; // 0x2A0 (8)
	struct UStaticMeshComponent SM_Dock_03_001; // 0x2A8 (8)
	struct USceneComponent DefaultSceneRoot; // 0x2B0 (8)
};

