// BlueprintGeneratedClass BP_Dock_001_01.BP_Dock_001_01_C
class ABP_Dock_001_01_C : public UActor {

public:

	struct UStaticMeshComponent SM_MERGED_DockPipe_017; // 0x220 (8)
	struct UStaticMeshComponent SM_MERGED_DockPipe_016; // 0x228 (8)
	struct UStaticMeshComponent SM_MERGED_DockPipe_015; // 0x230 (8)
	struct UStaticMeshComponent Cube15; // 0x238 (8)
	struct UStaticMeshComponent Cube14; // 0x240 (8)
	struct UStaticMeshComponent Cube13; // 0x248 (8)
	struct UStaticMeshComponent Cube12; // 0x250 (8)
	struct UStaticMeshComponent Cube11; // 0x258 (8)
	struct UStaticMeshComponent Cube10; // 0x260 (8)
	struct UStaticMeshComponent Cube9; // 0x268 (8)
	struct UStaticMeshComponent Cube8; // 0x270 (8)
	struct UStaticMeshComponent Cube7; // 0x278 (8)
	struct UStaticMeshComponent Cube6; // 0x280 (8)
	struct UStaticMeshComponent Cube5; // 0x288 (8)
	struct UStaticMeshComponent Cube4; // 0x290 (8)
	struct UStaticMeshComponent Cube3; // 0x298 (8)
	struct UStaticMeshComponent Cube2; // 0x2A0 (8)
	struct UStaticMeshComponent SM_Dock_FM_086; // 0x2A8 (8)
	struct UStaticMeshComponent SM_Dock_FM_085; // 0x2B0 (8)
	struct UStaticMeshComponent SM_Dock_FM_084; // 0x2B8 (8)
	struct UStaticMeshComponent SM_Dock_FM_083; // 0x2C0 (8)
	struct UStaticMeshComponent SM_Dock_DA_012; // 0x2C8 (8)
	struct UStaticMeshComponent SM_Dock_DA_011; // 0x2D0 (8)
	struct UStaticMeshComponent SM_Dock_FM_082; // 0x2D8 (8)
	struct UStaticMeshComponent SM_Dock_FM_081; // 0x2E0 (8)
	struct UStaticMeshComponent SM_Dock_FM_097; // 0x2E8 (8)
	struct UStaticMeshComponent SM_Dock_FM_098; // 0x2F0 (8)
	struct UStaticMeshComponent SM_Dock_FM_080; // 0x2F8 (8)
	struct UStaticMeshComponent SM_Dock_FM_079; // 0x300 (8)
	struct UStaticMeshComponent SM_Dock_FM_025; // 0x308 (8)
	struct UStaticMeshComponent SM_Dock_FM_078; // 0x310 (8)
	struct UStaticMeshComponent SM_Dock_FM_074; // 0x318 (8)
	struct UStaticMeshComponent SM_Dock_FM_061; // 0x320 (8)
	struct UStaticMeshComponent SM_Dock_FM_055; // 0x328 (8)
	struct UStaticMeshComponent SM_Dock_FM_050; // 0x330 (8)
	struct UStaticMeshComponent SM_Dock_FM_012; // 0x338 (8)
	struct UStaticMeshComponent SM_Dock_FM_05; // 0x340 (8)
	struct UStaticMeshComponent SM_Dock_02_09; // 0x348 (8)
	struct UStaticMeshComponent SM_Dock_FM_077; // 0x350 (8)
	struct UStaticMeshComponent SM_Dock_FM_032; // 0x358 (8)
	struct UStaticMeshComponent SM_Dock_FM_096; // 0x360 (8)
	struct UStaticMeshComponent SM_Dock_FM_095; // 0x368 (8)
	struct UStaticMeshComponent SM_Dock_FM_094; // 0x370 (8)
	struct UStaticMeshComponent SM_Dock_FM_093; // 0x378 (8)
	struct UStaticMeshComponent SM_Dock_FM_092; // 0x380 (8)
	struct UStaticMeshComponent SM_Dock_FM_068; // 0x388 (8)
	struct UStaticMeshComponent SM_Dock_FM_039; // 0x390 (8)
	struct UStaticMeshComponent SM_Dock_FM_091; // 0x398 (8)
	struct UStaticMeshComponent SM_Dock_FM_075; // 0x3A0 (8)
	struct UStaticMeshComponent SM_Dock_FM_076; // 0x3A8 (8)
	struct USceneComponent Fakemesh_L; // 0x3B0 (8)
	struct UStaticMeshComponent SM_Dock_FM_073; // 0x3B8 (8)
	struct UStaticMeshComponent SM_Dock_FM_072; // 0x3C0 (8)
	struct UStaticMeshComponent SM_Dock_FM_071; // 0x3C8 (8)
	struct UStaticMeshComponent SM_Dock_FM_070; // 0x3D0 (8)
	struct UStaticMeshComponent SM_Dock_FM_069; // 0x3D8 (8)
	struct UStaticMeshComponent SM_Dock_FM_067; // 0x3E0 (8)
	struct UStaticMeshComponent SM_Dock_FM_066; // 0x3E8 (8)
	struct UStaticMeshComponent SM_Dock_FM_065; // 0x3F0 (8)
	struct UStaticMeshComponent SM_Dock_FM_064; // 0x3F8 (8)
	struct UStaticMeshComponent SM_Dock_FM_063; // 0x400 (8)
	struct UStaticMeshComponent SM_Dock_FM_062; // 0x408 (8)
	struct UStaticMeshComponent SM_Dock_FM_060; // 0x410 (8)
	struct UStaticMeshComponent SM_Dock_FM_059; // 0x418 (8)
	struct UStaticMeshComponent SM_Dock_FM_058; // 0x420 (8)
	struct UStaticMeshComponent SM_Dock_FM_057; // 0x428 (8)
	struct UStaticMeshComponent SM_Dock_FM_056; // 0x430 (8)
	struct UStaticMeshComponent SM_Dock_FM_054; // 0x438 (8)
	struct UStaticMeshComponent SM_Dock_FM_053; // 0x440 (8)
	struct UStaticMeshComponent SM_Dock_FM_052; // 0x448 (8)
	struct UStaticMeshComponent SM_Dock_FM_051; // 0x450 (8)
	struct UStaticMeshComponent SM_Dock_FM_049; // 0x458 (8)
	struct UStaticMeshComponent SM_Dock_FM_048; // 0x460 (8)
	struct UStaticMeshComponent SM_Dock_FM_047; // 0x468 (8)
	struct UStaticMeshComponent SM_Dock_FM_046; // 0x470 (8)
	struct UStaticMeshComponent SM_Dock_FM_045; // 0x478 (8)
	struct UStaticMeshComponent SM_Dock_FM_044; // 0x480 (8)
	struct UStaticMeshComponent SM_Dock_FM_043; // 0x488 (8)
	struct UStaticMeshComponent SM_Dock_FM_042; // 0x490 (8)
	struct UStaticMeshComponent SM_Dock_FM_041; // 0x498 (8)
	struct UStaticMeshComponent SM_Dock_FM_040; // 0x4A0 (8)
	struct UStaticMeshComponent SM_Dock_DA_010; // 0x4A8 (8)
	struct UStaticMeshComponent SM_Dock_DA_09; // 0x4B0 (8)
	struct UStaticMeshComponent SM_Dock_DA_08; // 0x4B8 (8)
	struct UStaticMeshComponent SM_Dock_DA_07; // 0x4C0 (8)
	struct UStaticMeshComponent SM_Dock_DA_06; // 0x4C8 (8)
	struct UStaticMeshComponent SM_Dock_FM_022; // 0x4D0 (8)
	struct UStaticMeshComponent SM_Dock_FM_021; // 0x4D8 (8)
	struct UStaticMeshComponent SM_Dock_FM_036; // 0x4E0 (8)
	struct UStaticMeshComponent SM_Dock_FM_035; // 0x4E8 (8)
	struct UStaticMeshComponent SM_Dock_FM_031; // 0x4F0 (8)
	struct UStaticMeshComponent SM_Dock_FM_030; // 0x4F8 (8)
	struct UStaticMeshComponent SM_Dock_FM_029; // 0x500 (8)
	struct UStaticMeshComponent SM_Dock_FM_028; // 0x508 (8)
	struct UStaticMeshComponent SM_Dock_FM_027; // 0x510 (8)
	struct UStaticMeshComponent SM_Dock_FM_026; // 0x518 (8)
	struct UStaticMeshComponent SM_Dock_FM_010; // 0x520 (8)
	struct UStaticMeshComponent SM_Dock_FM_023; // 0x528 (8)
	struct UStaticMeshComponent SM_Dock_FM_020; // 0x530 (8)
	struct UStaticMeshComponent SM_Dock_FM_019; // 0x538 (8)
	struct UStaticMeshComponent SM_Dock_FM_018; // 0x540 (8)
	struct UStaticMeshComponent SM_Dock_FM_016; // 0x548 (8)
	struct UStaticMeshComponent SM_Dock_FM_015; // 0x550 (8)
	struct UStaticMeshComponent SM_Dock_FM_014; // 0x558 (8)
	struct UStaticMeshComponent SM_Dock_FM_013; // 0x560 (8)
	struct UStaticMeshComponent SM_Dock_FM_011; // 0x568 (8)
	struct UStaticMeshComponent SM_Dock_FM_024; // 0x570 (8)
	struct UStaticMeshComponent SM_Dock_FM_09; // 0x578 (8)
	struct UStaticMeshComponent SM_Dock_FM_08; // 0x580 (8)
	struct UStaticMeshComponent SM_Dock_FM_07; // 0x588 (8)
	struct UStaticMeshComponent SM_Dock_FM_06; // 0x590 (8)
	struct UStaticMeshComponent SM_Dock_FM_04; // 0x598 (8)
	struct UStaticMeshComponent SM_Dock_FM_03; // 0x5A0 (8)
	struct UStaticMeshComponent SM_Dock_FM_02; // 0x5A8 (8)
	struct UStaticMeshComponent SM_Dock_DA_05; // 0x5B0 (8)
	struct UStaticMeshComponent SM_Dock_DA_04; // 0x5B8 (8)
	struct UStaticMeshComponent SM_Dock_DA_03; // 0x5C0 (8)
	struct UStaticMeshComponent SM_Dock_DA_02; // 0x5C8 (8)
	struct UStaticMeshComponent SM_Dock_DA_01; // 0x5D0 (8)
	struct UStaticMeshComponent SM_Dock_FM_017; // 0x5D8 (8)
	struct USceneComponent Fakemesh_R; // 0x5E0 (8)
	struct UStaticMeshComponent SM_Dock_02_05; // 0x5E8 (8)
	struct UStaticMeshComponent SM_Dock_02_04; // 0x5F0 (8)
	struct UStaticMeshComponent SM_Dock_02_01; // 0x5F8 (8)
	struct UStaticMeshComponent SM_Dock_02_03; // 0x600 (8)
	struct USceneComponent DefaultSceneRoot; // 0x608 (8)
};

