// BlueprintGeneratedClass BP_DeliveryTruck_B.BP_DeliveryTruck_B_C
class ABP_DeliveryTruck_B_C : public APDDynamicObject {

public:

	struct UStaticMeshComponent WHEEL1#SM_Van_Tire_001_FL_Mid; // 0x670 (8)
	struct UStaticMeshComponent WHEEL6#SM_Van_Tire_001_RR_Mid; // 0x678 (8)
	struct UStaticMeshComponent WHEEL5#SM_Van_Tire_001_RL_Mid; // 0x680 (8)
	struct UStaticMeshComponent WHEEL4#SM_Van_Tire_001_RR_Mid; // 0x688 (8)
	struct UStaticMeshComponent WHEEL3#SM_Van_Tire_001_RL_Mid; // 0x690 (8)
	struct UStaticMeshComponent WHEEL2#SM_Van_Tire_001_FR_Mid; // 0x698 (8)
	struct UStaticMeshComponent LDOOR2#SM_DeliveryTruck_Door_RL_Mid; // 0x6A0 (8)
	struct UStaticMeshComponent BONNET#DeliveryTruck_Head_Bonnet_Mid; // 0x6A8 (8)
	struct UStaticMeshComponent WINDOW5#DeliveryTruck_Window_HeadLights_Mid; // 0x6B0 (8)
	struct UStaticMeshComponent WINDOW4#DeliveryTruck_Window_HeadLights_Mid; // 0x6B8 (8)
	struct UStaticMeshComponent WINDOW3#DeliveryTruck_Window_Side_Mid; // 0x6C0 (8)
	struct UStaticMeshComponent WINDOW2#DeliveryTruck_Window_Side_Mid; // 0x6C8 (8)
	struct UStaticMeshComponent WINDOW1#DeliveryTruck_Window_01_Mid; // 0x6D0 (8)
	struct UStaticMeshComponent RDOOR2#SM_DeliveryTruck_Door_RR_Mid; // 0x6D8 (8)
	struct UStaticMeshComponent BODY#SM_DeliveryTruck_Head_BASE_Mid; // 0x6E0 (8)
	struct USceneComponent MDESTROY#; // 0x6E8 (8)
	struct UStaticMeshComponent WHEEL5#SM_Van_Tire_001_RL1_Destroy; // 0x6F0 (8)
	struct UStaticMeshComponent WHEEL6#SM_Van_Tire_001_RR1_Destroy; // 0x6F8 (8)
	struct UStaticMeshComponent WHEEL6#SM_Van_Tire_001_RR1; // 0x700 (8)
	struct UStaticMeshComponent WHEEL5#SM_Van_Tire_001_RL1; // 0x708 (8)
	struct UPDDynamicObjectPoint POINT3#Fire2_2; // 0x710 (8)
	struct UPDDynamicObjectPoint POINT2#Fire1_2; // 0x718 (8)
	struct UPDDynamicObjectPoint POINT1#Smoke1_2; // 0x720 (8)
	struct UStaticMeshComponent WHEEL4#SM_Van_Tire_001_RR_Destroy; // 0x728 (8)
	struct UStaticMeshComponent WHEEL3#SM_Van_Tire_001_RL_Destroy; // 0x730 (8)
	struct UStaticMeshComponent WHEEL2#SM_Van_Tire_001_FR_Destroy; // 0x738 (8)
	struct UStaticMeshComponent WHEEL1#SM_Van_Tire_001_FL_Destroy; // 0x740 (8)
	struct UStaticMeshComponent WHEEL4#SM_Van_Tire_001_RR; // 0x748 (8)
	struct UStaticMeshComponent WHEEL3#SM_Van_Tire_001_RL; // 0x750 (8)
	struct UStaticMeshComponent BODY#SM_DeliveryTruck_Head_BASE_Destroy; // 0x758 (8)
	struct USceneComponent FDESTROY#; // 0x760 (8)
	struct UStaticMeshComponent WHEEL2#SM_Van_Tire_001_FR; // 0x768 (8)
	struct UStaticMeshComponent WHEEL1#SM_Van_Tire_001_FL; // 0x770 (8)
	struct UStaticMeshComponent BODY#SM_DeliveryTruck_Head_BASE; // 0x778 (8)
	struct USceneComponent ALIVEOBJ#; // 0x780 (8)
	struct UStaticMeshComponent BONNET#DeliveryTruck_Head_Bonnet_Destroy; // 0x788 (8)
	struct UStaticMeshComponent BONNET#DeliveryTruck_Head_Bonnet; // 0x790 (8)
	struct UStaticMeshComponent RDOOR1#Delivery_Truck_Door_Destroy; // 0x798 (8)
	struct UStaticMeshComponent LDOOR1#Delivery_Truck_Door_Destroy_02; // 0x7A0 (8)
	struct UStaticMeshComponent RDOOR2#SM_DeliveryTruck_Door_RR_Destroy; // 0x7A8 (8)
	struct UStaticMeshComponent LDOOR2#SM_DeliveryTruck_Door_RL_Destroy; // 0x7B0 (8)
	struct UStaticMeshComponent WINDOW5#DeliveryTruck_Window_HeadLights; // 0x7B8 (8)
	struct UStaticMeshComponent WINDOW4#DeliveryTruck_Window_HeadLights; // 0x7C0 (8)
	struct UStaticMeshComponent WINDOW3#DeliveryTruck_Window_Side; // 0x7C8 (8)
	struct UStaticMeshComponent WINDOW2#DeliveryTruck_Window_Side; // 0x7D0 (8)
	struct UStaticMeshComponent WINDOW1#DeliveryTruck_Window_01; // 0x7D8 (8)
	struct UStaticMeshComponent RDOOR2#SM_DeliveryTruck_Door_RR; // 0x7E0 (8)
	struct UStaticMeshComponent LDOOR2#SM_DeliveryTruck_Door_RL; // 0x7E8 (8)
};

