// BlueprintGeneratedClass BP_Delivery_Van_01.BP_Delivery_Van_01_C
class ABP_Delivery_Van_01_C : public APDDynamicObject {

public:

	struct UStaticMeshComponent WINDOW5#SM_Delivery_Van_Window_HeadLight_R_Break; // 0x670 (8)
	struct UStaticMeshComponent WINDOW4#SM_Delivery_Van_Window_HeadLight_L_Break; // 0x678 (8)
	struct UStaticMeshComponent WINDOW3#SM_Delivery_Van_Window_FR_Break; // 0x680 (8)
	struct UStaticMeshComponent WINDOW2#SM_Delivery_Van_Window_FL_Break; // 0x688 (8)
	struct UStaticMeshComponent WINDOW1#SM_Delivery_Van_Window_FW_Break; // 0x690 (8)
	struct UStaticMeshComponent WHEEL4#SM_Delivery_Van_Tire_RR_Break; // 0x698 (8)
	struct UStaticMeshComponent WHEEL3#SM_Delivery_Van_Tire_RL_Break; // 0x6A0 (8)
	struct UStaticMeshComponent WHEEL2#SM_Delivery_Van_Tire_FR_Break; // 0x6A8 (8)
	struct UStaticMeshComponent WHEEL1#SM_Delivery_Van_Tire_FL_Break; // 0x6B0 (8)
	struct UStaticMeshComponent BONNET#SM_Delivery_Van_Bonnet_Break; // 0x6B8 (8)
	struct UStaticMeshComponent RDOOR1#SM_Delivery_Van_Door_FR_Break; // 0x6C0 (8)
	struct UStaticMeshComponent LDOOR2#SM_Delivery_Van_Door_RL_Break; // 0x6C8 (8)
	struct UStaticMeshComponent LDOOR1#SM_Delivery_Van_Door_FL_Break; // 0x6D0 (8)
	struct UStaticMeshComponent RDOOR2#SM_Delivery_Van_Door_RR_Break; // 0x6D8 (8)
	struct UStaticMeshComponent BODY#SM_Delivery_Van_Base_Break; // 0x6E0 (8)
	struct USceneComponent MDESTROY#; // 0x6E8 (8)
	struct UPDDynamicObjectPoint POINT3#Fire2_2; // 0x6F0 (8)
	struct UPDDynamicObjectPoint POINT2#Fire1_2; // 0x6F8 (8)
	struct UPDDynamicObjectPoint POINT1#Smoke1_2; // 0x700 (8)
	struct UStaticMeshComponent WHEEL4#SM_Delivery_Van_Tire_RR_Destroy; // 0x708 (8)
	struct UStaticMeshComponent WHEEL3#SM_Delivery_Van_Tire_RL_Destroy; // 0x710 (8)
	struct UStaticMeshComponent WHEEL2#SM_Delivery_Van_Tire_FR_Destroy; // 0x718 (8)
	struct UStaticMeshComponent WHEEL1#SM_Delivery_Van_Tire_FL_Destroy; // 0x720 (8)
	struct UStaticMeshComponent WHEEL4#SM_Delivery_Van_Tire_RR; // 0x728 (8)
	struct UStaticMeshComponent WHEEL3#SM_Delivery_Van_Tire_RL; // 0x730 (8)
	struct UStaticMeshComponent BODY#SM_Delivery_Van_Base_Destroy; // 0x738 (8)
	struct USceneComponent FDESTROY#; // 0x740 (8)
	struct UStaticMeshComponent WHEEL2#SM_Delivery_Van_Tire_FR; // 0x748 (8)
	struct UStaticMeshComponent WHEEL1#SM_Delivery_Van_Tire_FL; // 0x750 (8)
	struct UStaticMeshComponent BODY#SM_Delivery_Van_Base; // 0x758 (8)
	struct USceneComponent ALIVEOBJ#; // 0x760 (8)
	struct UStaticMeshComponent BONNET#SM_Delivery_Van_Bonnet_Destroy; // 0x768 (8)
	struct UStaticMeshComponent BONNET#SM_Delivery_Van_Bonnet; // 0x770 (8)
	struct UStaticMeshComponent RDOOR1#SM_Delivery_Van_Door_FR_Destroy; // 0x778 (8)
	struct UStaticMeshComponent LDOOR1#SM_Delivery_Van_Door_FL_Destroy; // 0x780 (8)
	struct UStaticMeshComponent RDOOR2#SM_Delivery_Van_Door_RR_Destroy; // 0x788 (8)
	struct UStaticMeshComponent LDOOR2#SM_Delivery_Van_Door_RL_Destroy; // 0x790 (8)
	struct UStaticMeshComponent WINDOW5#SM_Delivery_Van_Window_HeadLight_R; // 0x798 (8)
	struct UStaticMeshComponent WINDOW4#SM_Delivery_Van_Window_HeadLight_L; // 0x7A0 (8)
	struct UStaticMeshComponent WINDOW3#SM_Delivery_Van_Window_FR; // 0x7A8 (8)
	struct UStaticMeshComponent WINDOW2#SM_Delivery_Van_Window_FL; // 0x7B0 (8)
	struct UStaticMeshComponent WINDOW1#SM_Delivery_Van_Window_FW; // 0x7B8 (8)
	struct UStaticMeshComponent RDOOR2#SM_Delivery_Van_Door_RR; // 0x7C0 (8)
	struct UStaticMeshComponent LDOOR2#SM_Delivery_Van_Door_RL; // 0x7C8 (8)
	struct UStaticMeshComponent RDOOR1#SM_Delivery_Van_Door_FR; // 0x7D0 (8)
	struct UStaticMeshComponent LDOOR1#SM_Delivery_Van_Door_FL; // 0x7D8 (8)
};

