// BlueprintGeneratedClass BP_GoliathCrane_001.BP_GoliathCrane_001_C
class ABP_GoliathCrane_001_C : public UActor {

public:

	struct UStaticMeshComponent SM_FakeMesh_002_5; // 0x220 (8)
	struct UStaticMeshComponent SM_FakeMesh_002_4; // 0x228 (8)
	struct UStaticMeshComponent SM_FakeMesh_002_3; // 0x230 (8)
	struct UStaticMeshComponent SM_FakeMesh_009; // 0x238 (8)
	struct UStaticMeshComponent SM_FakeMesh_003; // 0x240 (8)
	struct UStaticMeshComponent SM_FakeMesh_005; // 0x248 (8)
	struct UStaticMeshComponent SM_FakeMesh_002; // 0x250 (8)
	struct UStaticMeshComponent SM_FakeMesh_006; // 0x258 (8)
	struct UStaticMeshComponent SM_FakeMesh_004; // 0x260 (8)
	struct UStaticMeshComponent SM_FakeMesh_001; // 0x268 (8)
	struct UStaticMeshComponent SM_FakeMesh_008; // 0x270 (8)
	struct UStaticMeshComponent SM_FakeMesh_0010; // 0x278 (8)
	struct UStaticMeshComponent SM_FakeMesh_002_2; // 0x280 (8)
	struct UStaticMeshComponent SM_FakeMesh_007; // 0x288 (8)
	struct UStaticMeshComponent SM_Goliath_FakeMesh_006; // 0x290 (8)
	struct UStaticMeshComponent SM_Goliath_FakeMesh_005; // 0x298 (8)
	struct UStaticMeshComponent SM_Goliath_FakeMesh_004; // 0x2A0 (8)
	struct UStaticMeshComponent SM_Goliath_FakeMesh_003; // 0x2A8 (8)
	struct UStaticMeshComponent SM_Goliath_FakeMesh_002; // 0x2B0 (8)
	struct UStaticMeshComponent SM_Goliath_FakeMesh_001; // 0x2B8 (8)
	struct UBoxComponent Parkour_Volume04; // 0x2C0 (8)
	struct UBoxComponent Parkour_Volume03; // 0x2C8 (8)
	struct UBoxComponent Parkour_Volume02; // 0x2D0 (8)
	struct UBoxComponent Parkour_Volume01; // 0x2D8 (8)
	struct USceneComponent DFMesh; // 0x2E0 (8)
	struct UStaticMeshComponent SM_STS_engine_001; // 0x2E8 (8)
	struct UStaticMeshComponent SM_LedLight_004; // 0x2F0 (8)
	struct UStaticMeshComponent SM_LedLight_003; // 0x2F8 (8)
	struct UStaticMeshComponent SM_LedLight_002; // 0x300 (8)
	struct UStaticMeshComponent SM_LedLight_001; // 0x308 (8)
	struct UStaticMeshComponent SM_STS_engine_004; // 0x310 (8)
	struct UStaticMeshComponent SM_STS_engine_003; // 0x318 (8)
	struct UStaticMeshComponent SM_STS_engine_002; // 0x320 (8)
	struct UStaticMeshComponent SM_GoliathCrane_45m_002; // 0x328 (8)
	struct UStaticMeshComponent SM_GoliathCrane_001; // 0x330 (8)
	struct USceneComponent DefaultSceneRoot; // 0x338 (8)
};

