// BlueprintGeneratedClass BP_MERGED_FrontStair_002.BP_MERGED_FrontStair_002_C
class ABP_MERGED_FrontStair_002_C : public UActor {

public:

	struct UBoxComponent Box6; // 0x220 (8)
	struct UBoxComponent Box5; // 0x228 (8)
	struct UBoxComponent Box4; // 0x230 (8)
	struct UBoxComponent Box3; // 0x238 (8)
	struct UBoxComponent Box2; // 0x240 (8)
	struct UBoxComponent Box1; // 0x248 (8)
	struct UStaticMeshComponent SM_MERGED_FrontStair_002; // 0x250 (8)
	struct UBoxComponent Box; // 0x258 (8)
	struct USceneComponent DefaultSceneRoot; // 0x260 (8)
};

