// BlueprintGeneratedClass BP_MERGED_SmallWarehouse_001_Epic.BP_MERGED_SmallWarehouse_001_Epic_C
class ABP_MERGED_SmallWarehouse_001_Epic_C : public UActor {

public:

	struct UStaticMeshComponent SM_SmallWarehouse_decal_003; // 0x220 (8)
	struct UStaticMeshComponent SM_SmallWarehouse_decal_002; // 0x228 (8)
	struct UStaticMeshComponent SM_CCTV_009; // 0x230 (8)
	struct UStaticMeshComponent SM_CCTV_006; // 0x238 (8)
	struct UStaticMeshComponent SM_SmallWarehouse_decal_001; // 0x240 (8)
	struct UStaticMeshComponent SM_CCTV_0015; // 0x248 (8)
	struct UStaticMeshComponent SM_CCTV_0012; // 0x250 (8)
	struct UStaticMeshComponent SM_CCTV_0010; // 0x258 (8)
	struct UStaticMeshComponent SM_WallCrack_001; // 0x260 (8)
	struct UStaticMeshComponent SM_WallCrack_009; // 0x268 (8)
	struct UStaticMeshComponent SM_WallCrack_008; // 0x270 (8)
	struct UStaticMeshComponent SM_WallCrack_007; // 0x278 (8)
	struct UStaticMeshComponent SM_WallCrack_002; // 0x280 (8)
	struct UStaticMeshComponent SM_SignA_17; // 0x288 (8)
	struct UStaticMeshComponent SM_LedLight_001_03; // 0x290 (8)
	struct UStaticMeshComponent SM_LedLight_001_013; // 0x298 (8)
	struct UChildActorComponent BP_AirConditioner_002; // 0x2A0 (8)
	struct UChildActorComponent BP_AirConditioner_001; // 0x2A8 (8)
	struct USceneComponent Epic; // 0x2B0 (8)
	struct USceneComponent DefaultSceneRoot; // 0x2B8 (8)
};

