// BlueprintGeneratedClass BP_Missile_WoodenBox_001_02.BP_Missile_WoodenBox_001_02_C
class ABP_Missile_WoodenBox_001_02_C : public UActor {

public:

	struct UStaticMeshComponent SM_Club_K_002_07; // 0x220 (8)
	struct UStaticMeshComponent SM_Missile_WoodenBox_001_07; // 0x228 (8)
	struct UStaticMeshComponent SM_Missile_WoodenBox_001_05; // 0x230 (8)
	struct UStaticMeshComponent SM_Missile_WoodenBox_001_06; // 0x238 (8)
	struct UStaticMeshComponent SM_Missile_WoodenBox_001_04; // 0x240 (8)
	struct UStaticMeshComponent SM_Missile_WoodenBox_001_03; // 0x248 (8)
	struct UStaticMeshComponent SM_Missile_WoodenBox_001_02; // 0x250 (8)
	struct UStaticMeshComponent SM_Missile_WoodenBox_001_01; // 0x258 (8)
	struct USceneComponent DefaultSceneRoot; // 0x260 (8)
};

