// BlueprintGeneratedClass BP_MERGED_MiddleStair_002.BP_MERGED_MiddleStair_002_C
class ABP_MERGED_MiddleStair_002_C : public UActor {

public:

	struct UBoxComponent Sub_Collision_01; // 0x220 (8)
	struct UStaticMeshComponent DF_MERGED_MiddleStair_002_01; // 0x228 (8)
	struct UStaticMeshComponent DF_MERGED_MiddleStair_002_04; // 0x230 (8)
	struct UStaticMeshComponent DF_MERGED_MiddleStair_002_05; // 0x238 (8)
	struct UStaticMeshComponent DF_MERGED_MiddleStair_002_06; // 0x240 (8)
	struct UStaticMeshComponent DF_MERGED_MiddleStair_002_07; // 0x248 (8)
	struct UStaticMeshComponent DF_MERGED_MiddleStair_002_03; // 0x250 (8)
	struct UStaticMeshComponent DF_MERGED_MiddleStair_002_02; // 0x258 (8)
	struct UStaticMeshComponent SM_MERGED_MiddleStair_002; // 0x260 (8)
	struct USceneComponent DefaultSceneRoot; // 0x268 (8)
};

