// BlueprintGeneratedClass BP_MERGED_ShipWareSub_001.BP_MERGED_ShipWareSub_001_C
class ABP_MERGED_ShipWareSub_001_C : public UActor {

public:

	struct UStaticMeshComponent SM_LedLight_007; // 0x220 (8)
	struct UStaticMeshComponent SM_LedLight_006; // 0x228 (8)
	struct UStaticMeshComponent SM_LedLight_005; // 0x230 (8)
	struct UStaticMeshComponent SM_LedLight_004; // 0x238 (8)
	struct UStaticMeshComponent SM_LedLight_003; // 0x240 (8)
	struct UStaticMeshComponent SM_FuseBox_03; // 0x248 (8)
	struct UStaticMeshComponent SM_WallWire_03; // 0x250 (8)
	struct UStaticMeshComponent SM_FuseBox_02; // 0x258 (8)
	struct UStaticMeshComponent SM_WallWire_02; // 0x260 (8)
	struct UStaticMeshComponent SM_RollShutter_003; // 0x268 (8)
	struct UStaticMeshComponent SM_RollShutter_002; // 0x270 (8)
	struct UStaticMeshComponent SM_RollShutter_001; // 0x278 (8)
	struct UStaticMeshComponent SM_MERGED_ShipWareDeco_001; // 0x280 (8)
	struct UStaticMeshComponent SM_MERGED_ShipWareSubTop_001; // 0x288 (8)
	struct UStaticMeshComponent SM_MERGED_ShipWareSub_001; // 0x290 (8)
	struct USceneComponent DefaultSceneRoot; // 0x298 (8)
};

