// BlueprintGeneratedClass BP_NewTruck_001.BP_NewTruck_001_C
class ABP_NewTruck_001_C : public UActor {

public:

	struct UBoxComponent Parkour_Volume_03; // 0x220 (8)
	struct UChildActorComponent BP_TruckBig_Window_005; // 0x228 (8)
	struct UChildActorComponent BP_TruckBig_Window_004; // 0x230 (8)
	struct UChildActorComponent BP_TruckBig_Window_003; // 0x238 (8)
	struct UChildActorComponent BP_TruckBig_Window_002; // 0x240 (8)
	struct UChildActorComponent BP_TruckBig_Window_001; // 0x248 (8)
	struct UBoxComponent Parkour_Volume_02; // 0x250 (8)
	struct UBoxComponent Parkour_Volume_01; // 0x258 (8)
	struct UStaticMeshComponent SM_NewTruck_001; // 0x260 (8)
	struct USceneComponent DefaultSceneRoot; // 0x268 (8)
};

