// BlueprintGeneratedClass BP_ShipBlock_Tale_001.BP_ShipBlock_Tale_001_C
class ABP_ShipBlock_Tale_001_C : public UActor {

public:

	struct UStaticMeshComponent SM_Ship_C_FM_012; // 0x220 (8)
	struct UStaticMeshComponent SM_Ship_C_FM_011; // 0x228 (8)
	struct UStaticMeshComponent SM_Ship_C_FM_010; // 0x230 (8)
	struct UStaticMeshComponent SM_Ship_C_FM_09; // 0x238 (8)
	struct UStaticMeshComponent SM_Ship_C_FM_08; // 0x240 (8)
	struct UStaticMeshComponent SM_Ship_C_FM_07; // 0x248 (8)
	struct UStaticMeshComponent SM_CautionSign_004; // 0x250 (8)
	struct UStaticMeshComponent SM_CautionSign_003; // 0x258 (8)
	struct UStaticMeshComponent SM_Decal_031; // 0x260 (8)
	struct UStaticMeshComponent SM_Decal_029; // 0x268 (8)
	struct UStaticMeshComponent SM_Decal_015; // 0x270 (8)
	struct UStaticMeshComponent SM_Decal_030; // 0x278 (8)
	struct UStaticMeshComponent SM_Decal_028; // 0x280 (8)
	struct UStaticMeshComponent SM_Decal_014; // 0x288 (8)
	struct UStaticMeshComponent SM_Decal_004; // 0x290 (8)
	struct UStaticMeshComponent SM_Decal_013; // 0x298 (8)
	struct UStaticMeshComponent SM_Decal_019; // 0x2A0 (8)
	struct UStaticMeshComponent SM_Decal_020; // 0x2A8 (8)
	struct UStaticMeshComponent SM_Ship_C_Block_Shape_04; // 0x2B0 (8)
	struct UStaticMeshComponent SM_Ship_C_Block_Shape_03; // 0x2B8 (8)
	struct UStaticMeshComponent SM_Ship_C_Block_Shape_01_StaticMeshComponent0; // 0x2C0 (8)
	struct UStaticMeshComponent SM_FloorWire_4_StaticMeshComponent0; // 0x2C8 (8)
	struct UStaticMeshComponent SM_FloorWire_004_StaticMeshComponent0; // 0x2D0 (8)
	struct UStaticMeshComponent SM_Shipyard_Dock_5_StaticMeshComponent0; // 0x2D8 (8)
	struct UStaticMeshComponent SM_Shipyard_Dock_12_StaticMeshComponent0; // 0x2E0 (8)
	struct UStaticMeshComponent SM_Shipyard_Dock_3_StaticMeshComponent0; // 0x2E8 (8)
	struct UStaticMeshComponent SM_Shipyard_Dock_9_StaticMeshComponent0; // 0x2F0 (8)
	struct UStaticMeshComponent SM_Shipyard_Dock_4_StaticMeshComponent0; // 0x2F8 (8)
	struct UStaticMeshComponent SM_Ship_C_Block_Shape_02_StaticMeshComponent0; // 0x300 (8)
	struct UStaticMeshComponent SM_Shipyard_Dock_11_StaticMeshComponent0; // 0x308 (8)
	struct UStaticMeshComponent SM_Shipyard_Dock_10_StaticMeshComponent0; // 0x310 (8)
	struct UStaticMeshComponent SM_Shipyard_Dock_7_StaticMeshComponent0; // 0x318 (8)
	struct UStaticMeshComponent SM_Shipyard_Dock_2_StaticMeshComponent0; // 0x320 (8)
	struct UStaticMeshComponent SM_Shipyard_Dock_8_StaticMeshComponent0; // 0x328 (8)
	struct UStaticMeshComponent SM_Shipyard_Dock_01_StaticMeshComponent0; // 0x330 (8)
	struct UStaticMeshComponent SM_CraneSign_5_StaticMeshComponent0; // 0x338 (8)
	struct UStaticMeshComponent SM_CraneSign_3_StaticMeshComponent0; // 0x340 (8)
	struct UStaticMeshComponent SM_Shipyard_Dock_6_StaticMeshComponent0; // 0x348 (8)
	struct UStaticMeshComponent SM_Ship_C_FM_06; // 0x350 (8)
	struct UStaticMeshComponent SM_Ship_C_FM_05; // 0x358 (8)
	struct UStaticMeshComponent SM_Ship_C_FM_04; // 0x360 (8)
	struct UStaticMeshComponent SM_Ship_C_FM_03; // 0x368 (8)
	struct USceneComponent Scene1; // 0x370 (8)
	struct UStaticMeshComponent SM_WallLetter_T2001_StaticMeshComponent0; // 0x378 (8)
	struct UStaticMeshComponent SM_WallLetter_T2008_StaticMeshComponent0; // 0x380 (8)
	struct UStaticMeshComponent SM_WallLetter_T2003_StaticMeshComponent0; // 0x388 (8)
	struct UStaticMeshComponent SM_WallLetter_T2007_StaticMeshComponent0; // 0x390 (8)
	struct UStaticMeshComponent SM_WallLetter_T2001_StaticMeshComponent2; // 0x398 (8)
	struct UStaticMeshComponent SM_WallLetter_T2001_StaticMeshComponent1; // 0x3A0 (8)
	struct UStaticMeshComponent SM_WallLetter_T2003_StaticMeshComponent2; // 0x3A8 (8)
	struct UStaticMeshComponent SM_WallLetter_T2003_StaticMeshComponent1; // 0x3B0 (8)
	struct USceneComponent Scene; // 0x3B8 (8)
	struct USceneComponent SharedRoot; // 0x3C0 (8)
};

