// BlueprintGeneratedClass BP_ShipBlock_Mid_001.BP_ShipBlock_Mid_001_C
class ABP_ShipBlock_Mid_001_C : public UActor {

public:

	struct UStaticMeshComponent SM_MERGED_Ship_Pipe_004; // 0x220 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Pipe_003; // 0x228 (8)
	struct UBoxComponent Box3; // 0x230 (8)
	struct UBoxComponent Box2; // 0x238 (8)
	struct UBoxComponent Box1; // 0x240 (8)
	struct UBoxComponent Box; // 0x248 (8)
	struct UStaticMeshComponent StaticMesh9; // 0x250 (8)
	struct UStaticMeshComponent StaticMesh8; // 0x258 (8)
	struct UStaticMeshComponent StaticMesh7; // 0x260 (8)
	struct UStaticMeshComponent StaticMesh6; // 0x268 (8)
	struct UStaticMeshComponent StaticMesh5; // 0x270 (8)
	struct UStaticMeshComponent StaticMesh4; // 0x278 (8)
	struct UStaticMeshComponent StaticMesh3; // 0x280 (8)
	struct UStaticMeshComponent StaticMesh2; // 0x288 (8)
	struct UStaticMeshComponent StaticMesh1; // 0x290 (8)
	struct UStaticMeshComponent StaticMesh; // 0x298 (8)
	struct UStaticMeshComponent StaticMeshComponent434; // 0x2A0 (8)
	struct UStaticMeshComponent StaticMeshComponent441; // 0x2A8 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Pipe_002; // 0x2B0 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Pipe_001; // 0x2B8 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_005_04; // 0x2C0 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_02_04; // 0x2C8 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_038; // 0x2D0 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_037; // 0x2D8 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_036; // 0x2E0 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_035; // 0x2E8 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_034; // 0x2F0 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_033; // 0x2F8 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_032; // 0x300 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_02_03; // 0x308 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_031; // 0x310 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_030; // 0x318 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_029; // 0x320 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_028; // 0x328 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_027; // 0x330 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_026; // 0x338 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_025; // 0x340 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_02_02; // 0x348 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_024; // 0x350 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_023; // 0x358 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_022; // 0x360 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_021; // 0x368 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_020; // 0x370 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_019; // 0x378 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_018; // 0x380 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_017; // 0x388 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_016; // 0x390 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_015; // 0x398 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_014; // 0x3A0 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_013; // 0x3A8 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_012; // 0x3B0 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_011; // 0x3B8 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_010; // 0x3C0 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_09; // 0x3C8 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_005_03; // 0x3D0 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_0010; // 0x3D8 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_005_02; // 0x3E0 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_005_01; // 0x3E8 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_007; // 0x3F0 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_0015; // 0x3F8 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_0014; // 0x400 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_0012; // 0x408 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_004_02; // 0x410 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_004_01; // 0x418 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_0011; // 0x420 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_009; // 0x428 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_008; // 0x430 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_006; // 0x438 (8)
	struct UStaticMeshComponent SM_Ship_Block_Front_05; // 0x440 (8)
	struct UStaticMeshComponent SM_Ship_Block_Front_04; // 0x448 (8)
	struct UStaticMeshComponent SM_Ship_Block_Front_03; // 0x450 (8)
	struct UStaticMeshComponent SM_Ship_Block_Front_02; // 0x458 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_02_01; // 0x460 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_08; // 0x468 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_07; // 0x470 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_06; // 0x478 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_05; // 0x480 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_04; // 0x488 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_03; // 0x490 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_02; // 0x498 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_01; // 0x4A0 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_005; // 0x4A8 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_004; // 0x4B0 (8)
	struct UStaticMeshComponent StaticMeshComponent338; // 0x4B8 (8)
	struct UStaticMeshComponent StaticMeshComponent342; // 0x4C0 (8)
	struct UStaticMeshComponent StaticMeshComponent330; // 0x4C8 (8)
	struct UStaticMeshComponent StaticMeshComponent328; // 0x4D0 (8)
	struct UStaticMeshComponent StaticMeshComponent343; // 0x4D8 (8)
	struct UStaticMeshComponent StaticMeshComponent348; // 0x4E0 (8)
	struct UStaticMeshComponent StaticMeshComponent340; // 0x4E8 (8)
	struct UStaticMeshComponent StaticMeshComponent344; // 0x4F0 (8)
	struct UStaticMeshComponent StaticMeshComponent341; // 0x4F8 (8)
	struct UStaticMeshComponent StaticMeshComponent339; // 0x500 (8)
	struct UStaticMeshComponent StaticMeshComponent263; // 0x508 (8)
	struct UStaticMeshComponent StaticMeshComponent373; // 0x510 (8)
	struct UStaticMeshComponent StaticMeshComponent436; // 0x518 (8)
	struct UStaticMeshComponent StaticMeshComponent435; // 0x520 (8)
	struct UStaticMeshComponent StaticMeshComponent433; // 0x528 (8)
	struct UStaticMeshComponent StaticMeshComponent432; // 0x530 (8)
	struct UStaticMeshComponent StaticMeshComponent431; // 0x538 (8)
	struct UStaticMeshComponent StaticMeshComponent427; // 0x540 (8)
	struct UStaticMeshComponent StaticMeshComponent425; // 0x548 (8)
	struct UStaticMeshComponent StaticMeshComponent424; // 0x550 (8)
	struct UStaticMeshComponent StaticMeshComponent419; // 0x558 (8)
	struct UStaticMeshComponent StaticMeshComponent416; // 0x560 (8)
	struct UStaticMeshComponent StaticMeshComponent413; // 0x568 (8)
	struct UStaticMeshComponent StaticMeshComponent109; // 0x570 (8)
	struct UStaticMeshComponent StaticMeshComponent108; // 0x578 (8)
	struct UStaticMeshComponent StaticMeshComponent103; // 0x580 (8)
	struct UStaticMeshComponent StaticMeshComponent102; // 0x588 (8)
	struct UStaticMeshComponent StaticMeshComponent65; // 0x590 (8)
	struct UStaticMeshComponent StaticMeshComponent63; // 0x598 (8)
	struct UStaticMeshComponent StaticMeshComponent62; // 0x5A0 (8)
	struct UStaticMeshComponent StaticMeshComponent412; // 0x5A8 (8)
	struct UStaticMeshComponent StaticMeshComponent542; // 0x5B0 (8)
	struct UStaticMeshComponent StaticMeshComponent541; // 0x5B8 (8)
	struct UStaticMeshComponent StaticMeshComponent540; // 0x5C0 (8)
	struct UStaticMeshComponent StaticMeshComponent539; // 0x5C8 (8)
	struct UStaticMeshComponent StaticMeshComponent538; // 0x5D0 (8)
	struct UStaticMeshComponent StaticMeshComponent532; // 0x5D8 (8)
	struct UStaticMeshComponent StaticMeshComponent536; // 0x5E0 (8)
	struct UStaticMeshComponent StaticMeshComponent535; // 0x5E8 (8)
	struct UStaticMeshComponent StaticMeshComponent534; // 0x5F0 (8)
	struct UStaticMeshComponent StaticMeshComponent533; // 0x5F8 (8)
	struct UStaticMeshComponent StaticMeshComponent537; // 0x600 (8)
	struct UStaticMeshComponent StaticMeshComponent555; // 0x608 (8)
	struct UStaticMeshComponent StaticMeshComponent385; // 0x610 (8)
	struct UStaticMeshComponent StaticMeshComponent554; // 0x618 (8)
	struct UStaticMeshComponent StaticMeshComponent552; // 0x620 (8)
	struct UStaticMeshComponent StaticMeshComponent551; // 0x628 (8)
	struct UStaticMeshComponent StaticMeshComponent550; // 0x630 (8)
	struct UStaticMeshComponent StaticMeshComponent549; // 0x638 (8)
	struct UStaticMeshComponent StaticMeshComponent543; // 0x640 (8)
	struct UStaticMeshComponent StaticMeshComponent547; // 0x648 (8)
	struct UStaticMeshComponent StaticMeshComponent546; // 0x650 (8)
	struct UStaticMeshComponent StaticMeshComponent545; // 0x658 (8)
	struct UStaticMeshComponent StaticMeshComponent544; // 0x660 (8)
	struct UStaticMeshComponent StaticMeshComponent548; // 0x668 (8)
	struct UStaticMeshComponent StaticMeshComponent583; // 0x670 (8)
	struct UStaticMeshComponent StaticMeshComponent564; // 0x678 (8)
	struct UStaticMeshComponent StaticMeshComponent563; // 0x680 (8)
	struct UStaticMeshComponent StaticMeshComponent562; // 0x688 (8)
	struct UStaticMeshComponent StaticMeshComponent561; // 0x690 (8)
	struct UStaticMeshComponent StaticMeshComponent560; // 0x698 (8)
	struct UStaticMeshComponent StaticMeshComponent559; // 0x6A0 (8)
	struct UStaticMeshComponent StaticMeshComponent558; // 0x6A8 (8)
	struct UStaticMeshComponent StaticMeshComponent557; // 0x6B0 (8)
	struct UStaticMeshComponent StaticMeshComponent556; // 0x6B8 (8)
	struct USceneComponent Shadow; // 0x6C0 (8)
	struct USceneComponent decal; // 0x6C8 (8)
	struct USceneComponent Prop; // 0x6D0 (8)
	struct USceneComponent SharedRoot; // 0x6D8 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_003; // 0x6E0 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_002; // 0x6E8 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_001; // 0x6F0 (8)
	struct UStaticMeshComponent SM_Ship_Block_Floor_04; // 0x6F8 (8)
	struct USceneComponent DefaultSceneRoot; // 0x700 (8)
};

