// BlueprintGeneratedClass BP_ShipBlock_Move_001.BP_ShipBlock_Move_001_C
class ABP_ShipBlock_Move_001_C : public UActor {

public:

	struct UStaticMeshComponent StaticMesh11; // 0x220 (8)
	struct UStaticMeshComponent StaticMesh10; // 0x228 (8)
	struct UStaticMeshComponent StaticMesh9; // 0x230 (8)
	struct UStaticMeshComponent StaticMesh8; // 0x238 (8)
	struct UStaticMeshComponent StaticMesh7; // 0x240 (8)
	struct UStaticMeshComponent StaticMesh6; // 0x248 (8)
	struct UStaticMeshComponent StaticMesh5; // 0x250 (8)
	struct UStaticMeshComponent StaticMesh4; // 0x258 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Pipe_003; // 0x260 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Pipe_002; // 0x268 (8)
	struct UStaticMeshComponent SM_Ship_C_FM_03; // 0x270 (8)
	struct UStaticMeshComponent SM_Ship_C_FM_02; // 0x278 (8)
	struct UStaticMeshComponent SM_Ship_C_FM_01; // 0x280 (8)
	struct USceneComponent ShipBlock; // 0x288 (8)
	struct USceneComponent Scene; // 0x290 (8)
	struct USceneComponent Shadow; // 0x298 (8)
	struct USceneComponent Deco; // 0x2A0 (8)
	struct USceneComponent decal; // 0x2A8 (8)
	struct UStaticMeshComponent SM_Pipe_001_9_StaticMeshComponent0; // 0x2B0 (8)
	struct UStaticMeshComponent SM_Pipe_001_12_StaticMeshComponent0; // 0x2B8 (8)
	struct UStaticMeshComponent SM_Pipe_001_11_StaticMeshComponent0; // 0x2C0 (8)
	struct UStaticMeshComponent SM_Pipe_001_08_StaticMeshComponent0; // 0x2C8 (8)
	struct UStaticMeshComponent SM_WallLetter_T2004_StaticMeshComponent1; // 0x2D0 (8)
	struct UStaticMeshComponent SM_WallLetter_T2004_StaticMeshComponent0; // 0x2D8 (8)
	struct UStaticMeshComponent SM_Ship_C_Block_Decal_01_StaticMeshComponent0; // 0x2E0 (8)
	struct UStaticMeshComponent SM_Crane_Loader_03_StaticMeshComponent0; // 0x2E8 (8)
	struct UStaticMeshComponent SM_CraneSign_2_StaticMeshComponent0; // 0x2F0 (8)
	struct UStaticMeshComponent SM_WallWire_03_StaticMeshComponent0; // 0x2F8 (8)
	struct UStaticMeshComponent SM_WallWire_4_StaticMeshComponent0; // 0x300 (8)
	struct UStaticMeshComponent SM_CraneSign_4_StaticMeshComponent0; // 0x308 (8)
	struct UStaticMeshComponent SM_Ship_C_Block_Move_01_StaticMeshComponent0; // 0x310 (8)
};

