// BlueprintGeneratedClass BP_SmallForklift_001.BP_SmallForklift_001_C
class ABP_SmallForklift_001_C : public APDDynamicObject {

public:

	struct UBoxComponent Box; // 0x670 (8)
	struct UStaticMeshComponent WHEEL1#SM_SmallForkliftWheel_003; // 0x678 (8)
	struct UStaticMeshComponent WHEEL4#SM_SmallForkliftWheel_006; // 0x680 (8)
	struct UStaticMeshComponent WHEEL3#SM_SmallForkliftWheel_005; // 0x688 (8)
	struct UStaticMeshComponent WHEEL2#SM_SmallForkliftWheel_004; // 0x690 (8)
	struct UStaticMeshComponent BODY#SM_SmallForklift_004_Destoryed_Mid; // 0x698 (8)
	struct USceneComponent MDESTROY#; // 0x6A0 (8)
	struct UPDDynamicObjectPoint POINT2#AiForklift_Fire; // 0x6A8 (8)
	struct UPDDynamicObjectPoint POINT1#AiForklift_Smoke; // 0x6B0 (8)
	struct UPDDynamicObjectPoint POINT3#AiForklift_Explosion; // 0x6B8 (8)
	struct UStaticMeshComponent WHEEL4#SM_SmallForkliftWheel_005; // 0x6C0 (8)
	struct UStaticMeshComponent WHEEL3#SM_SmallForkliftWheel_004; // 0x6C8 (8)
	struct UStaticMeshComponent WHEEL2#SM_SmallForkliftWheel_003; // 0x6D0 (8)
	struct UStaticMeshComponent WHEEL1#SM_SmallForkliftWheel_002; // 0x6D8 (8)
	struct UStaticMeshComponent WHEEL4#SM_SmallForkliftWheel_004; // 0x6E0 (8)
	struct UStaticMeshComponent WHEEL3#SM_SmallForkliftWheel_003; // 0x6E8 (8)
	struct UStaticMeshComponent BODY#SM_SmallForklift_004_Destoryed_Final; // 0x6F0 (8)
	struct USceneComponent FDESTROY#; // 0x6F8 (8)
	struct UStaticMeshComponent WHEEL2#SM_SmallForkliftWheel_002; // 0x700 (8)
	struct UStaticMeshComponent WHEEL1#SM_SmallForkliftWheel_001; // 0x708 (8)
	struct UStaticMeshComponent BODY#SM_SmallForklift_004; // 0x710 (8)
	struct USceneComponent ALIVEOBJ#; // 0x718 (8)
};

