// BlueprintGeneratedClass BP_ShipBlock_Front_001.BP_ShipBlock_Front_001_C
class ABP_ShipBlock_Front_001_C : public UActor {

public:

	struct UStaticMeshComponent SM_Ship_Block_Merged_Front_004; // 0x220 (8)
	struct UStaticMeshComponent SM_Ship_A_Block_Deco_02; // 0x228 (8)
	struct UStaticMeshComponent SM_Ship_A_Block_Shadow_02; // 0x230 (8)
	struct UStaticMeshComponent SM_Ship_A_Block_Rope_02; // 0x238 (8)
	struct UStaticMeshComponent SM_Ship_A_Block_Shape_04; // 0x240 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_009; // 0x248 (8)
	struct UStaticMeshComponent SM_Ship_Block_Wall_Decal_06; // 0x250 (8)
	struct UStaticMeshComponent StaticMeshComponent218; // 0x258 (8)
	struct UStaticMeshComponent SM_Ship_A_FM_02; // 0x260 (8)
	struct UStaticMeshComponent SM_Ship_A_FM_01; // 0x268 (8)
	struct UStaticMeshComponent StaticMesh2; // 0x270 (8)
	struct UStaticMeshComponent SM_Ship_Merged_Block_Floor_001; // 0x278 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Sign_001; // 0x280 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Pipe_005; // 0x288 (8)
	struct UStaticMeshComponent SM_Ship_Block_Wall_Decal_05; // 0x290 (8)
	struct UStaticMeshComponent SM_Ship_Block_Wall_Decal_04; // 0x298 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_015; // 0x2A0 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_02_02; // 0x2A8 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_014; // 0x2B0 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_013; // 0x2B8 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_012; // 0x2C0 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_011; // 0x2C8 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_010; // 0x2D0 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_09; // 0x2D8 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_08; // 0x2E0 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_07; // 0x2E8 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_06; // 0x2F0 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_05; // 0x2F8 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_04; // 0x300 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_03; // 0x308 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_02_01; // 0x310 (8)
	struct UStaticMeshComponent SM_Ship_B_FM_02; // 0x318 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_004; // 0x320 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_006; // 0x328 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_001; // 0x330 (8)
	struct UStaticMeshComponent SM_MERGED_Ship_Block_008; // 0x338 (8)
	struct UStaticMeshComponent StaticMeshComponent222; // 0x340 (8)
	struct UStaticMeshComponent StaticMeshComponent215; // 0x348 (8)
	struct UStaticMeshComponent StaticMeshComponent217; // 0x350 (8)
	struct UStaticMeshComponent StaticMeshComponent220; // 0x358 (8)
	struct UStaticMeshComponent StaticMeshComponent221; // 0x360 (8)
	struct UStaticMeshComponent StaticMeshComponent212; // 0x368 (8)
	struct UStaticMeshComponent SM_Ship_A_Block_Anchor_01; // 0x370 (8)
	struct UStaticMeshComponent SM_Ship_A_Block_Rope_01; // 0x378 (8)
	struct UStaticMeshComponent StaticMeshComponent219; // 0x380 (8)
	struct USceneComponent Prop; // 0x388 (8)
	struct UStaticMeshComponent StaticMeshComponent289; // 0x390 (8)
	struct USceneComponent decal; // 0x398 (8)
	struct USceneComponent Shadow; // 0x3A0 (8)
	struct UBoxComponent Box4; // 0x3A8 (8)
	struct UBoxComponent Box3; // 0x3B0 (8)
	struct UBoxComponent Box2; // 0x3B8 (8)
	struct UBoxComponent Box1; // 0x3C0 (8)
	struct UBoxComponent Box; // 0x3C8 (8)
	struct USceneComponent Collision; // 0x3D0 (8)
	struct USceneComponent Base; // 0x3D8 (8)
	struct USceneComponent DefaultSceneRoot; // 0x3E0 (8)
};

