// BlueprintGeneratedClass BP_Transtainer.BP_Transtainer_C
class ABP_Transtainer_C : public APDDynamicObject {

public:

	struct UStaticMeshComponent ALIVEOBJ_Back_Defence2; // 0x670 (8)
	struct UStaticMeshComponent ALIVEOBJ_Front_Defence3; // 0x678 (8)
	struct UStaticMeshComponent ALIVEOBJ_Back_Defence1; // 0x680 (8)
	struct UStaticMeshComponent ALIVEOBJ_Front_Defence; // 0x688 (8)
	struct UStaticMeshComponent ALIVEOBJ_MID3; // 0x690 (8)
	struct UStaticMeshComponent ALIVEOBJ_MID2; // 0x698 (8)
	struct UStaticMeshComponent ALIVEOBJ_MID1; // 0x6A0 (8)
	struct UStaticMeshComponent ALIVEOBJ_MID; // 0x6A8 (8)
	struct UStaticMeshComponent ALIVEOBJ_Front2; // 0x6B0 (8)
	struct UStaticMeshComponent ALIVEOBJ_Back2; // 0x6B8 (8)
	struct UStaticMeshComponent ALIVEOBJ_Back3; // 0x6C0 (8)
	struct UStaticMeshComponent ALIVEOBJ_Front3; // 0x6C8 (8)
	struct UStaticMeshComponent ALIVEOBJ_Front1; // 0x6D0 (8)
	struct UStaticMeshComponent ALIVEOBJ_Back1; // 0x6D8 (8)
	struct UStaticMeshComponent ALIVEOBJ_Front; // 0x6E0 (8)
	struct UStaticMeshComponent ALIVEOBJ_Back; // 0x6E8 (8)
	struct UStaticMeshComponent PARTS1#Switch1; // 0x6F0 (8)
	struct UBoxComponent PARTS1#1; // 0x6F8 (8)
	struct UBoxComponent PARTS1#; // 0x700 (8)
	struct UStaticMeshComponent PARTS5#SM_Transtainer_Merge_005; // 0x708 (8)
	struct UStaticMeshComponent PARTS4#SM_Transtainer_Merge_004; // 0x710 (8)
	struct UStaticMeshComponent PARTS3#SM_Transtainer_Merge_003; // 0x718 (8)
	struct UStaticMeshComponent PARTS2#SM_Transtainer_Merge_002; // 0x720 (8)
	struct UStaticMeshComponent PARTS1#Switch; // 0x728 (8)
	struct USplineComponent SPLINE1#Spline; // 0x730 (8)
	struct UStaticMeshComponent WHEEL4#SM_Test_TransTainer_Tire4; // 0x738 (8)
	struct UStaticMeshComponent WHEEL3#SM_Test_TransTainer_Tire3; // 0x740 (8)
	struct UStaticMeshComponent WHEEL2#SM_Test_TransTainer_Tire2; // 0x748 (8)
	struct UStaticMeshComponent WHEEL1#SM_Test_TransTainer_Tire1; // 0x750 (8)
	struct UStaticMeshComponent BODY#SM_Merged_FakeMesh_001; // 0x758 (8)
	struct UStaticMeshComponent ALIVEOBJ#; // 0x760 (8)
};

