// BlueprintGeneratedClass BP_WeaponCase_001.BP_WeaponCase_001_C
class ABP_WeaponCase_001_C : public UActor {

public:

	struct UStaticMeshComponent HK417; // 0x220 (8)
	struct UStaticMeshComponent MP5_002; // 0x228 (8)
	struct UStaticMeshComponent MP5_001; // 0x230 (8)
	struct UStaticMeshComponent MP5_000; // 0x238 (8)
	struct UStaticMeshComponent HK416; // 0x240 (8)
	struct UStaticMeshComponent AK47; // 0x248 (8)
	struct UStaticMeshComponent SM_WeaponCase_002; // 0x250 (8)
	struct UStaticMeshComponent SM_WeaponCase_001; // 0x258 (8)
	struct USceneComponent DefaultSceneRoot; // 0x260 (8)
};

