// WidgetBlueprintGeneratedClass BreakInto.BreakInto_C
class UBreakInto_C : public UPDBreakIntoUI {

public:

	struct UImage IMG_MapBg; // 0x380 (8)
	struct UImage IMG_MapOutline; // 0x388 (8)
	struct UImage IMG_PlayerInfo_Bg; // 0x390 (8)
	struct UImage IMG_PlayerInfo_Outglow; // 0x398 (8)
	struct UImage IMG_PlayerInfo_Outline; // 0x3A0 (8)
	struct UImage IMG_SceneBG; // 0x3A8 (8)
	struct UImage IMG_TeamArea_Bg; // 0x3B0 (8)
	struct UCanvasPanel PW_PlayTimeNum; // 0x3B8 (8)
	struct URetainerBox RB_Round; // 0x3C0 (8)
	struct UPDTextBlock TB_ATkCaption; // 0x3C8 (8)
	struct UPDTextBlock TB_PlayTimeComma; // 0x3D0 (8)
};

