// WidgetBlueprintGeneratedClass CCTV.CCTV_C
class UCCTV_C : public UPDCCTVUI {

public:

	struct UWidgetAnimation AlertStart; // 0x2A8 (8)
	struct UWidgetAnimation AlertEnd; // 0x2B0 (8)
	struct UWidgetAnimation Anim_Cam; // 0x2B8 (8)
	struct UWidgetAnimation Anim_Rec; // 0x2C0 (8)
	struct UWidgetAnimation Anim_FocusBar; // 0x2C8 (8)
	struct UWidgetAnimation Anim_Equalizer; // 0x2D0 (8)
	struct UImage IMG_Cursor; // 0x2D8 (8)
	struct UImage IMG_Deco_01; // 0x2E0 (8)
	struct UImage IMG_Deco_02; // 0x2E8 (8)
	struct UImage IMG_Deco_03; // 0x2F0 (8)
	struct UImage IMG_Deco_04; // 0x2F8 (8)
	struct UImage IMG_Deco_05; // 0x300 (8)
	struct UImage IMG_Deco_06; // 0x308 (8)
	struct UImage IMG_Deco_07; // 0x310 (8)
	struct UImage IMG_Deco_08; // 0x318 (8)
	struct UImage IMG_Deco_Focus_B; // 0x320 (8)
	struct UImage IMG_Deco_Focus_L; // 0x328 (8)
	struct UImage IMG_Deco_Focus_LB; // 0x330 (8)
	struct UImage IMG_Deco_Focus_LT; // 0x338 (8)
	struct UImage IMG_Deco_Focus_R; // 0x340 (8)
	struct UImage IMG_Deco_Focus_RB; // 0x348 (8)
	struct UImage IMG_Deco_Focus_RT; // 0x350 (8)
	struct UImage IMG_Deco_Focus_T; // 0x358 (8)
	struct UImage IMG_Deco_OutConer_LB; // 0x360 (8)
	struct UImage IMG_Deco_OutConer_LT; // 0x368 (8)
	struct UImage IMG_Deco_OutConer_RB; // 0x370 (8)
	struct UImage IMG_Deco_OutConer_RT; // 0x378 (8)
	struct UImage IMG_Deco_PatternB01; // 0x380 (8)
	struct UImage IMG_Deco_PatternB02; // 0x388 (8)
	struct UImage IMG_Deco_PatternL; // 0x390 (8)
	struct UImage IMG_Deco_PatternR; // 0x398 (8)
	struct UImage IMG_Deco_PatternT; // 0x3A0 (8)
	struct UImage IMG_Equalizer_L; // 0x3A8 (8)
	struct UImage IMG_Equalizer_LBg; // 0x3B0 (8)
	struct UImage IMG_Equalizer_R; // 0x3B8 (8)
	struct UImage IMG_Equalizer_RBg; // 0x3C0 (8)
	struct UImage IMG_Focus; // 0x3C8 (8)
};

