// WidgetBlueprintGeneratedClass ClanInfo.ClanInfo_C
class UClanInfo_C : public UPDClanInfoUI {

public:

	struct UImage IMG_ApplicantListGuideBg; // 0x3F0 (8)
	struct UImage IMG_Bar_01; // 0x3F8 (8)
	struct UImage IMG_Bar_02; // 0x400 (8)
	struct UImage IMG_Bar_03; // 0x408 (8)
	struct UImage IMG_Bar_04; // 0x410 (8)
	struct UImage IMG_Bar_05; // 0x418 (8)
	struct UImage IMG_Bar_06; // 0x420 (8)
	struct UImage IMG_ClanDescBG; // 0x428 (8)
	struct UImage IMG_GuideBg; // 0x430 (8)
	struct UImage IMG_Info_Normal; // 0x438 (8)
	struct UImage IMG_Info_Underline; // 0x440 (8)
	struct UImage IMG_InputBg; // 0x448 (8)
	struct UImage IMG_InputBg_01; // 0x450 (8)
	struct UImage IMG_InputBg_02; // 0x458 (8)
	struct UImage IMG_InputBg_03; // 0x460 (8)
	struct UImage IMG_Outline; // 0x468 (8)
	struct UImage IMG_Outline_01; // 0x470 (8)
	struct UImage IMG_Outline_02; // 0x478 (8)
	struct UImage IMG_Outline_03; // 0x480 (8)
	struct UImage IMG_SLotBg; // 0x488 (8)
	struct UImage IMG_SlotOutline; // 0x490 (8)
};

