// WidgetBlueprintGeneratedClass ClanCreate.ClanCreate_C
class UClanCreate_C : public UPDClanCreateUI {

public:

	struct UImage IMG_Bar_01; // 0x350 (8)
	struct UImage IMG_Bar_02; // 0x358 (8)
	struct UImage IMG_Bar_03; // 0x360 (8)
	struct UImage IMG_Bar_04; // 0x368 (8)
	struct UImage IMG_Bar_05; // 0x370 (8)
	struct UImage IMG_Bar_06; // 0x378 (8)
	struct UImage IMG_ClanDescBG; // 0x380 (8)
	struct UImage IMG_InputBg; // 0x388 (8)
	struct UImage IMG_InputBg_01; // 0x390 (8)
	struct UImage IMG_InputBg_02; // 0x398 (8)
	struct UImage IMG_InputBg_03; // 0x3A0 (8)
	struct UImage IMG_Outline; // 0x3A8 (8)
	struct UImage IMG_Outline_01; // 0x3B0 (8)
	struct UImage IMG_Outline_02; // 0x3B8 (8)
	struct UImage IMG_Outline_03; // 0x3C0 (8)
	struct UImage IMG_SLotBg; // 0x3C8 (8)
	struct UImage IMG_SlotOutline; // 0x3D0 (8)
};

