// WidgetBlueprintGeneratedClass ClanInfoPopup.ClanInfoPopup_C
class UClanInfoPopup_C : public UPDClanInfoPopupUI {

public:

	struct UImage IMG_ActivityIndex; // 0x328 (8)
	struct UImage IMG_Bar_01; // 0x330 (8)
	struct UImage IMG_Bar_02; // 0x338 (8)
	struct UImage IMG_Bar_03; // 0x340 (8)
	struct UImage IMG_Bar_04; // 0x348 (8)
	struct UImage IMG_Bar_05; // 0x350 (8)
	struct UImage IMG_Bar_06; // 0x358 (8)
	struct UImage IMG_Bar_07; // 0x360 (8)
	struct UImage IMG_Bar_08; // 0x368 (8)
	struct UImage IMG_Bar_09; // 0x370 (8)
	struct UImage Img_BgBox; // 0x378 (8)
	struct UImage IMG_ClanDesc_Bg; // 0x380 (8)
	struct UImage IMG_Comunnity_Bg; // 0x388 (8)
	struct UImage IMG_SLotBg; // 0x390 (8)
};

