// WidgetBlueprintGeneratedClass ClanList.ClanList_C
class UClanList_C : public UPDClanListUI {

public:

	struct UImage Img_BottomLine; // 0x2C0 (8)
	struct UImage IMG_ClanListContext_Outline; // 0x2C8 (8)
	struct UImage IMG_GuideBg; // 0x2D0 (8)
	struct UImage IMG_InputBg; // 0x2D8 (8)
	struct UImage IMG_MenuBg; // 0x2E0 (8)
	struct UImage IMG_Outline; // 0x2E8 (8)
	struct UImage IMG_SLotBg; // 0x2F0 (8)
	struct UImage IMG_SlotOutline; // 0x2F8 (8)
};

