// WidgetBlueprintGeneratedClass CoinInfo.CoinInfo_C
class UCoinInfo_C : public UPDCoinInfoUI {

public:

	struct UWidgetAnimation GetRoundCoinEnd_Backup; // 0x2C0 (8)
	struct UWidgetAnimation GetRoundCoinStart_Backup; // 0x2C8 (8)
	struct UWidgetAnimation GetRoundCoinEnd; // 0x2D0 (8)
	struct UWidgetAnimation GetRoundCoinStart; // 0x2D8 (8)
	struct UWidgetAnimation LoseCoin1; // 0x2E0 (8)
	struct UWidgetAnimation GetCoin1; // 0x2E8 (8)
	struct UWidgetAnimation LoseCoinAniStart; // 0x2F0 (8)
	struct UWidgetAnimation GetCoinEnd; // 0x2F8 (8)
	struct UWidgetAnimation GetCoinAniStart; // 0x300 (8)
	struct UCoinInfoItem_C CoinInfoItem; // 0x308 (8)
	struct UCoinInfoItem_C CoinInfoItem_82; // 0x310 (8)
	struct UCoinInfoItem_C CoinInfoItem_203; // 0x318 (8)
	struct UImage IMG_Back; // 0x320 (8)
	struct UImage IMG_Coin_2; // 0x328 (8)
	struct UImage IMG_CoinFX; // 0x330 (8)
	struct UImage IMG_Light_BackTop; // 0x338 (8)
	struct UPDImage IMG_RewardBack; // 0x340 (8)
	struct UPDTextBlock TB_GetCoin; // 0x348 (8)
	struct UPDTextBlock TB_GetCoin_Back; // 0x350 (8)
	struct UPDTextBlock TB_HoldingCoin; // 0x358 (8)
};

