// WidgetBlueprintGeneratedClass CommunityPopup.CommunityPopup_C
class UCommunityPopup_C : public UPDCommunityPopupUI {

public:

	struct UWidgetAnimation Anim_SceneOut; // 0x3D0 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x3D8 (8)
	struct UImage IMG_Arrow; // 0x3E0 (8)
	struct UImage Img_Bg; // 0x3E8 (8)
	struct UImage IMG_CloseBtn_Bg; // 0x3F0 (8)
	struct UImage Img_ContentsLine_Bottom; // 0x3F8 (8)
	struct UImage Img_ContentsLine_Top; // 0x400 (8)
	struct UImage IMG_FindPartyMannerToolTipBg; // 0x408 (8)
	struct UImage IMG_FindPartyMannerToolTipOutline; // 0x410 (8)
	struct UImage IMG_MannerToolTipBg; // 0x418 (8)
	struct UImage IMG_MannerToolTipOutline; // 0x420 (8)
	struct UImage IMG_MenuBg; // 0x428 (8)
	struct UImage IMG_Outline; // 0x430 (8)
	struct UImage IMG_Outline_L; // 0x438 (8)
	struct UImage IMG_Outline_T; // 0x440 (8)
	struct UImage IMG_ToolTipBg; // 0x448 (8)
	struct UImage IMG_ToolTipOutline; // 0x450 (8)
	struct UImage IMG_TopBg; // 0x458 (8)
};

