// WidgetBlueprintGeneratedClass CustomRoom.CustomRoom_C
class UCustomRoom_C : public UPDCustomRoomUI {

public:

	struct UWidgetAnimation Anim_SceneOut; // 0x3B0 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x3B8 (8)
	struct UImage IMG_ActiveBarDeco; // 0x3C0 (8)
	struct UImage Img_Bg; // 0x3C8 (8)
	struct UImage IMG_CharChange_Outline; // 0x3D0 (8)
	struct UImage IMG_CharChangeBg; // 0x3D8 (8)
	struct UImage IMG_Community_HoverDown; // 0x3E0 (8)
	struct UImage IMG_Community_Normal; // 0x3E8 (8)
	struct UImage IMG_Defence_DescBg; // 0x3F0 (8)
	struct UImage IMG_DefenceDeco; // 0x3F8 (8)
	struct UImage IMG_DefenceDeco_2; // 0x400 (8)
	struct UImage IMG_DefenceDeco_3; // 0x408 (8)
	struct UImage IMG_DefenceDeco_4; // 0x410 (8)
	struct UImage IMG_DefenceDeco_5; // 0x418 (8)
	struct UImage IMG_DefenceDeco_6; // 0x420 (8)
	struct UImage IMG_DefenceDeco_01; // 0x428 (8)
	struct UImage IMG_DefenceDeco_02; // 0x430 (8)
	struct UImage IMG_DefenceDeco_03; // 0x438 (8)
	struct UImage IMG_DefenceDeco_04; // 0x440 (8)
	struct UImage IMG_DefenceDeco_05; // 0x448 (8)
	struct UImage IMG_DefenceDeco_06; // 0x450 (8)
	struct UImage IMG_MapDisabled; // 0x458 (8)
	struct UImage IMG_MatchSettingLine; // 0x460 (8)
	struct UImage IMG_MenuBg; // 0x468 (8)
	struct UImage IMG_Offence_DescBg; // 0x470 (8)
	struct UImage IMG_OffenceDeco_01; // 0x478 (8)
	struct UImage IMG_OffenceDeco_02; // 0x480 (8)
	struct UImage IMG_OffenceDeco_03; // 0x488 (8)
	struct UImage IMG_OffenceDeco_04; // 0x490 (8)
	struct UImage IMG_OffenceDeco_05; // 0x498 (8)
	struct UImage IMG_OffenceDeco_06; // 0x4A0 (8)
	struct UImage IMG_OptionIcon_HoverDown; // 0x4A8 (8)
	struct UImage IMG_OptionIcon_Normal; // 0x4B0 (8)
	struct UImage IMG_Outglow_Agent; // 0x4B8 (8)
	struct UImage IMG_Outline; // 0x4C0 (8)
	struct UImage IMG_TitleActiveBar; // 0x4C8 (8)
	struct UImage IMG_Wait_DescBg; // 0x4D0 (8)
	struct UImage IMG_WinDisabled; // 0x4D8 (8)
	struct UWidgetSwitcher WS_Btn_Case; // 0x4E0 (8)
	struct UWidgetSwitcher WS_Community_Case; // 0x4E8 (8)
};

