// WidgetBlueprintGeneratedClass CustomJoinPopup.CustomJoinPopup_C
class UCustomJoinPopup_C : public UPDCustomJoinPopupUI {

public:

	struct UWidgetAnimation Anim_SceneOut; // 0x2D8 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x2E0 (8)
	struct UImage IMG_Blinder; // 0x2E8 (8)
	struct UImage IMG_BoxGlow; // 0x2F0 (8)
	struct UImage IMG_BoxOutline; // 0x2F8 (8)
	struct UImage IMG_Deco_BL; // 0x300 (8)
	struct UImage IMG_Deco_BR; // 0x308 (8)
	struct UImage IMG_Deco_TL; // 0x310 (8)
	struct UImage IMG_Deco_TR; // 0x318 (8)
	struct UImage IMG_Divider; // 0x320 (8)
	struct UImage IMG_InputBg; // 0x328 (8)
	struct UImage IMG_Outglow; // 0x330 (8)
	struct UImage IMG_Outline; // 0x338 (8)
	struct UImage IMG_PopupBg; // 0x340 (8)
	struct UImage IMG_TopDeco; // 0x348 (8)
	struct UImage IMG_TopDeco_Glow; // 0x350 (8)
};

