// WidgetBlueprintGeneratedClass CustomCharacterDeco.CustomCharacterDeco_C
class UCustomCharacterDeco_C : public UPDCustomCharacterDecoUI {

public:

	struct UWidgetAnimation Anim_SceneOut; // 0x300 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x308 (8)
	struct UImage IMG_ActiveBarDeco; // 0x310 (8)
	struct UImage IMG_Categorizer; // 0x318 (8)
	struct UImage IMG_CategoryBg; // 0x320 (8)
	struct UImage IMG_CategoryOutline; // 0x328 (8)
	struct UImage IMG_ListBg; // 0x330 (8)
	struct UImage IMG_ListOutline; // 0x338 (8)
	struct UImage IMG_Outglow_Title; // 0x340 (8)
	struct UImage IMG_TitleActiveBar; // 0x348 (8)
};

