// WidgetBlueprintGeneratedClass CustomCharacterPerk.CustomCharacterPerk_C
class UCustomCharacterPerk_C : public UPDCustomCharacterPerkUI {

public:

	struct UWidgetAnimation Anim_SceneOut; // 0x410 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x418 (8)
	struct UImage IMG_ActiveBarDeco; // 0x420 (8)
	struct UImage IMG_AnimIndicator_A; // 0x428 (8)
	struct UImage IMG_BottomBar; // 0x430 (8)
	struct UImage IMG_BottomBg; // 0x438 (8)
	struct UImage IMG_Divider; // 0x440 (8)
	struct UImage IMG_LodingBg; // 0x448 (8)
	struct UImage IMG_MouseL; // 0x450 (8)
	struct UImage IMG_MouseR; // 0x458 (8)
	struct UImage IMG_Outglow; // 0x460 (8)
	struct UImage IMG_Outglow_Title; // 0x468 (8)
	struct UImage IMG_OwnListOutline; // 0x470 (8)
	struct UImage IMG_PopupBg; // 0x478 (8)
	struct UImage IMG_PresetDivider; // 0x480 (8)
	struct UImage IMG_PresetLIstBg; // 0x488 (8)
	struct UImage IMG_PresetListLine; // 0x490 (8)
	struct UImage IMG_PresetListOutline; // 0x498 (8)
	struct UImage IMG_Progress_HDivider; // 0x4A0 (8)
	struct UImage IMG_SkillToolTipBg; // 0x4A8 (8)
	struct UImage IMG_SkillToolTipOutline; // 0x4B0 (8)
	struct UImage IMG_TitleActiveBar; // 0x4B8 (8)
	struct UImage IMG_TopBar; // 0x4C0 (8)
};

