// WidgetBlueprintGeneratedClass CustomWeapon.CustomWeapon_C
class UCustomWeapon_C : public UPDCustomWeaponUI {

public:

	struct UWidgetAnimation Anim_SceneOut; // 0x380 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x388 (8)
	struct UImage IMG_ActiveBarDeco; // 0x390 (8)
	struct UImage IMG_CategoryBg; // 0x398 (8)
	struct UImage IMG_CategoryOutline; // 0x3A0 (8)
	struct UImage IMG_ListBg; // 0x3A8 (8)
	struct UImage IMG_ListOutline; // 0x3B0 (8)
	struct UImage IMG_Outglow_Title; // 0x3B8 (8)
	struct UImage IMG_SkinLIstBg; // 0x3C0 (8)
	struct UImage IMG_SkinLIstOutline; // 0x3C8 (8)
	struct UImage IMG_Stat_Weapon_Divider; // 0x3D0 (8)
	struct UImage IMG_TitleActiveBar; // 0x3D8 (8)
};

