// WidgetBlueprintGeneratedClass DamageScreenIndicator.DamageScreenIndicator_C
class UDamageScreenIndicator_C : public UPDDamageScreenIndicatorUI {

public:

	struct UWidgetAnimation Anim_Damage_Left; // 0x328 (8)
	struct UWidgetAnimation Anim_Damage_LeftDown; // 0x330 (8)
	struct UWidgetAnimation Anim_Damage_Down; // 0x338 (8)
	struct UWidgetAnimation Anim_Damage_RightDown; // 0x340 (8)
	struct UWidgetAnimation Anim_Damage_Right; // 0x348 (8)
	struct UWidgetAnimation Anim_Damage_RightUp; // 0x350 (8)
	struct UWidgetAnimation Anim_Damage_Up; // 0x358 (8)
	struct UWidgetAnimation Anim_Damage_LeftUp; // 0x360 (8)
};

