// WidgetBlueprintGeneratedClass DebugLog.DebugLog_C
class UDebugLog_C : public UPDDebugLogUI {

public:

	struct UWidgetAnimation Anim_SceneOut; // 0x388 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x390 (8)
	struct UImage IMG_ActiveBarDeco; // 0x398 (8)
	struct UImage IMG_Arrow_L; // 0x3A0 (8)
	struct UImage IMG_Arrow_R; // 0x3A8 (8)
	struct UImage Img_Bg; // 0x3B0 (8)
	struct UImage IMG_FileListOutline; // 0x3B8 (8)
	struct UImage IMG_ListBg; // 0x3C0 (8)
	struct UImage IMG_LogBg; // 0x3C8 (8)
	struct UImage IMG_LogOutline; // 0x3D0 (8)
	struct UImage IMG_Outglow_Title; // 0x3D8 (8)
	struct UImage IMG_TitleActiveBar; // 0x3E0 (8)
};

