// WidgetBlueprintGeneratedClass EquipLeptonListItem.EquipLeptonListItem_C
class UEquipLeptonListItem_C : public UPDEquipLeptonListItem {

public:

	struct UImage Img_Bg; // 0x318 (8)
	struct UImage IMG_Cross; // 0x320 (8)
	struct UImage IMG_EquipBg; // 0x328 (8)
	struct UImage IMG_LB; // 0x330 (8)
	struct UImage IMG_Lock; // 0x338 (8)
	struct UImage Img_LockBg; // 0x340 (8)
	struct UImage IMG_LT; // 0x348 (8)
	struct UImage IMG_RB; // 0x350 (8)
	struct UImage IMG_RT; // 0x358 (8)
};

