// WidgetBlueprintGeneratedClass EquipPerkList.EquipPerkList_C
class UEquipPerkList_C : public UPDEquipPerkList {

public:

	struct UImage IMG_BottomBg; // 0x328 (8)
	struct UImage IMG_Outglow; // 0x330 (8)
	struct UImage IMG_Perk_Alert; // 0x338 (8)
	struct UImage IMG_Perk_Alert_Bg; // 0x340 (8)
	struct UImage IMG_Perk_Alert_BgBack; // 0x348 (8)
	struct UImage IMG_Perk_Alert_Outline; // 0x350 (8)
	struct UImage IMG_SkillToolTipBg; // 0x358 (8)
	struct URichTextBlock RT_Perk_Alert_Desc; // 0x360 (8)
};

