// WidgetBlueprintGeneratedClass FindPartyListItem.FindPartyListItem_C
class UFindPartyListItem_C : public UPDFindPartyListItem {

public:

	struct UPDButton_C BTN_GradeNone; // 0x3C8 (8)
	struct UImage Img_BottomLine; // 0x3D0 (8)
	struct UImage IMG_Divider; // 0x3D8 (8)
	struct UImage IMG_Face_Outline; // 0x3E0 (8)
	struct UImage IMG_GradeNone; // 0x3E8 (8)
	struct UImage IMG_PictureBg; // 0x3F0 (8)
	struct UImage IMG_Ping_Bg; // 0x3F8 (8)
	struct UImage IMG_Recruit; // 0x400 (8)
	struct UImage IMG_RecruitDone_Bg; // 0x408 (8)
	struct UImage IMG_RecruitDone_Outline; // 0x410 (8)
	struct UImage IMG_RecuritFalied; // 0x418 (8)
	struct UImage IMG_SLotBg; // 0x420 (8)
	struct UImage IMG_ToolTipBg; // 0x428 (8)
	struct UImage IMG_ToolTipOutline; // 0x430 (8)
	struct UImage IMG_UserData_Bg; // 0x438 (8)
	struct UImage IMG_UserData_Divider; // 0x440 (8)
	struct UImage IMG_WaitingRecruited; // 0x448 (8)
	struct UImage IMG_WaitingRecruited_Bg; // 0x450 (8)
	struct UImage IMG_WaitingRecruited_Outline; // 0x458 (8)
};

