// WidgetBlueprintGeneratedClass FindPartyPage.FindPartyPage_C
class UFindPartyPage_C : public UPDFindPartyPageUI {

public:

	struct UImage IMG_Brick_Bg; // 0x2F8 (8)
	struct UImage IMG_Category_BottomLine; // 0x300 (8)
	struct UImage IMG_Category_Line; // 0x308 (8)
	struct UImage IMG_FindParty; // 0x310 (8)
	struct UImage IMG_FindParty_2; // 0x318 (8)
	struct UImage IMG_FindParty_3; // 0x320 (8)
	struct UImage IMG_FindParty_Done; // 0x328 (8)
	struct UImage IMG_FindParty_Done_Outline; // 0x330 (8)
	struct UImage IMG_FindParty_Searching; // 0x338 (8)
	struct UImage IMG_FindParty_Searching_Outline; // 0x340 (8)
	struct UImage IMG_Menu_Bg; // 0x348 (8)
	struct UImage IMG_Menu_Line; // 0x350 (8)
	struct UImage IMG_Mode; // 0x358 (8)
	struct UImage IMG_Outline_L; // 0x360 (8)
	struct UImage IMG_Outline_T; // 0x368 (8)
	struct UImage IMG_PartyList_Bg; // 0x370 (8)
	struct UImage IMG_Register; // 0x378 (8)
	struct UImage IMG_Register_Disabled; // 0x380 (8)
	struct UImage IMG_Register_Searching; // 0x388 (8)
	struct UImage IMG_Register_Searching_Outline; // 0x390 (8)
	struct UImage IMG_RegisterMercenary_Bg; // 0x398 (8)
	struct UImage IMG_Voice; // 0x3A0 (8)
	struct UWidgetSwitcher WS_Mode; // 0x3A8 (8)
	struct UWidgetSwitcher WS_Voice; // 0x3B0 (8)
};

