// WidgetBlueprintGeneratedClass FriendClanItem.FriendClanItem_C
class UFriendClanItem_C : public UPDFriendClanItem {

public:

	struct UImage Img_BottomLine; // 0x380 (8)
	struct UImage IMG_Category_Arrow; // 0x388 (8)
	struct UImage IMG_Category_BottomLine; // 0x390 (8)
	struct UImage IMG_Face_Outline; // 0x398 (8)
	struct UImage IMG_GradeNone_Bg; // 0x3A0 (8)
	struct UImage IMG_PictureBg; // 0x3A8 (8)
	struct UImage IMG_ToolTipBg; // 0x3B0 (8)
	struct UImage IMG_ToolTipOutline; // 0x3B8 (8)
};

