// WidgetBlueprintGeneratedClass FriendListItem.FriendListItem_C
class UFriendListItem_C : public UPDFriendListItem {

public:

	struct UImage Img_BottomLine; // 0x3A8 (8)
	struct UImage IMG_Category_Arrow; // 0x3B0 (8)
	struct UImage IMG_Category_BottomLine; // 0x3B8 (8)
	struct UImage IMG_Face_Outline; // 0x3C0 (8)
	struct UImage IMG_GradeNone_Bg; // 0x3C8 (8)
	struct UImage IMG_PictureBg; // 0x3D0 (8)
	struct UImage IMG_ToolTipBg; // 0x3D8 (8)
	struct UImage IMG_ToolTipOutline; // 0x3E0 (8)
};

