// WidgetBlueprintGeneratedClass GameResult.GameResult_C
class UGameResult_C : public UPDGameResultUI {

public:

	struct UWidgetAnimation Anim_Summary_Rank; // 0x618 (8)
	struct UWidgetAnimation Anim_RewardAppear; // 0x620 (8)
	struct UWidgetAnimation Anim_LevelUp_GaugeGlow; // 0x628 (8)
	struct UWidgetAnimation Anim_LevelUp; // 0x630 (8)
	struct UWidgetAnimation Anim_ExpAppear; // 0x638 (8)
	struct UWidgetAnimation Anim_ScoreboardAppear; // 0x640 (8)
	struct UWidgetAnimation Anim_Summary_BlueDefeat; // 0x648 (8)
	struct UWidgetAnimation Anim_Summary_BlueWin; // 0x650 (8)
	struct UWidgetAnimation Anim_GuideAppear; // 0x658 (8)
	struct UWidgetAnimation Anim_DefeatAppear; // 0x660 (8)
	struct UWidgetAnimation Anim_VictoryAppear_Orange; // 0x668 (8)
	struct UWidgetAnimation Anim_VictoryAppear_Blue; // 0x670 (8)
	struct UWidgetAnimation Anim_SummaryMenuAppear; // 0x678 (8)
	struct UWidgetAnimation Anim_Defeat; // 0x680 (8)
	struct UWidgetAnimation Anim_Victory; // 0x688 (8)
	struct UImage IMG_BottomDeco_Fx01; // 0x690 (8)
	struct UImage IMG_BottomDeco_Fx02; // 0x698 (8)
	struct UImage IMG_CurrentExp_Bar01; // 0x6A0 (8)
	struct UImage IMG_CurrentExp_Bar02; // 0x6A8 (8)
	struct UImage IMG_CurrentLv_Wings; // 0x6B0 (8)
	struct UImage IMG_Exp_TopDeco_Fx01; // 0x6B8 (8)
	struct UImage IMG_Exp_TopDeco_Fx02; // 0x6C0 (8)
	struct UImage IMG_Exp_TopDeco_Fx03; // 0x6C8 (8)
	struct UImage IMG_Exp_TopDeco_Fx04; // 0x6D0 (8)
	struct UImage IMG_Exp_TopDeco_Fx05; // 0x6D8 (8)
	struct UImage IMG_Exp_TopDeco_Fx06; // 0x6E0 (8)
	struct UImage IMG_Exp_TopDeco_Wings; // 0x6E8 (8)
	struct UImage IMG_ExpGauge_Bg; // 0x6F0 (8)
	struct UImage IMG_ExpGauge_Outglow; // 0x6F8 (8)
	struct UImage IMG_FX_TitleGlow_Blue01; // 0x700 (8)
	struct UImage IMG_FX_TitleGlow_Blue02; // 0x708 (8)
	struct UImage IMG_FX_TitleGlow_Yellow01; // 0x710 (8)
	struct UImage IMG_FX_TitleGlow_Yellow02; // 0x718 (8)
	struct UImage IMG_Hyphen; // 0x720 (8)
	struct UImage IMG_Match_Blinder; // 0x728 (8)
	struct UImage IMG_Match_FadeBg; // 0x730 (8)
	struct UImage IMG_NextLv_Wings; // 0x738 (8)
	struct UImage IMG_Outglow_Bottom; // 0x740 (8)
	struct UImage IMG_Outglow_Top; // 0x748 (8)
	struct UImage IMG_PrevExpBar01; // 0x750 (8)
	struct UImage IMG_PrevExpBar02; // 0x758 (8)
	struct UImage IMG_Progress_SlotBg; // 0x760 (8)
	struct UImage IMG_Reward_BgDeco_L01; // 0x768 (8)
	struct UImage IMG_Reward_BgDeco_L02; // 0x770 (8)
	struct UImage IMG_Reward_BgDeco_R01; // 0x778 (8)
	struct UImage IMG_Reward_BgDeco_R02; // 0x780 (8)
	struct UImage IMG_Reward_TopDeco_Fx01; // 0x788 (8)
	struct UImage IMG_Reward_TopDeco_Fx01_4; // 0x790 (8)
	struct UImage IMG_Reward_TopDeco_Fx02; // 0x798 (8)
	struct UImage IMG_Reward_TopDeco_Fx03; // 0x7A0 (8)
	struct UImage IMG_Reward_TopDeco_Fx04; // 0x7A8 (8)
	struct UImage IMG_RewardTitle_Bg; // 0x7B0 (8)
	struct UImage IMG_RewardTitle_Fx; // 0x7B8 (8)
	struct UImage IMG_SummaryFX_BlueWin01; // 0x7C0 (8)
	struct UImage IMG_SummaryFX_BlueWin02; // 0x7C8 (8)
	struct UImage IMG_ToolTipBg; // 0x7D0 (8)
	struct UImage IMG_ToolTipOutline; // 0x7D8 (8)
	struct UImage IMG_TopDeco_L01; // 0x7E0 (8)
	struct UImage IMG_TopDeco_L02; // 0x7E8 (8)
	struct UImage IMG_TopDeco_L03; // 0x7F0 (8)
	struct UImage IMG_TopDeco_L04; // 0x7F8 (8)
	struct UImage IMG_TopDeco_L05; // 0x800 (8)
	struct UImage IMG_TopDeco_L06; // 0x808 (8)
	struct UImage IMG_TopDeco_L07; // 0x810 (8)
	struct UImage IMG_TopDeco_L08; // 0x818 (8)
	struct UImage IMG_TopDeco_L09; // 0x820 (8)
	struct UImage IMG_TopDeco_L10; // 0x828 (8)
	struct UImage IMG_TotalExp_Bg; // 0x830 (8)
	struct URetainerBox RB_RewardTitle_BgMask; // 0x838 (8)
	struct URoundResultItem_C RoundResultItem; // 0x840 (8)
	struct URoundResultItem_C RoundResultItem_2; // 0x848 (8)
	struct URoundResultItem_C RoundResultItem_3; // 0x850 (8)
	struct URoundResultItem_C RoundResultItem_4; // 0x858 (8)
	struct URoundResultItem_C RoundResultItem_5; // 0x860 (8)
	struct URoundResultItem_C RoundResultItem_6; // 0x868 (8)
	struct URoundResultItem_C RoundResultItem_7; // 0x870 (8)
	struct URoundResultItem_C RoundResultItem_8; // 0x878 (8)
	struct URoundResultItem_C RoundResultItem_9; // 0x880 (8)
	struct URichTextBlock RT_Time; // 0x888 (8)
	int32_t Percent_Temp; // 0x890 (4)
	struct FVector2D T_CurExp; // 0x894 (8)
	struct FVector2D PArrow; // 0x89C (8)
};

