// WidgetBlueprintGeneratedClass InvenDivide.InvenDivide_C
class UInvenDivide_C : public UPDInvenDivide {

public:

	struct UImage IMG_AfterItemBg; // 0x2D8 (8)
	struct UImage IMG_Arrow_01; // 0x2E0 (8)
	struct UImage IMG_Arrow_02; // 0x2E8 (8)
	struct UImage IMG_BeforeItemBg; // 0x2F0 (8)
	struct UImage Img_Bg; // 0x2F8 (8)
	struct UImage IMG_Blinder; // 0x300 (8)
	struct UImage IMG_Outline; // 0x308 (8)
	struct UImage IMG_SliderBar_01; // 0x310 (8)
	struct UImage IMG_SliderBar_02; // 0x318 (8)
	struct UImage IMG_SliderBar_03; // 0x320 (8)
	struct UImage IMG_SliderBar_04; // 0x328 (8)
	struct UImage IMG_SliderBar_Bg; // 0x330 (8)
};

