// WidgetBlueprintGeneratedClass InvitePartyPopup.InvitePartyPopup_C
class UInvitePartyPopup_C : public UPDInvitePartyPopupUI {

public:

	struct UWidgetAnimation Anim_SceneOut; // 0x310 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x318 (8)
	struct UImage IMG_Blinder; // 0x320 (8)
	struct UImage IMG_BottomBar; // 0x328 (8)
	struct UImage IMG_Deco_BL; // 0x330 (8)
	struct UImage IMG_Deco_BR; // 0x338 (8)
	struct UImage IMG_Deco_TL; // 0x340 (8)
	struct UImage IMG_Deco_TR; // 0x348 (8)
	struct UImage IMG_PopupBg; // 0x350 (8)
	struct UImage IMG_TopBar; // 0x358 (8)
	struct UImage IMG_TopDeco; // 0x360 (8)
};

