// WidgetBlueprintGeneratedClass Login.Login_C
class ULogin_C : public UPDLoginUI {

public:

	struct UWidgetAnimation Anim_FadeIn; // 0x320 (8)
	struct UWidgetAnimation Anim_Alert; // 0x328 (8)
	struct UImage IMG_Alert; // 0x330 (8)
	struct UImage IMG_BottomBar; // 0x338 (8)
	struct UImage IMG_BoxBg; // 0x340 (8)
	struct UImage IMG_Deco01_Arrow; // 0x348 (8)
	struct UImage IMG_Deco01_TxtAnim; // 0x350 (8)
	struct UImage IMG_Fadein; // 0x358 (8)
	struct UImage IMG_ID_BG; // 0x360 (8)
	struct UImage IMG_ID_Outline; // 0x368 (8)
	struct UImage IMG_NA_Bg; // 0x370 (8)
	struct UImage IMG_NA_Divider; // 0x378 (8)
	struct UImage IMG_NA_Outline; // 0x380 (8)
	struct UImage IMG_PW_BG; // 0x388 (8)
	struct UImage IMG_PW_Outline; // 0x390 (8)
	struct UImage IMG_SaveID_Divider; // 0x398 (8)
	struct UImage IMG_SaveID_Outline; // 0x3A0 (8)
	struct UImage IMG_TopBar; // 0x3A8 (8)
	struct UImage IMG_UnkownLogo; // 0x3B0 (8)
};

