// WidgetBlueprintGeneratedClass Mail.Mail_C
class UMail_C : public UPDMailUI {

public:

	struct UImage IMG_BottomBar; // 0x2E8 (8)
	struct UImage IMG_BoxGlow; // 0x2F0 (8)
	struct UImage IMG_ContentBar; // 0x2F8 (8)
	struct UImage IMG_Deco_BL; // 0x300 (8)
	struct UImage IMG_Deco_BR; // 0x308 (8)
	struct UImage IMG_Deco_TL; // 0x310 (8)
	struct UImage IMG_Deco_TR; // 0x318 (8)
	struct UImage IMG_MailBg; // 0x320 (8)
	struct UImage IMG_PopupBg; // 0x328 (8)
	struct UImage IMG_TitleBar; // 0x330 (8)
	struct UImage IMG_TopBar; // 0x338 (8)
};

