// WidgetBlueprintGeneratedClass MailPopup.MailPopup_C
class UMailPopup_C : public UPDMailPopupUI {

public:

	struct UWidgetAnimation Anim_SceneOut; // 0x2E8 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x2F0 (8)
	struct UImage Img_Bg; // 0x2F8 (8)
	struct UImage IMG_CloseBtn_Bg; // 0x300 (8)
	struct UImage Img_ContentsLine_Bottom; // 0x308 (8)
	struct UImage Img_ContentsLine_Top; // 0x310 (8)
	struct UImage IMG_Outline_L; // 0x318 (8)
	struct UImage IMG_Outline_T; // 0x320 (8)
	struct UImage IMG_TopBg; // 0x328 (8)
};

