// WidgetBlueprintGeneratedClass MatchModeList.MatchModeList_C
class UMatchModeList_C : public UPDMatchModeList {

public:

	struct UWidgetAnimation Anim_SceneOut; // 0x2F8 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x300 (8)
	struct UImage Img_Bg; // 0x308 (8)
	struct UImage IMG_BottomFx; // 0x310 (8)
	struct UImage Img_BottomLine; // 0x318 (8)
	struct UImage IMG_Disabled_Bg; // 0x320 (8)
	struct UImage IMG_Disabled_Icon; // 0x328 (8)
	struct UImage IMG_Disabled_Outline; // 0x330 (8)
	struct UImage IMG_MatchingTitle_Hover; // 0x338 (8)
	struct UImage IMG_MatchingTitle_Normal; // 0x340 (8)
	struct UImage Img_TopLine; // 0x348 (8)
};

