// BlueprintGeneratedClass Merge_BP_Gas_Station_02.Merge_BP_Gas_Station_02_C
class AMerge_BP_Gas_Station_02_C : public UActor {

public:

	struct UStaticMeshComponent SM_Gas_Station_003; // 0x220 (8)
	struct UStaticMeshComponent StaticMeshComponent7; // 0x228 (8)
	struct UStaticMeshComponent StaticMeshComponent8; // 0x230 (8)
	struct UStaticMeshComponent StaticMeshComponent9; // 0x238 (8)
	struct UStaticMeshComponent StaticMeshComponent10; // 0x240 (8)
	struct UStaticMeshComponent StaticMeshComponent3; // 0x248 (8)
	struct UStaticMeshComponent StaticMeshComponent4; // 0x250 (8)
	struct UStaticMeshComponent StaticMeshComponent5; // 0x258 (8)
	struct UStaticMeshComponent StaticMeshComponent6; // 0x260 (8)
	struct USceneComponent SharedRoot; // 0x268 (8)
	struct UStaticMeshComponent SM_Gas_Station_Shadow_15; // 0x270 (8)
	struct UStaticMeshComponent SM_Gas_Station_Shadow_16; // 0x278 (8)
	struct UStaticMeshComponent SM_Gas_Station_Shadow_14; // 0x280 (8)
	struct UStaticMeshComponent SM_Gas_Station_Shadow_13; // 0x288 (8)
	struct UStaticMeshComponent SM_Gas_Station_Shadow_12; // 0x290 (8)
	struct UStaticMeshComponent SM_Gas_Station_Shadow_09; // 0x298 (8)
	struct UStaticMeshComponent SM_Gas_Station_Shadow_11; // 0x2A0 (8)
	struct UStaticMeshComponent SM_Gas_Station__002; // 0x2A8 (8)
	struct UStaticMeshComponent StaticMeshComponent20; // 0x2B0 (8)
	struct UStaticMeshComponent StaticMeshComponent19; // 0x2B8 (8)
	struct UStaticMeshComponent StaticMeshComponent18; // 0x2C0 (8)
	struct UStaticMeshComponent StaticMeshComponent17; // 0x2C8 (8)
	struct UStaticMeshComponent StaticMeshComponent14; // 0x2D0 (8)
	struct USceneComponent DefaultSceneRoot; // 0x2D8 (8)
};

