// BlueprintGeneratedClass Merge_BP_WareHouse_Inside_002.Merge_BP_WareHouse_Inside_002_C
class AMerge_BP_WareHouse_Inside_002_C : public UActor {

public:

	struct UStaticMeshComponent SM_BoxReplaceMetal_006; // 0x220 (8)
	struct UStaticMeshComponent SM_BoxReplaceMetal_005; // 0x228 (8)
	struct UStaticMeshComponent SM_BoxReplaceMetal_004; // 0x230 (8)
	struct UStaticMeshComponent SM_BoxReplaceMetal_003; // 0x238 (8)
	struct UStaticMeshComponent SM_ElectricPainel_008; // 0x240 (8)
	struct UStaticMeshComponent SM_Exit_002; // 0x248 (8)
	struct UStaticMeshComponent SM_MERGED_Railing9_002; // 0x250 (8)
	struct UStaticMeshComponent SM_MERGED_Railing9_001; // 0x258 (8)
	struct UStaticMeshComponent SM_FloorDecal_LetterSmallA3; // 0x260 (8)
	struct UStaticMeshComponent SM_FloorDecal_LetterSmallA2; // 0x268 (8)
	struct UStaticMeshComponent SM_FloorDecal_LetterSmallA1; // 0x270 (8)
	struct UStaticMeshComponent StaticMesh9; // 0x278 (8)
	struct UStaticMeshComponent StaticMesh8; // 0x280 (8)
	struct UStaticMeshComponent SM_Exit_009; // 0x288 (8)
	struct UStaticMeshComponent SM_Exit_008; // 0x290 (8)
	struct UStaticMeshComponent SM_Exit_004; // 0x298 (8)
	struct UStaticMeshComponent SM_Exit_003; // 0x2A0 (8)
	struct UStaticMeshComponent SM_ElectricPainel_007; // 0x2A8 (8)
	struct UStaticMeshComponent SM_Exit_001; // 0x2B0 (8)
	struct UStaticMeshComponent SM_FloorDecal_QuadRed2x3; // 0x2B8 (8)
	struct UStaticMeshComponent SM_FloorDecal_QuadRed2x2; // 0x2C0 (8)
	struct UStaticMeshComponent SM_FloorDecal_QuadRed2x1; // 0x2C8 (8)
	struct UStaticMeshComponent SM_LedLight_001_03; // 0x2D0 (8)
	struct UStaticMeshComponent SM_LedLight_001_02; // 0x2D8 (8)
	struct UStaticMeshComponent SM_LedLight_001_01; // 0x2E0 (8)
	struct UStaticMeshComponent SM_MERGED_DockPipe_005; // 0x2E8 (8)
	struct UStaticMeshComponent SM_MERGED_DockPipe_004; // 0x2F0 (8)
	struct UStaticMeshComponent StaticMeshComponent933; // 0x2F8 (8)
	struct UStaticMeshComponent StaticMeshComponent367; // 0x300 (8)
	struct UStaticMeshComponent StaticMeshComponent366; // 0x308 (8)
	struct UStaticMeshComponent StaticMeshComponent932; // 0x310 (8)
	struct UStaticMeshComponent StaticMeshComponent302; // 0x318 (8)
	struct UStaticMeshComponent StaticMeshComponent301; // 0x320 (8)
	struct UStaticMeshComponent StaticMeshComponent300; // 0x328 (8)
	struct UStaticMeshComponent StaticMeshComponent299; // 0x330 (8)
	struct UStaticMeshComponent StaticMeshComponent170; // 0x338 (8)
	struct UStaticMeshComponent StaticMeshComponent169; // 0x340 (8)
	struct UStaticMeshComponent StaticMeshComponent168; // 0x348 (8)
	struct UStaticMeshComponent StaticMeshComponent167; // 0x350 (8)
	struct UStaticMeshComponent StaticMeshComponent165; // 0x358 (8)
	struct UStaticMeshComponent SM_MERGED_WareCrane_003; // 0x360 (8)
	struct UStaticMeshComponent SM_FuseBox_05; // 0x368 (8)
	struct UStaticMeshComponent SM_WallWire_015; // 0x370 (8)
	struct UStaticMeshComponent SM_FuseBox_04; // 0x378 (8)
	struct UStaticMeshComponent SM_WallWire_014; // 0x380 (8)
	struct UStaticMeshComponent SM_WallWire_013; // 0x388 (8)
	struct UStaticMeshComponent SM_FuseBox_03; // 0x390 (8)
	struct UStaticMeshComponent SM_WallLetter_Storage04_____; // 0x398 (8)
	struct USceneComponent DefaultSceneRoot; // 0x3A0 (8)
};

