// BlueprintGeneratedClass Merge_BP_Small_Warehouse_002_06_Epic.Merge_BP_Small_Warehouse_002_06_Epic_C
class AMerge_BP_Small_Warehouse_002_06_Epic_C : public UActor {

public:

	struct UStaticMeshComponent SM_MERGED_SWarehouse_002_06_Decal04; // 0x220 (8)
	struct UStaticMeshComponent SM_MERGED_SWarehouse_002_06_Decal03; // 0x228 (8)
	struct UStaticMeshComponent SM_MERGED_SWarehouse_002_06_Decal02; // 0x230 (8)
	struct UStaticMeshComponent SM_MERGED_SWarehouse_002_06_decal; // 0x238 (8)
	struct UStaticMeshComponent SM_SignB_013; // 0x240 (8)
	struct UStaticMeshComponent SM_SignB_03; // 0x248 (8)
	struct UStaticMeshComponent SM_Hallway_Vent_008; // 0x250 (8)
	struct UStaticMeshComponent SM_Hallway_Vent_007; // 0x258 (8)
	struct UStaticMeshComponent SM_FirstAidKit_004; // 0x260 (8)
	struct UStaticMeshComponent SM_SignB_02; // 0x268 (8)
	struct UStaticMeshComponent SM_Hallway_Vent_0011; // 0x270 (8)
	struct UStaticMeshComponent SM_SignB_010; // 0x278 (8)
	struct UStaticMeshComponent SM_SignB_09; // 0x280 (8)
	struct UStaticMeshComponent SM_Hallway_Vent_009; // 0x288 (8)
	struct UStaticMeshComponent SM_Hallway_Vent_006; // 0x290 (8)
	struct UStaticMeshComponent SM_Hallway_Vent_004; // 0x298 (8)
	struct UStaticMeshComponent SM_SignB_12; // 0x2A0 (8)
	struct UStaticMeshComponent SM_SignB_01; // 0x2A8 (8)
	struct UStaticMeshComponent SM_SignB_14; // 0x2B0 (8)
	struct USceneComponent DefaultSceneRoot; // 0x2B8 (8)
};

