// BlueprintGeneratedClass Merge_BP_Small_Warehouse_002_06_Inside.Merge_BP_Small_Warehouse_002_06_Inside_C
class AMerge_BP_Small_Warehouse_002_06_Inside_C : public UActor {

public:

	struct UStaticMeshComponent SM_FuseBox_05; // 0x220 (8)
	struct UStaticMeshComponent SM_SignB_012; // 0x228 (8)
	struct UStaticMeshComponent SM_SignB_011; // 0x230 (8)
	struct UStaticMeshComponent SM_Exit_002; // 0x238 (8)
	struct UStaticMeshComponent SM_WallSwitch_07; // 0x240 (8)
	struct UStaticMeshComponent SM_LampCeiling_006; // 0x248 (8)
	struct UStaticMeshComponent SM_Hallway_Vent_0011; // 0x250 (8)
	struct UStaticMeshComponent SM_LampCeiling_005; // 0x258 (8)
	struct UStaticMeshComponent SM_EmergencyBoardFull_001; // 0x260 (8)
	struct UStaticMeshComponent SM_LampCeiling_003; // 0x268 (8)
	struct UStaticMeshComponent SM_Exit_001; // 0x270 (8)
	struct USceneComponent DefaultSceneRoot; // 0x278 (8)
};

