// WidgetBlueprintGeneratedClass MissionScoreRoundResult.MissionScoreRoundResult_C
class UMissionScoreRoundResult_C : public UPDMissionScoreRoundResult {

public:

	struct UImage Img_Bg; // 0x328 (8)
	struct UImage IMG_InfoBoardBg; // 0x330 (8)
	struct UImage IMG_InfoBoardBLine; // 0x338 (8)
	struct UImage IMG_InfoBoardTLine; // 0x340 (8)
	struct UMissionScoreRoundResultPlayerInfo_C PlayerInfo01; // 0x348 (8)
	struct UMissionScoreRoundResultPlayerInfo_C PlayerInfo02; // 0x350 (8)
	struct UMissionScoreRoundResultPlayerInfo_C PlayerInfo03; // 0x358 (8)
	struct UMissionScoreRoundResultPlayerInfo_C PlayerInfo04; // 0x360 (8)
	struct UMissionScoreRoundResultPlayerInfo_C PlayerInfo05; // 0x368 (8)
	struct UMissionScoreRoundResultPlayerInfo_C PlayerInfo06; // 0x370 (8)
	struct UMissionScoreRoundResultPlayerInfo_C PlayerInfo07; // 0x378 (8)
	struct UMissionScoreRoundResultPlayerInfo_C PlayerInfo08; // 0x380 (8)
	struct UMissionScoreRoundResultPlayerInfo_C PlayerInfo09; // 0x388 (8)
	struct UMissionScoreRoundResultPlayerInfo_C PlayerInfo10; // 0x390 (8)
	struct UMissionScoreRoundResultTopRank_C TopRank1; // 0x398 (8)
	struct UMissionScoreRoundResultTopRank_C TopRank2; // 0x3A0 (8)
	struct UMissionScoreRoundResultTopRank_C TopRank3; // 0x3A8 (8)
};

