// WidgetBlueprintGeneratedClass NickNameCreate.NickNameCreate_C
class UNickNameCreate_C : public UPDNickNameCreateUI {

public:

	struct UWidgetAnimation Anim_InputGlow_Loop; // 0x2B0 (8)
	struct UWidgetAnimation Anim_Alert; // 0x2B8 (8)
	struct UImage IMG_Alert; // 0x2C0 (8)
	struct UImage IMG_AlertBg; // 0x2C8 (8)
	struct UImage IMG_Blinder; // 0x2D0 (8)
	struct UImage IMG_BoxGlow; // 0x2D8 (8)
	struct UImage IMG_BoxOutline; // 0x2E0 (8)
	struct UImage IMG_Deco_BL; // 0x2E8 (8)
	struct UImage IMG_Deco_BR; // 0x2F0 (8)
	struct UImage IMG_Deco_TL; // 0x2F8 (8)
	struct UImage IMG_Deco_TR; // 0x300 (8)
	struct UImage IMG_InputBg; // 0x308 (8)
	struct UImage IMG_Outglow; // 0x310 (8)
	struct UImage IMG_Outline; // 0x318 (8)
	struct UImage IMG_PopupBg; // 0x320 (8)
	struct UImage IMG_TopDeco; // 0x328 (8)
	struct UImage IMG_TopDeco_Glow; // 0x330 (8)
};

