// WidgetBlueprintGeneratedClass OKCancelPopup.OKCancelPopup_C
class UOKCancelPopup_C : public UPDOKCancelPopupUI {

public:

	struct UWidgetAnimation Anim_SceneOut; // 0x2F8 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x300 (8)
	struct UImage IMG_Blinder; // 0x308 (8)
	struct UImage IMG_BottomBar; // 0x310 (8)
	struct UImage IMG_Deco_BL; // 0x318 (8)
	struct UImage IMG_Deco_BR; // 0x320 (8)
	struct UImage IMG_Deco_TL; // 0x328 (8)
	struct UImage IMG_Deco_TR; // 0x330 (8)
	struct UImage IMG_PopupBg; // 0x338 (8)
	struct UImage IMG_TopBar; // 0x340 (8)
	struct UImage IMG_TopDeco; // 0x348 (8)
};

