// WidgetBlueprintGeneratedClass OptionPopup.OptionPopup_C
class UOptionPopup_C : public UPDOptionPopupUI {

public:

	struct UWidgetAnimation Anim_SceneOut; // 0x398 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x3A0 (8)
	struct UImage Img_BgBox; // 0x3A8 (8)
	struct UImage IMG_Blinder; // 0x3B0 (8)
	struct UImage Img_BottomLine; // 0x3B8 (8)
	struct UImage Img_ContentsLine_Bottom; // 0x3C0 (8)
	struct UImage Img_ContentsLine_Top; // 0x3C8 (8)
	struct UImage IMG_Ratings_01; // 0x3D0 (8)
	struct UImage IMG_Ratings_02; // 0x3D8 (8)
	struct UImage IMG_Ratings_03; // 0x3E0 (8)
	struct UImage Img_TopLine; // 0x3E8 (8)
};

