// WidgetBlueprintGeneratedClass OptionContent.OptionContent_C
class UOptionContent_C : public UPDOptionContent {

public:

	struct UImage IMG_CrossHairB; // 0x3A0 (8)
	struct UImage IMG_CrossHairC; // 0x3A8 (8)
	struct UImage IMG_CrossHairC_2; // 0x3B0 (8)
	struct UImage IMG_CrossHairC_B; // 0x3B8 (8)
	struct UImage IMG_CrossHairC_C; // 0x3C0 (8)
	struct UImage IMG_CrossHairC_L; // 0x3C8 (8)
	struct UImage IMG_CrossHairC_R; // 0x3D0 (8)
	struct UImage IMG_CrossHairC_T; // 0x3D8 (8)
	struct UImage IMG_CrossHairL; // 0x3E0 (8)
	struct UImage IMG_CrossHairR; // 0x3E8 (8)
	struct UImage IMG_Outline; // 0x3F0 (8)
	struct UImage IMG_Outline_2; // 0x3F8 (8)
};

