// WidgetBlueprintGeneratedClass OutGameTopMenu.OutGameTopMenu_C
class UOutGameTopMenu_C : public UPDOutGameTopMenu {

public:

	struct UWidgetAnimation Anim_SceneOut_Agent; // 0x458 (8)
	struct UWidgetAnimation Anim_SceneOut_Lobby; // 0x460 (8)
	struct UWidgetAnimation Anim_SceneShowUp_Agent; // 0x468 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x470 (8)
	struct UPDButton_C BTN_GradeNone; // 0x478 (8)
	struct UImage IMG_ActiveBarDeco_Clan; // 0x480 (8)
	struct UImage IMG_ActiveBarDeco_Customizing; // 0x488 (8)
	struct UImage IMG_ActiveBarDeco_GameGuide; // 0x490 (8)
	struct UImage IMG_ActiveBarDeco_Training; // 0x498 (8)
	struct UImage IMG_CurrencyIcon; // 0x4A0 (8)
	struct UImage IMG_GradeNone; // 0x4A8 (8)
	struct UImage IMG_MailBoxIcon; // 0x4B0 (8)
	struct UImage IMG_MannerToolTipBg; // 0x4B8 (8)
	struct UImage IMG_MannerToolTipOutline; // 0x4C0 (8)
	struct UImage IMG_MenuBg; // 0x4C8 (8)
	struct UImage IMG_MenuOutglow; // 0x4D0 (8)
	struct UImage IMG_OptionIcon_HoverDown; // 0x4D8 (8)
	struct UImage IMG_OptionIcon_Normal; // 0x4E0 (8)
	struct UImage IMG_Outline; // 0x4E8 (8)
	struct UImage IMG_PDLogo; // 0x4F0 (8)
	struct UImage IMG_Register; // 0x4F8 (8)
	struct UImage IMG_Register_Disabled; // 0x500 (8)
	struct UImage IMG_Register_Searching; // 0x508 (8)
	struct UImage IMG_Register_Searching_Outline; // 0x510 (8)
	struct UImage IMG_SlotDivider_2; // 0x518 (8)
	struct UImage IMG_SlotDivider_3; // 0x520 (8)
	struct UImage IMG_ToolTipBg; // 0x528 (8)
	struct UImage IMG_ToolTipOutline; // 0x530 (8)
	struct UWidgetSwitcher WS_Btn_Case; // 0x538 (8)
};

