// WidgetBlueprintGeneratedClass PartySlotListItem.PartySlotListItem_C
class UPartySlotListItem_C : public UPDPartySlotListItemUI {

public:

	struct UWidgetAnimation Anim_Inviting_Loop; // 0x328 (8)
	struct UImage IMG_Filled_Outline; // 0x330 (8)
	struct UImage IMG_FilledBg; // 0x338 (8)
	struct UImage IMG_Idle; // 0x340 (8)
	struct UImage IMG_Invite_Indicator; // 0x348 (8)
	struct UImage IMG_Inviting_Outline; // 0x350 (8)
	struct UImage IMG_InvitingBg; // 0x358 (8)
	struct UImage IMG_Leader; // 0x360 (8)
	struct UImage IMG_LeaderBg; // 0x368 (8)
	struct UImage IMG_Muted; // 0x370 (8)
	struct UImage IMG_NotJoined; // 0x378 (8)
	struct UImage IMG_Speaking; // 0x380 (8)
};

