// WidgetBlueprintGeneratedClass Perk.Perk_C
class UPerk_C : public UPDPerkUI {

public:

	struct UPDImage IMG_SLotBg; // 0x3E8 (8)
	struct UPDImage IMG_SlotBG01; // 0x3F0 (8)
	struct UPDImage IMG_SlotBG02; // 0x3F8 (8)
	struct UPDImage IMG_SlotBG03; // 0x400 (8)
	struct UPDImage IMG_SlotBG04; // 0x408 (8)
	struct UPDImage IMG_SlotBG05; // 0x410 (8)
	struct UPDImage IMG_SlotBG06; // 0x418 (8)
	struct UPerkEntryItem_C PEI_Perk01; // 0x420 (8)
	struct UPerkEntryItem_C PEI_Perk02; // 0x428 (8)
	struct UPerkEntryItem_C PEI_Perk03; // 0x430 (8)
	struct UPerkEntryItem_C PEI_Perk04; // 0x438 (8)
	struct UPerkEntryItem_C PEI_Perk05; // 0x440 (8)
	struct URetainerBox RB_Alert; // 0x448 (8)
	struct URetainerBox RB_Signature; // 0x450 (8)
};

