// WidgetBlueprintGeneratedClass PlayerInfo.PlayerInfo_C
class UPlayerInfo_C : public UPDPlayerInfoUI {

public:

	struct UWidgetAnimation AnimBow; // 0x470 (8)
	struct UWidgetAnimation HPAlretEnd; // 0x478 (8)
	struct UWidgetAnimation HPAlretStart; // 0x480 (8)
	struct UWidgetAnimation CarryBomb; // 0x488 (8)
	struct UImage IMG_BasicBack; // 0x490 (8)
	struct UImage IMG_BasicBack_2; // 0x498 (8)
	struct UImage IMG_Eject; // 0x4A0 (8)
	struct UImage IMG_Line; // 0x4A8 (8)
	struct UImage IMG_Line_2; // 0x4B0 (8)
	struct UImage IMG_Logo_2; // 0x4B8 (8)
	struct UImage IMG_Logo_3; // 0x4C0 (8)
	struct UPDImage PDImage; // 0x4C8 (8)
	struct UPDImage PDImage_5; // 0x4D0 (8)
	struct UPlayerEquipmentSlotS_C PlayerEquipmentSlotS; // 0x4D8 (8)
};

