// WidgetBlueprintGeneratedClass PlayLog.PlayLog_C
class UPlayLog_C : public UPDPlayLogUI {

public:

	struct UWidgetAnimation Anim_SceneOut; // 0x458 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x460 (8)
	struct UImage IMG_ActiveBarDeco; // 0x468 (8)
	struct UImage IMG_AnimIndicator_A; // 0x470 (8)
	struct UImage Img_Bg; // 0x478 (8)
	struct UImage IMG_BottomBar; // 0x480 (8)
	struct UImage IMG_Deco_BL; // 0x488 (8)
	struct UImage IMG_Deco_BR; // 0x490 (8)
	struct UImage IMG_Deco_TL; // 0x498 (8)
	struct UImage IMG_Deco_TR; // 0x4A0 (8)
	struct UImage IMG_Divider_Attack; // 0x4A8 (8)
	struct UImage IMG_Divider_Defence; // 0x4B0 (8)
	struct UImage IMG_LodingBg; // 0x4B8 (8)
	struct UImage IMG_MapBg; // 0x4C0 (8)
	struct UImage IMG_MapNameBg; // 0x4C8 (8)
	struct UImage IMG_MapNameOutline; // 0x4D0 (8)
	struct UImage IMG_MapOutline; // 0x4D8 (8)
	struct UImage IMG_Outglow_Title; // 0x4E0 (8)
	struct UImage IMG_PauseDeco01; // 0x4E8 (8)
	struct UImage IMG_PauseDeco02; // 0x4F0 (8)
	struct UImage IMG_PlayDeco; // 0x4F8 (8)
	struct UImage IMG_PlayerInfoBg_Attack; // 0x500 (8)
	struct UImage IMG_PlayerInfoBg_Defence; // 0x508 (8)
	struct UImage IMG_PlayerInfoOutline_Attack; // 0x510 (8)
	struct UImage IMG_PlayerInfoOutline_Defence; // 0x518 (8)
	struct UImage IMG_PlayerInfoTitleLine_Attack; // 0x520 (8)
	struct UImage IMG_PlayerInfoTitleLine_Defence; // 0x528 (8)
	struct UImage IMG_PlayListBg; // 0x530 (8)
	struct UImage IMG_PlayListOutline; // 0x538 (8)
	struct UImage IMG_PlayListTitleLine; // 0x540 (8)
	struct UImage IMG_PopupBg; // 0x548 (8)
	struct UImage IMG_RoundListBg; // 0x550 (8)
	struct UImage IMG_RoundListOutline; // 0x558 (8)
	struct UImage IMG_RoundListTitleLine; // 0x560 (8)
	struct UImage IMG_SliderBg; // 0x568 (8)
	struct UImage IMG_SliderLine; // 0x570 (8)
	struct UImage IMG_SliderOutline; // 0x578 (8)
	struct UImage IMG_StopDeco; // 0x580 (8)
	struct UImage IMG_TitleActiveBar; // 0x588 (8)
	struct UImage IMG_TopBar; // 0x590 (8)
};

