// WidgetBlueprintGeneratedClass PlayerCheer.PlayerCheer_C
class UPlayerCheer_C : public UPDPlayerCheer {

public:

	struct UWidgetAnimation NewAnimation; // 0x320 (8)
	struct UWidgetAnimation Ani_Cheer3; // 0x328 (8)
	struct UWidgetAnimation Ani_Cheer2; // 0x330 (8)
	struct UWidgetAnimation Ani_Cheer1; // 0x338 (8)
	struct UImage IMG_Cheer1; // 0x340 (8)
	struct UImage IMG_Cheer1_2; // 0x348 (8)
	struct UImage IMG_Cheer2; // 0x350 (8)
	struct UImage IMG_Cheer2_2; // 0x358 (8)
	struct UImage IMG_Cheer3; // 0x360 (8)
	struct UImage IMG_Cheer3_2; // 0x368 (8)
};

