// WidgetBlueprintGeneratedClass PlayerEquipmentSlot.PlayerEquipmentSlot_C
class UPlayerEquipmentSlot_C : public UPDPlayerEquipmentSlotBase {

public:

	struct UImage IMG_Icon_ActiveMelee; // 0x2F0 (8)
	struct UImage IMG_Icon_ActiveSub; // 0x2F8 (8)
	struct UImage IMG_Icon_ActiveWp; // 0x300 (8)
	struct UImage IMG_Line; // 0x308 (8)
	struct UImage IMG_Logo; // 0x310 (8)
	struct UProgressBar PB_Progress_Sub; // 0x318 (8)
	struct UProgressBar PB_Progress_Wp; // 0x320 (8)
	struct UPDImage PDImage_5; // 0x328 (8)
	struct UPDTextBlock TB_CurrentRounds; // 0x330 (8)
	struct UPDTextBlock TB_FireMode; // 0x338 (8)
	struct UPDTextBlock TB_Num_2; // 0x340 (8)
	struct UPDTextBlock TB_Num_3; // 0x348 (8)
	struct UPDTextBlock TB_Num_Active; // 0x350 (8)
	struct UPDTextBlock TB_StackCount; // 0x358 (8)
	struct UPDTextBlock TB_TotalRounds; // 0x360 (8)
};

