// WidgetBlueprintGeneratedClass PlayerSettingUI.PlayerSettingUI_C
class UPlayerSettingUI_C : public UPDPlayerSettingUI {

public:

	struct UImage Img_Bg; // 0x4C0 (8)
	struct UImage IMG_Blinder; // 0x4C8 (8)
	struct UImage IMG_BottomPad; // 0x4D0 (8)
	struct UImage IMG_EquipSlot_UnEquipped1; // 0x4D8 (8)
	struct UImage IMG_EquipSlot_UnEquipped2; // 0x4E0 (8)
	struct UImage IMG_EquipSlot_UnEquipped3; // 0x4E8 (8)
	struct UImage IMG_LeptonInfo_Bg; // 0x4F0 (8)
	struct UImage IMG_LeptonInfo_Outline; // 0x4F8 (8)
	struct UImage IMG_Map_UnderDeco; // 0x500 (8)
	struct UImage IMG_Map_UnderLine; // 0x508 (8)
	struct UImage IMG_Matching_Timer; // 0x510 (8)
	struct UImage IMG_Mode_UnderDeco; // 0x518 (8)
	struct UImage IMG_Mode_UnderLine; // 0x520 (8)
	struct UImage IMG_SignatureInfo_Bg; // 0x528 (8)
	struct UImage IMG_SignatureInfo_Outline; // 0x530 (8)
	struct UImage IMG_TeamMode_UnderDeco; // 0x538 (8)
	struct UImage IMG_TeamMode_UnderLine; // 0x540 (8)
	struct UImage IMG_TopPad; // 0x548 (8)
	struct UImage IMG_UniqueLeptonInfo_Bg; // 0x550 (8)
	struct UImage IMG_UniqueLeptonInfo_Outline; // 0x558 (8)
};

