// WidgetBlueprintGeneratedClass PlayerEntryItemAlly.PlayerEntryItemAlly_C
class UPlayerEntryItemAlly_C : public UPDPlayerEntryItemAllyUI {

public:

	struct UWidgetAnimation CarrySeed; // 0x300 (8)
	struct UWidgetAnimation BeHit; // 0x308 (8)
	struct UImage IMG_Idle; // 0x310 (8)
	struct UImage IMG_Idle_2; // 0x318 (8)
	struct UImage IMG_Idle_3; // 0x320 (8)
	struct UImage IMG_Juggernaut; // 0x328 (8)
	struct UImage IMG_Juggernaut_light; // 0x330 (8)
	struct UImage IMG_Muted; // 0x338 (8)
};

