// Enum ProjectD.ECoreNetError
enum class ECoreNetError : uint8_t {
	CNE_None = 0,
	CNE_ConnectError = 1,
	CNE_DisconnectByClient = 2,
	CNE_DisconnectedByServer = 3,
	CNE_ReceiveError = 4,
	CNE_SendError = 5,
	CNE_RSADecryptError = 6,
	CNE_TimeOut = 7,
	CNE_MAX = 8,
};

// Enum ProjectD.ECoreNetResult
enum class ECoreNetResult : uint8_t {
	CNR_None = 0,
	CNR_Success = 1,
	CNR_Failure = 2,
	CNR_MAX = 3,
};

// Enum ProjectD.EPDMovementState
enum class EPDMovementState : uint8_t {
	Grounded = 0,
	Falling = 1,
	Ragdoll = 2,
	Parkour = 3,
	Riding = 4,
	SkyDiving = 5,
	Airborne = 6,
	Sliding = 7,
	MAX = 8,
};

// Enum ProjectD.EPDCharacterActionType
enum class EPDCharacterActionType : uint8_t {
	None = 0,
	Land = 1,
	Jump = 2,
	Roll = 3,
	Vault = 4,
	Climbup = 5,
	LedgeGrapParkour = 6,
	LedgeGrapClimbing = 7,
	MeleeAttack = 8,
	Lean = 9,
	ChangeStance = 10,
	ItemUse = 11,
	ClimbEnterUpward = 12,
	ClimbEnterDownward = 13,
	ClimbEnterVault = 14,
	ClimbMove = 15,
	ClimbExit = 16,
	GroggyEnter = 17,
	GroggyExit = 18,
	Death_Normal = 19,
	Death_Groggy = 20,
	FireWeapon = 21,
	AimWeapon = 22,
	ChangeWeapon = 23,
	ReloadWeapon = 24,
	InstantThrowWeapon = 25,
	ThrowWeapon = 26,
	BoltAction = 27,
	OutCover = 28,
	PickUpItem = 29,
	DynamicShielding = 30,
	GroggyRescue = 31,
	SNDModeBomb = 32,
	Guard = 33,
	MeleeHit = 34,
	KnockBack = 35,
	FallingObjcetKnockBack = 36,
	SlidingEnter = 37,
	SlidingExit = 38,
	ZipLine = 39,
	Signature_RevolerSpinning = 40,
	Signature_DrinkBottle = 41,
	Signature_EatHotdog = 42,
	Signature_LickKnife = 43,
	Signature_CoinToss = 44,
	Signature_GlassesScan = 45,
	Signature_ShootFlare = 46,
	Signature_SprayMoney = 47,
	Signature_Warcry = 48,
	Signature_LookMagnifier = 49,
	Perk_Hacking = 50,
	Perk_Maintenance = 51,
	JuggernautWear_Start = 52,
	JuggernautWear_End = 53,
	JuggernautDash_Start = 54,
	JuggernautDash_End = 55,
	ExoSuitWear_Start = 56,
	ExoSuitWear_End = 57,
	ExoSuitDash = 58,
	ExoSuitLauncher = 59,
	ArmorPlateReplaceKit = 60,
	TurnBack = 61,
	AFK = 62,
	RoundEnter = 63,
	BurnReaction = 64,
	MAX = 65,
};

// Enum ProjectD.EINGAMEMISSIONSTATE
enum class EINGAMEMISSIONSTATE : uint8_t {
	None = 0,
	MissionOrder = 1,
	MissionClear = 2,
	MissionError = 3,
	MissionFail = 4,
	EINGAMEMISSIONSTATE_MAX = 5,
};

// Enum ProjectD.ESubLevelEvent
enum class ESubLevelEvent : uint8_t {
	SLE_NONE = 0,
	SLE_ExplodeAreaA = 1,
	SLE_MAX = 2,
};

// Enum ProjectD.ECharacterSpawnGroup
enum class ECharacterSpawnGroup : uint8_t {
	CharacterSG_RED = 0,
	CharacterSG_BLUE = 1,
	CharacterSG_Result = 2,
	CharacterSG_MAX = 3,
};

// Enum ProjectD.ETRIGGERNOTI
enum class ETRIGGERNOTI : uint8_t {
	ETB_ALL = 0,
	ETB_PLAYER = 1,
	ETB_NPC = 2,
	ETB_MAX = 3,
};

// Enum ProjectD.EDamageType
enum class EDamageType : uint8_t {
	None = 0,
	Melee = 1,
	Weapon = 2,
	SystemGroggy = 3,
	Fall = 4,
	Vehicle = 5,
	RedStorm = 6,
	Explosion = 7,
	Blaze = 8,
	Burn = 9,
	Gas = 10,
	Heal = 11,
	InstallSeed = 12,
	ExplosionSeed = 13,
	DeactiveSeed = 14,
	SuicideGroggyToKill = 15,
	Max = 16,
};

// Enum ProjectD.EActionReserveOption
enum class EActionReserveOption : uint8_t {
	None = 0,
	IsAbleTo = 1,
	MustReserve = 2,
	IfBlockedDontReserve = 3,
	EActionReserveOption_MAX = 4,
};

// Enum ProjectD.EPDGroggyRescueActionType
enum class EPDGroggyRescueActionType : uint8_t {
	GroggyRescueAction_Start = 0,
	GroggyRescueAction_Complete = 1,
	GroggyRescueAction_Cancel = 2,
	GroggyRescueAction_MAX = 3,
};

// Enum ProjectD.EParkourHeightType
enum class EParkourHeightType : uint8_t {
	Parkour_51 = 0,
	Parkour_101 = 1,
	Parkour_151 = 2,
	Parkour_201 = 3,
	Parkour_251 = 4,
	Parkour_301 = 5,
	MAX = 6,
};

// Enum ProjectD.ESlideEnterType
enum class ESlideEnterType : uint8_t {
	SlideEnter_None = 0,
	SlideEnter_Default = 1,
	SlideEnter_Falling = 2,
	SlideEnter_Groggy = 3,
	SlideEnter_GroggyFalling = 4,
	SlideEnter_Die = 5,
	SlideEnter_MAX = 6,
};

// Enum ProjectD.ESlideExitType
enum class ESlideExitType : uint8_t {
	SlideExit_None = 0,
	SlideExit_Default = 1,
	SlideExit_Roll = 2,
	SlideExit_Falling = 3,
	SlideExit_Groggy = 4,
	SlideExit_GroggyFalling = 5,
	SlideExit_Die = 6,
	SlideExit_MAX = 7,
};

// Enum ProjectD.ESlotState
enum class ESlotState : uint8_t {
	Create = 0,
	Filled = 1,
	ESlotState_MAX = 2,
};

// Enum ProjectD.EAkBankName
enum class EAkBankName : uint8_t {
	sfx = 0,
	weapons = 1,
	ambience = 2,
	bgm = 3,
	foley = 4,
	EAkBankName_MAX = 5,
};

// Enum ProjectD.EGameModeWidget
enum class EGameModeWidget : int32_t {
	None = -1,
	PlayerInfo = 0,
	Spectator = 1,
	StateGauge = 2,
	Perk = 3,
	CoinInfo = 4,
	CrossHair = 5,
	TargetScreen = 6,
	DamageIndicator = 7,
	ThreeDIndicator = 8,
	InteractionInfo = 9,
	RoundInfo = 10,
	RoundResult = 11,
	GameTime = 12,
	IngameMap = 13,
	RoundReplayer = 14,
	RingCommand = 15,
	MarkerGuide = 16,
	UnknownMarket = 17,
	StatusBoard = 18,
	ReportPopup = 19,
	WorldMessage = 20,
	BattleLog = 21,
	KillMessage = 22,
	KillLog = 23,
	PerkNotify = 24,
	PingLog = 25,
	TutorialQuest = 26,
	BreakInto = 27,
	RoundWait = 28,
	AgentLeptonInfo = 29,
	PlayerSetting = 30,
	PersonalMission = 31,
	MAX = 32,
};

// Enum ProjectD.EUIName
enum class EUIName : uint8_t {
	None = 0,
	Start = 1,
	Login = 2,
	NickNameCreate = 3,
	AgentCreate = 4,
	AgentInventory = 5,
	AgentLobby = 6,
	CustomMain = 7,
	CustomCharacterPerk = 8,
	CustomCharacterDeco = 9,
	CustomVoice = 10,
	CustomWeapon = 11,
	CustomGameDeco = 12,
	CustomLocker = 13,
	ClanMain = 14,
	ClanInfo = 15,
	ClanList = 16,
	ClanCreate = 17,
	ClanInfoPopup = 18,
	DebugLog = 19,
	PlayLogReport = 20,
	Loading = 21,
	Ingame = 22,
	Match = 23,
	Intro = 24,
	GameResult = 25,
	DeathMatchModeUI = 26,
	SquadDeathMatchModeUI = 27,
	OptionContent = 28,
	OKPopup = 29,
	OKCancelPopup = 30,
	OptionPopup = 31,
	LobbyUserListPopup = 32,
	InvitePartyPopup = 33,
	TutorialPopup = 34,
	StroyPerkPopup = 35,
	GainPerkPopup = 36,
	GuideWebPagePopup = 37,
	WebPopup = 38,
	TermsOfServicePopup = 39,
	ServerMaintenanceNoti = 40,
	SystemMessage = 41,
	GameModeSelectItem = 42,
	LobbyUserListItem = 43,
	CommunityPopup = 44,
	PartySlotListItem = 45,
	FriendListItem = 46,
	FriendAddItem = 47,
	FriendClanItem = 48,
	CustomMatchJoinPopup = 49,
	CustomMatchListItem = 50,
	AgentListItem = 51,
	AgentSlotListItem = 52,
	CustomCharacterListItem = 53,
	PlayLogPlayInfoItem = 54,
	KillLogItem = 55,
	EventLogItem = 56,
	NameTagAlly = 57,
	NameTagEnemy = 58,
	ObjectTag = 59,
	ObjectTagSite = 60,
	PingIndicator = 61,
	IngameShopMain = 62,
	CategoryListItem = 63,
	IngameShopListItem = 64,
	IngameShopEtcItemElem = 65,
	IngameShopPartListItem = 66,
	IngameShopUpgradeListItem = 67,
	PurchaseMsg = 68,
	RingCommand = 69,
	InvenDragModule = 70,
	LootingList = 71,
	DamageIndicator = 72,
	PlayerEntryItemAlly = 73,
	PlayerEntryItemEnemy = 74,
	MissionScorePlayerEntryItem = 75,
	MSStatusBoardPlayerInfo = 76,
	MSStatusBoardRoundItem = 77,
	PerkEntryItem = 78,
	PerkNotifySlot = 79,
	AttackDamageIndicator = 80,
	GrenadeIndicator = 81,
	CoinInfoListItem = 82,
	PingLogItem = 83,
	PersonalMissionModule = 84,
	PersonalMissionRewardModule = 85,
	ScreenMarkerLoot = 86,
	BaseGameMode = 87,
	DeathMatchMode = 88,
	DefuseBombMode = 89,
	MissionScoreMode = 90,
	UnKnownMarketPartListItem = 91,
	UnKnownMarketPurchaseMsgItem = 92,
	UnKnownMarketInvenListItem = 93,
	StatusBoardRoundListItem = 94,
	ResultRoundItem = 95,
	ResultTeamMember = 96,
	ResultExpItem = 97,
	ResultMedalItem = 98,
	MatchListItem = 99,
	MailPopup = 100,
	MailNotificationSlot = 101,
	MailItemListSlot = 102,
	TeamCharListItem = 103,
	LeptonPresetTab = 104,
	UI_Max = 105,
	EUIName_MAX = 106,
};

// Enum ProjectD.EPDHitReactionAnimType
enum class EPDHitReactionAnimType : uint8_t {
	HitReaction_None = 0,
	HitReaction_Normal = 1,
	HitReaction_Run = 2,
	HitReaction_Lower = 3,
	HitReaction_Head = 4,
	HitReaction_Melee = 5,
	HitReaction_BombGraze = 6,
	HitReaction_BulletGraze = 7,
	MAX = 8,
};

// Enum ProjectD.EPDRagdollState
enum class EPDRagdollState : uint8_t {
	Wake = 0,
	Freeze = 1,
	EPDRagdollState_MAX = 2,
};

// Enum ProjectD.EPDNPCActionState
enum class EPDNPCActionState : uint8_t {
	None = 0,
	LookAround = 1,
	Surprised = 2,
	MAX = 3,
};

// Enum ProjectD.EPDNPCLocoState
enum class EPDNPCLocoState : uint8_t {
	NotMoving = 0,
	Moving = 1,
	MAX = 2,
};

// Enum ProjectD.EOptionSensitivenessType
enum class EOptionSensitivenessType : uint8_t {
	ZOOM0 = 0,
	ZOOM1 = 1,
	ZOOM2 = 2,
	ZOOM3 = 3,
	ZOOM4 = 4,
	_TOTAL_COUNT = 5,
	EOptionSensitivenessType_MAX = 6,
};

// Enum ProjectD.EPDParkourType
enum class EPDParkourType : uint8_t {
	NONE = 0,
	STAIR = 1,
	HURDLE = 2,
	WALL = 3,
	NEXTFLOOR = 4,
	MAX = 5,
};

// Enum ProjectD.EPDActionRuleCondtion
enum class EPDActionRuleCondtion : uint8_t {
	NOT_CHANGE = 0,
	WAIT_PREV_ACTION = 1,
	IMMEDIATE_NEXT_ACTION = 2,
	EPDActionRuleCondtion_MAX = 3,
};

// Enum ProjectD.EPDIKStanceFrame
enum class EPDIKStanceFrame : uint8_t {
	Idle = 0,
	Default = 1,
	SingleShot = 2,
	VerticalGrip = 3,
	AngleGrip = 4,
	HalfGrip = 5,
	MagGrip = 6,
	Max = 7,
};

// Enum ProjectD.EPDSpecificWeaponAnimset
enum class EPDSpecificWeaponAnimset : uint8_t {
	HK416 = 0,
	SCAR = 1,
	AK47 = 2,
	MP5 = 3,
	MPX = 4,
	BenelliM4 = 5,
	M24 = 6,
	M14 = 7,
	M249 = 8,
	M134 = 9,
	KrissVector = 10,
	AUGA3 = 11,
	ASVAL = 12,
	AWP = 13,
	Glock = 14,
	DesertEagle = 15,
	DoubleBarrel = 16,
	PBPistol = 17,
	Bow = 18,
	M870 = 19,
	G36 = 20,
	MAC10 = 21,
	P30L = 22,
	SVD = 23,
	DoubleDefense = 24,
	Barrett = 25,
	MAX = 26,
};

// Enum ProjectD.EPDAnimset
enum class EPDAnimset : uint8_t {
	Bare = 0,
	HK416 = 1,
	MP5 = 2,
	BenelliM4 = 3,
	M24 = 4,
	M249 = 5,
	Glock = 6,
	Throw = 7,
	M134 = 8,
	Knife = 9,
	KnuckleBlade = 10,
	Bow = 11,
	Karambit = 12,
	CAxe = 13,
	Tonfa = 14,
	ThreeBaton = 15,
	CHammer = 16,
	FistKnife = 17,
	Wrench = 18,
	ExoSuit = 19,
	MAX = 20,
};

// Enum ProjectD.EPDLeanState
enum class EPDLeanState : uint8_t {
	Lean_None = 0,
	Lean_Left = 1,
	Lean_Right = 2,
	MAX = 3,
};

// Enum ProjectD.EPDSocketOffsetState
enum class EPDSocketOffsetState : uint8_t {
	SocketOffset_Left = 0,
	SocketOffset_Right = 1,
	MAX = 2,
};

// Enum ProjectD.EPDSlideStanceState
enum class EPDSlideStanceState : uint8_t {
	SlideStance_Default = 0,
	SlideStance_Groggy = 1,
	MAX = 2,
};

// Enum ProjectD.EPDThrowStanceState
enum class EPDThrowStanceState : uint8_t {
	ThrowStance_Over = 0,
	ThrowStance_Under = 1,
	MAX = 2,
};

// Enum ProjectD.EPDClimbStanceState
enum class EPDClimbStanceState : uint8_t {
	Climb_4P = 0,
	Climb_2P = 1,
	MAX = 2,
};

// Enum ProjectD.EPDRotationState
enum class EPDRotationState : uint8_t {
	None = 0,
	FreeLook = 1,
	VelocityDirection = 2,
	LookingDirection = 3,
	Max = 4,
};

// Enum ProjectD.EPDAimingState
enum class EPDAimingState : uint8_t {
	Idle = 0,
	HipFire = 1,
	Aim = 2,
	ADS = 3,
	MAX = 4,
};

// Enum ProjectD.EPDStanceState
enum class EPDStanceState : uint8_t {
	Standing = 0,
	Crouching = 1,
	MAX = 2,
};

// Enum ProjectD.EPDGaitsState
enum class EPDGaitsState : uint8_t {
	Staying = 0,
	Walking = 1,
	Jogging = 2,
	Running = 3,
	Sprinting = 4,
	MAX = 5,
};

// Enum ProjectD.EPDInputMoveType
enum class EPDInputMoveType : uint8_t {
	Walk = 0,
	Run = 1,
	Sprint = 2,
	MAX = 3,
};

// Enum ProjectD.EPDLocoState
enum class EPDLocoState : uint8_t {
	NotMoving = 0,
	Stopping = 1,
	Starting_F = 2,
	Starting_L = 3,
	Starting_R = 4,
	Moving = 5,
	MAX = 6,
};

// Enum ProjectD.EPDLocoType
enum class EPDLocoType : uint8_t {
	Default = 0,
	Climb = 1,
	Cover = 2,
	Groggy = 3,
	Slide = 4,
	ZipLine = 5,
	Dead = 6,
	MAX = 7,
};

// Enum ProjectD.EPDActionNotifyType
enum class EPDActionNotifyType : uint8_t {
	ActionNotify_Begin_Anim = 0,
	ActionNotify_End_Anim = 1,
	ActionNotify_Event_Anim = 2,
	ActionNotify_Event_CPP = 3,
	ActionNotify_MAX = 4,
};

// Enum ProjectD.EPDActionTriggerType
enum class EPDActionTriggerType : uint8_t {
	Activate = 0,
	End = 1,
	Cancel = 2,
	Toggle = 3,
	EPDActionTriggerType_MAX = 4,
};

// Enum ProjectD.EPDActionSlotType
enum class EPDActionSlotType : uint8_t {
	Fullbody = 0,
	Upper = 1,
	Lower = 2,
	Additive = 3,
	EPDActionSlotType_MAX = 4,
};

// Enum ProjectD.EPDLobbyAnimStatus
enum class EPDLobbyAnimStatus : uint8_t {
	None = 0,
	Lobby_Scene_Select = 1,
	Lobby_Scene_Select_Idle = 2,
	Lobby_Scene_Matching_Start = 3,
	Lobby_Scene_Matching_Idle = 4,
	Lobby_Scene_Customizing = 5,
	Lobby_Scene_Shop = 6,
	Create_Scene_Select = 7,
	Create_Scene_Idle = 8,
	Result_Scene_Win = 9,
	Result_Scene_Win_Idle = 10,
	Result_Scene_Lose = 11,
	Result_Scene_Lose_IDle = 12,
	MAX = 13,
};

// Enum ProjectD.EPDDirCalcMethodType
enum class EPDDirCalcMethodType : uint8_t {
	_2WAY = 0,
	_4WAY = 1,
	_8WAY = 2,
	MAX = 3,
};

// Enum ProjectD.EPD4DirType
enum class EPD4DirType : uint8_t {
	Forward = 0,
	Left = 1,
	Right = 2,
	Back = 3,
	MAX = 4,
};

// Enum ProjectD.EPDDirectionType
enum class EPDDirectionType : uint8_t {
	FWD = 0,
	BCK = 1,
	RT = 2,
	LFT = 3,
	FWD_RT = 4,
	FWD_LFT = 5,
	BCK_RT = 6,
	BCK_LFT = 7,
	MAX = 8,
};

// Enum ProjectD.EPDHitReactionType
enum class EPDHitReactionType : uint8_t {
	FULL_BODY = 0,
	UPPER_BODY = 1,
	LOWER_BODY = 2,
	MELEE_HIT = 3,
	MAX = 4,
};

// Enum ProjectD.EPDCharacterParts
enum class EPDCharacterParts : uint8_t {
	Head = 0,
	Body = 1,
	Hair = 2,
	Accessory = 3,
	EPDCharacterParts_MAX = 4,
};

// Enum ProjectD.EPDClimbMoveType
enum class EPDClimbMoveType : uint8_t {
	ClimbMove_None = 0,
	ClimbMove_Default = 1,
	ClimbMove_InTurn = 2,
	ClimbMove_OutTurn = 3,
	ClimbMove_Jump = 4,
	ClimbMove_Wide = 5,
	ClimbMove_LongJump = 6,
	ClimbMove_MAX = 7,
};

// Enum ProjectD.EPDClimbPointUptype
enum class EPDClimbPointUptype : uint8_t {
	ClimbPoint_None = 0,
	ClimbPoint_Vault = 1,
	ClimbPoint_ClimbUp = 2,
	ClimbPoint_MAX = 3,
};

// Enum ProjectD.EControlTapType
enum class EControlTapType : int32_t {
	None = -1,
	MoveNAction = 0,
	ETCAction = 1,
	EControlTapType_MAX = 2,
};

// Enum ProjectD.ECrossHairColorPreset
enum class ECrossHairColorPreset : uint8_t {
	WHITE = 0,
	RED = 1,
	BLUE = 2,
	GREEN = 3,
	YELLOW = 4,
	PINK = 5,
	ECrossHairColorPreset_MAX = 6,
};

// Enum ProjectD.ECrossHairDrawStyle
enum class ECrossHairDrawStyle : uint8_t {
	Scaled = 0,
	ScaledWithOutline = 1,
	NonScaled = 2,
	NonScaledWithOutline = 3,
	ECrossHairDrawStyle_MAX = 4,
};

// Enum ProjectD.EMISituation
enum class EMISituation : uint8_t {
	None = 0,
	Weapon_AR = 1,
	Weapon_SMG = 2,
	Weapon_SR = 3,
	Weapon_SG = 4,
	Weapon_LMG = 5,
	Weapon_BOW = 6,
	Weapon_RPG = 7,
	Weapon_MINIGUN = 8,
	Weapon_EXOSUIT_SMG = 9,
	Weapon_Pistol = 10,
	Weapon_Melee = 11,
	Weapon_Weapon = 12,
	Weapon_Explosion = 13,
	Weather = 14,
	Fire_HipFire = 15,
	Fire_Aim = 16,
	Fire_ADS = 17,
	Groggy = 18,
	Execution = 19,
	EMISituation_MAX = 20,
};

// Enum ProjectD.EMITarget
enum class EMITarget : uint8_t {
	AnybodyUser = 0,
	RandomUser = 1,
	BestUser = 2,
	EMITarget_MAX = 3,
};

// Enum ProjectD.EDYNAMICOBJECTSTATE
enum class EDYNAMICOBJECTSTATE : uint8_t {
	NONE = 0,
	ALIVEOBJ = 1,
	MDESTROY = 2,
	FDESTROY = 3,
	CLOSE = 4,
	OPEN = 5,
	OPEN2 = 6,
	MOVE = 7,
	MOVE2 = 8,
	EDYNAMICOBJECTSTATE_MAX = 9,
};

// Enum ProjectD.EGraphicsScalabilityType
enum class EGraphicsScalabilityType : uint8_t {
	None = 0,
	Resolution = 1,
	ViewDistance = 2,
	AntiAliasing = 3,
	PostProcessing = 4,
	Shadows = 5,
	Texture = 6,
	Effects = 7,
	Foliage = 8,
	EGraphicsScalabilityType_MAX = 9,
};

// Enum ProjectD.EFrameRateMode
enum class EFrameRateMode : uint8_t {
	DisplayBased = 0,
	Customize = 1,
	EFrameRateMode_MAX = 2,
};

// Enum ProjectD.EDisplayMode
enum class EDisplayMode : uint8_t {
	WindowedFullscreen = 0,
	Windowed = 1,
	Fullscreen = 2,
	EDisplayMode_MAX = 3,
};

// Enum ProjectD.EDisplayTapType
enum class EDisplayTapType : int32_t {
	None = -1,
	Video = 0,
	System = 1,
	EDisplayTapType_MAX = 2,
};

// Enum ProjectD.EDroneArmLagState
enum class EDroneArmLagState : uint8_t {
	None = 0,
	Floating = 1,
	Crouch = 2,
	Parkour_Enable = 3,
	Parkour_Disable = 4,
	EDroneArmLagState_MAX = 5,
};

// Enum ProjectD.EENVTYPE
enum class EENVTYPE : uint8_t {
	DEFAULT = 0,
	DESTROY = 1,
	SAND = 2,
	WET = 3,
	EENVTYPE_MAX = 4,
};

// Enum ProjectD.EPDEndAnimationType
enum class EPDEndAnimationType : uint8_t {
	StartMove = 0,
	StopMove = 1,
	Pivot = 2,
	Max = 3,
};

// Enum ProjectD.EPDEnvEffectClientType
enum class EPDEnvEffectClientType : uint8_t {
	Normal = 0,
	SandStorm = 1,
	Rain = 2,
	SeaFog = 3,
	EPDEnvEffectClientType_MAX = 4,
};

// Enum ProjectD.ESafeZoneDrawStyle
enum class ESafeZoneDrawStyle : uint8_t {
	Line = 0,
	Solid = 1,
	ESafeZoneDrawStyle_MAX = 2,
};

// Enum ProjectD.ESafeZoneDrawType
enum class ESafeZoneDrawType : uint8_t {
	None = 0,
	CurrentArea = 1,
	NextArea = 2,
	ESafeZoneDrawType_MAX = 3,
};

// Enum ProjectD.EMapShape
enum class EMapShape : uint8_t {
	Rect = 0,
	Oval = 1,
	EMapShape_MAX = 2,
};

// Enum ProjectD.EGamePlayTapType
enum class EGamePlayTapType : int32_t {
	None = -1,
	Mouse = 0,
	UI = 1,
	EGamePlayTapType_MAX = 2,
};

// Enum ProjectD.GBOStep
enum class GBOStep : uint8_t {
	ALL = 0,
	Step1 = 1,
	Step2 = 2,
	Step3 = 3,
	Step4 = 4,
	Step5 = 5,
	GBOStep_MAX = 6,
};

// Enum ProjectD.EInventorySlot
enum class EInventorySlot : uint8_t {
	Slot_None = 0,
	Weapon_MainSlot = 1,
	Weapon_SubSlot = 2,
	Weapon_PistolSlot = 3,
	Weapon_MeleeSlot = 4,
	Weapon_ThrowSlot = 5,
	Slot_Max = 6,
	EInventorySlot_MAX = 7,
};

// Enum ProjectD.EPDHitFeedBackType
enum class EPDHitFeedBackType : uint8_t {
	Hit = 0,
	Hit_NoDmg = 1,
	Groggy = 2,
	Death = 3,
	HeadShot = 4,
	Armor = 5,
	ArmorBroken = 6,
	EPDHitFeedBackType_MAX = 7,
};

// Enum ProjectD.EDivideType
enum class EDivideType : uint8_t {
	DivideType_None = 0,
	DivideType_DropItem = 1,
	DivideType_DropCoin = 2,
	DivideType_DropAmmo = 3,
	DivideType_GetItem = 4,
	DivideType_DropSlotItem = 5,
	DivideType_MAX = 6,
};

// Enum ProjectD.EPDStoppingType
enum class EPDStoppingType : uint8_t {
	Stopping_Foward = 0,
	Stopping_Left = 1,
	Stopping_Right = 2,
	Stopping_Back = 3,
	Stopping_MAX = 4,
};

// Enum ProjectD.EPDStartingType
enum class EPDStartingType : uint8_t {
	Starting_Foward = 0,
	Starting_Left = 1,
	Starting_Right = 2,
	Starting_Back = 3,
	Starting_MAX = 4,
};

// Enum ProjectD.EPDSpectatingModeType
enum class EPDSpectatingModeType : uint8_t {
	None = 0,
	FreeLookMode = 1,
	PlayerLookMode = 2,
	Max = 3,
};

// Enum ProjectD.ESmoothTurn
enum class ESmoothTurn : uint8_t {
	SmoothTurn_None = 0,
	SmoothTurn_Left = 1,
	SmoothTurn_Right = 2,
	SmoothTurn_MAX = 3,
};

// Enum ProjectD.EOverlapNumber
enum class EOverlapNumber : uint8_t {
	None = 0,
	Overlap1 = 1,
	Overlap2 = 2,
	Overlap3 = 3,
	Overlap4 = 4,
	Overlap5 = 5,
	Overlap6 = 6,
	Overlap7 = 7,
	Overlap8 = 8,
	Overlap9 = 9,
	EOverlapNumber_MAX = 10,
};

// Enum ProjectD.EOptionContentType
enum class EOptionContentType : uint8_t {
	ComboBox = 0,
	Slider = 1,
	InputKeySelector = 2,
	InputToggleKeySelector = 3,
	CheckBox = 4,
	Tabs = 5,
	OneButton = 6,
	CrossHairImage = 7,
	EOptionContentType_MAX = 8,
};

// Enum ProjectD.EBlockType
enum class EBlockType : uint8_t {
	Default = 0,
	Friend_Clan = 1,
	AllBlock = 2,
	EBlockType_MAX = 3,
};

// Enum ProjectD.EOptionQuality
enum class EOptionQuality : uint8_t {
	LowQuality = 0,
	MediumQuality = 1,
	HighQuality = 2,
	EpicQuality = 3,
	EOptionQuality_MAX = 4,
};

// Enum ProjectD.EGraphicsQuality
enum class EGraphicsQuality : uint8_t {
	Low = 0,
	Medium = 1,
	High = 2,
	Epic = 3,
	Custom = 4,
	EGraphicsQuality_MAX = 5,
};

// Enum ProjectD.EMouseSensitivityType
enum class EMouseSensitivityType : uint8_t {
	NormalSensitivity = 0,
	AimingSensitivity = 1,
	IronsightSensitivity = 2,
	X2ZoomScope = 3,
	X4ZoomScope = 4,
	X8ZoomScope = 5,
	X16ZoomScope = 6,
	EMouseSensitivityType_MAX = 7,
};

// Enum ProjectD.EOptionType
enum class EOptionType : int32_t {
	None = -1,
	Display = 0,
	Sounds = 1,
	Gameplay = 2,
	Controls = 3,
	OptionType_Max = 4,
	EOptionType_MAX = 5,
};

// Enum ProjectD.EOutGameCameraType
enum class EOutGameCameraType : uint8_t {
	OutgameCameraLobby = 0,
	OutgameCameraAgentInven = 1,
	OutgameCameraAgentCreate = 2,
	OutgameCameraCustomCharacter = 3,
	EOutGameCameraType_MAX = 4,
};

// Enum ProjectD.EOutgameCharacterSpawnGroup
enum class EOutgameCharacterSpawnGroup : uint8_t {
	OutgameCharacterSG_Lobby = 0,
	OutgameCharacterSG_AgentInven = 1,
	OutgameCharacterSG_AgentCreate = 2,
	OutgameCharacterSG_Custom = 3,
	OutgameCharacterSG_Result = 4,
	OutgameCharacterSG_MAX = 5,
};

// Enum ProjectD.EPartySlotState
enum class EPartySlotState : uint8_t {
	Empty = 0,
	Inviting = 1,
	Filled = 2,
	EPartySlotState_MAX = 3,
};

// Enum ProjectD.ECameraMovementType
enum class ECameraMovementType : uint8_t {
	CMT_Indoor = 0,
	CMT_Outdoor = 1,
	CMT_Groggy = 2,
	CMT_Roll = 3,
	CMT_PKRCU100WCamera = 4,
	CMT_PKRCU100RCamera = 5,
	CMT_PKRCU150WCamera1 = 6,
	CMT_PKRCU150WCamera2 = 7,
	CMT_PKRCU150RCamera1 = 8,
	CMT_PKRCU150RCamera2 = 9,
	CMT_PKRCU200WCamera1 = 10,
	CMT_PKRCU200WCamera2 = 11,
	CMT_PKRCU200RCamera1 = 12,
	CMT_PKRCU200RCamera2 = 13,
	CMT_PKRCU250WCamera1 = 14,
	CMT_PKRCU250WCamera2 = 15,
	CMT_PKRCU250RCamera1 = 16,
	CMT_PKRCU250RCamera2 = 17,
	CMT_PKRCU300WCamera1 = 18,
	CMT_PKRCU300WCamera2 = 19,
	CMT_PKRCU300RCamera1 = 20,
	CMT_PKRCU300RCamera2 = 21,
	CMT_PKRVT100WCamera = 22,
	CMT_PKRVT100RCamera = 23,
	CMT_PKRVT150WCamera1 = 24,
	CMT_PKRVT150WCamera2 = 25,
	CMT_PKRVT150RCamera1 = 26,
	CMT_PKRVT150RCamera2 = 27,
	CMT_PKRVT200WCamera1 = 28,
	CMT_PKRVT200WCamera2 = 29,
	CMT_PKRVT200RCamera1 = 30,
	CMT_PKRVT200RCamera2 = 31,
	CMT_PKRVT250WCamera1 = 32,
	CMT_PKRVT250WCamera2 = 33,
	CMT_PKRVT250RCamera1 = 34,
	CMT_PKRVT250RCamera2 = 35,
	CMT_PKRVT300WCamera1 = 36,
	CMT_PKRVT300WCamera2 = 37,
	CMT_PKRVT300RCamera1 = 38,
	CMT_PKRVT300RCamera2 = 39,
	CMT_PKRCloseUpCamera = 40,
	CMT_PKRDefCamera = 41,
	CMT_FirstPerson = 42,
	CMT_FirstPerson_Bow = 43,
	CMT_Aiming = 44,
	CMT_CrouchAiming = 45,
	CMT_Crouch = 46,
	CMT_Aiming_Bow = 47,
	CMT_CrouchAiming_Bow = 48,
	CMT_ForwardRun = 49,
	CMT_Jump = 50,
	CMT_LongJump = 51,
	CMT_Climb = 52,
	CMT_Zipline = 53,
	CMT_Slide = 54,
	CMT_JuggernautDash = 55,
	CMT_Stealth = 56,
	CMT_Seed_Bomb_Install_Defuse = 57,
	CMT_GgoggySeed_Bomb_Install_Defuse = 58,
	CMT_Count = 59,
	CMT_MAX = 60,
};

// Enum ProjectD.ESpectatingParkourCamera
enum class ESpectatingParkourCamera : uint8_t {
	None = 0,
	Following = 1,
	FollowingEnd = 2,
	MAX = 3,
};

// Enum ProjectD.EPDFootStepNotifyType
enum class EPDFootStepNotifyType : uint8_t {
	Run = 0,
	Jump = 1,
	SoftLand = 2,
	HardLand = 3,
	JugDash = 4,
	Roll = 5,
	Max = 6,
};

// Enum ProjectD.EPDTraceChannel
enum class EPDTraceChannel : uint8_t {
	Visibility = 3,
	Parkour = 14,
	Climb = 15,
	Weapon = 16,
	AttackObject = 17,
	Pickup = 18,
	Ladder = 19,
	Projectile = 20,
	Audio = 21,
	Slide = 23,
	AudioOcc = 25,
	EPDTraceChannel_MAX = 26,
};

// Enum ProjectD.EHandsAndFeetBone
enum class EHandsAndFeetBone : uint8_t {
	Palm_L = 0,
	Palm_R = 1,
	bx_L_toe = 2,
	bx_R_toe = 3,
	bx_spine = 4,
	EHandsAndFeetBone_MAX = 5,
};

// Enum ProjectD.EBattleIntensityState
enum class EBattleIntensityState : uint8_t {
	INTENSITY_NORMAL = 0,
	INTENSITY_ALARMED = 1,
	INTENSITY_COMBAT_SIMPLE = 2,
	INTENSITY_COMBAT_HARD = 3,
	INTENSITY_MAX = 4,
};

// Enum ProjectD.EPDTutorialEvent
enum class EPDTutorialEvent : uint8_t {
	CloseShopUI = 0,
	HighlightLoadoutUI = 1,
	HighlightNPC = 2,
	HighlightPartSlotUI = 3,
	HighlightShopItemUI = 4,
	HighlightShopGuideUI = 5,
	HighlightUpgradeUI = 6,
	HighlightVicinityItemUI = 7,
	SpawnItem = 8,
	SpawnNPC = 9,
	EPDTutorialEvent_MAX = 10,
};

// Enum ProjectD.EPDTutorialQuestKeyPressType
enum class EPDTutorialQuestKeyPressType : uint8_t {
	Normal = 0,
	Hold = 1,
	Short = 2,
	Double = 3,
	EPDTutorialQuestKeyPressType_MAX = 4,
};

// Enum ProjectD.ETutorialPhase
enum class ETutorialPhase : uint8_t {
	TP_PHASE_2 = 0,
	TP_PHASE_3 = 1,
	TP_PHASE_4 = 2,
	TP_PHASE_5 = 3,
	TP_PHASE_6 = 4,
	TP_PHASE_7 = 5,
	TP_PHASE_8 = 6,
	TP_PHASE_9 = 7,
	TP_PHASE_10 = 8,
	TP_PHASE_11 = 9,
	TP_PHASE_MAX = 10,
};

// Enum ProjectD.EQuestAction
enum class EQuestAction : uint8_t {
	QA_None = 0,
	QA_OUTGAME_CHA_VOICE = 1,
	QA_HIT = 2,
	QA_RANGE = 3,
	QA_THROW = 4,
	QA_CHA_STATE = 5,
	QA_AREA = 6,
	QA_PING = 7,
	QA_USEITEM = 8,
	QA_INTERACTION = 9,
	QA_MODE_EVENT = 10,
	QA_ADD_ITEM = 11,
	QA_UPGRADE = 12,
	QA_INGAME_MOVIE = 13,
	QA_BATTLE_ASPECT = 14,
	QA_GAME_READY = 15,
	QA_ROUND_END = 16,
	QA_OPERATOR_CHECK = 17,
	QA_ENV_EFFECT = 18,
	QA_MOVE_CHARACTER = 19,
	QA_CHANGE_MOVE_TYPE = 20,
	QA_TRY_ACTION = 21,
	QA_CHANGE_AIM_STATE = 22,
	QA_CHANGE_WEAPON = 23,
	QA_ETC_ACTION = 24,
	QA_START_TUTORIAL = 25,
	QA_COMPLETE_TUTORAL_PHASE = 26,
	QA_BATTLE_INTENSITY = 27,
	QA_RANGE_IN_LOCATION = 28,
	QA_SHOP_READY = 29,
	QA_UNEQUIP_POWERARMOR = 30,
	QA_MAX = 31,
};

// Enum ProjectD.EQuestList
enum class EQuestList : int32_t {
	QL_None = 0,
	QL_VOICE_ENEMY_HIT = 1,
	QL_VOICE_TEAM_HIT = 2,
	QL_VOICE_TEAM_ENEMY_HIT = 3,
	QL_VOICE_TEAM_ME_HIT = 4,
	QL_VOICE_ENEMY_TEAM_HIT = 5,
	QL_VOICE_ENEMY_ME_HIT = 6,
	QL_VOICE_GROGGY = 7,
	QL_VOICE_DEATH = 8,
	QL_VOICE_ENEMY_GROGGY = 9,
	QL_VOICE_ENEMY_DEATH = 10,
	QL_VOICE_DOT_HIT = 11,
	QL_VOICE_SMOKE_AREA = 12,
	QL_VOICE_THROW_GRANADE = 13,
	QL_VOICE_THROW_HEAL = 14,
	QL_VOICE_THROW_GAS = 15,
	QL_VOICE_THROW_SCAN = 16,
	QL_VOICE_JUGGERNAUT = 17,
	QL_VOICE_CHANGE_ARMORPLATE = 18,
	QL_VOICE_RECOVER = 19,
	QL_VOICE_FULL_INVEN = 20,
	QL_VOICE_GET_SEED = 21,
	QL_VOICE_SET_SEED = 22,
	QL_VOICE_RELEASE_SEED = 23,
	QL_VOICE_RELOAD = 24,
	QL_VOICE_SHOP_BUYREQUEST = 25,
	QL_VOICE_SHOP_CANCEL = 26,
	QL_VOICE_SHOP_REFUSE = 27,
	QL_VOICE_INTER_LEDEAR_DELEGATE = 28,
	QL_VOICE_SIGNATURE = 29,
	QL_VOICE_GROGGY_REQUEST = 30,
	QL_VOICE_GROGGY_HEAL = 31,
	QL_VOICE_INTER_BOMB_DELEGATE = 32,
	QL_VOICE_MONOLOGUE = 33,
	QL_VOICE_CHA_INTERACTION_TALK = 34,
	QL_VOICE_OUTGAME_CHA_CREATE = 35,
	QL_VOICE_OUTGAME_CHA_SELECT = 36,
	QL_VOICE_OUTGAME_LOBBY = 37,
	QL_VOICE_OUTGAME_RESULT_WIN = 38,
	QL_VOICE_OUTGAME_RESULT_LOSE = 39,
	QL_VOICE_ENEMY_SNIPER_FIND = 40,
	QL_VOICE_NEAR_GRANADE = 41,
	QL_VOICE_PING_MOVE = 42,
	QL_VOICE_PING_GO = 43,
	QL_VOICE_PING_ASSEMBLE = 44,
	QL_VOICE_PING_RETREAT = 45,
	QL_VOICE_PING_INSTALL = 46,
	QL_VOICE_PING_DEFUSE = 47,
	QL_VOICE_PING_CAUTIONINSTALL = 48,
	QL_VOICE_PING_CAUTIONDEFUSE = 49,
	QL_VOICE_PING_ENEMY = 50,
	QL_VOICE_PING_WATCH = 51,
	QL_VOICE_PING_SUPPORT = 52,
	QL_VOICE_PING_RUSH = 53,
	QL_VOICE_PING_ATTACK = 54,
	QL_VOICE_PING_DEFENSE = 55,
	QL_VOICE_PING_SOS = 56,
	QL_VOICE_PING_ALLYGROGGY = 57,
	QL_VOICE_PING_ENEMYGROGGY = 58,
	QL_VOICE_PING_ENEMYDEAD = 59,
	QL_VOICE_PING_ENEMYJUGGERNAUT = 60,
	QL_VOICE_PING_HELLO = 61,
	QL_VOICE_PING_SORRY = 62,
	QL_VOICE_PING_GREAT = 63,
	QL_VOICE_PING_THANKYOU = 64,
	QL_VOICE_PING_BLAHBLAH = 65,
	QL_VOICE_PING_INVEST = 66,
	QL_VOICE_PING_SAVING = 67,
	QL_VOICE_PING_ALLIN = 68,
	QL_VOICE_PING_RICH = 69,
	QL_VOICE_PING_POOR = 70,
	QL_VOICE_PING_ITEM = 71,
	QL_VOICE_PING_SEED = 72,
	QL_VOICE_PING_WEAPON_AR = 73,
	QL_VOICE_PING_WEAPON_SMG = 74,
	QL_VOICE_PING_WEAPON_SR = 75,
	QL_VOICE_PING_WEAPON_SG = 76,
	QL_VOICE_PING_WEAPON_LMG = 77,
	QL_VOICE_PING_WEAPON_BOW = 78,
	QL_VOICE_PING_WEAPON_SUB = 79,
	QL_VOICE_PING_AMMO_10 = 80,
	QL_VOICE_PING_AMMO_557 = 81,
	QL_VOICE_PING_AMMO_763 = 82,
	QL_VOICE_PING_AMMO_12GAUGE = 83,
	QL_VOICE_PING_AMMO_ARROW = 84,
	QL_VOICE_PING_THROW_GRENADE = 85,
	QL_VOICE_PING_THROW_GAS = 86,
	QL_VOICE_PING_THROW_SCAN = 87,
	QL_VOICE_PING_THROW_HEAL = 88,
	QL_VOICE_PING_BANDAGE = 89,
	QL_VOICE_PING_ARMORPLATE = 90,
	QL_VOICE_PING_ASTRAPI = 91,
	QL_VOICE_PING_SELFREVIVALKIT = 92,
	QL_VOICE_PING_BOMBDEACTIVATEKIT = 93,
	QL_VOICE_PING_JUGGERNAUT = 94,
	QL_VOICE_PING_INVEN_COIN = 95,
	QL_VOICE_PING_INVEN_SEED = 96,
	QL_VOICE_PING_INVEN_WEAPON_MAIN = 97,
	QL_VOICE_PING_INVEN_WEAPON_SUB = 98,
	QL_VOICE_PING_INVEN_AMMO_10 = 99,
	QL_VOICE_PING_INVEN_AMMO_557 = 100,
	QL_VOICE_PING_INVEN_AMMO_763 = 101,
	QL_VOICE_PING_INVEN_AMMO_12GAUGE = 102,
	QL_VOICE_PING_INVEN_AMMO_ARROW = 103,
	QL_VOICE_PING_SHOP = 104,
	QL_VOICE_PING_SHOP_WEAPON_AR = 105,
	QL_VOICE_PING_SHOP_WEAPON_SMG = 106,
	QL_VOICE_PING_SHOP_WEAPON_SR = 107,
	QL_VOICE_PING_SHOP_WEAPON_SG = 108,
	QL_VOICE_PING_SHOP_WEAPON_LMG = 109,
	QL_VOICE_PING_SHOP_WEAPON_BOW = 110,
	QL_VOICE_PING_SHOP_WEAPON_SUB = 111,
	QL_VOICE_PING_SHOP_AMMO_10 = 112,
	QL_VOICE_PING_SHOP_AMMO_557 = 113,
	QL_VOICE_PING_SHOP_AMMO_763 = 114,
	QL_VOICE_PING_SHOP_AMMO_12GAUGE = 115,
	QL_VOICE_PING_SHOP_AMMO_ARROW = 116,
	QL_VOICE_PING_SHOP_THROW_GRENADE = 117,
	QL_VOICE_PING_SHOP_THROW_GAS = 118,
	QL_VOICE_PING_SHOP_THROW_SCAN = 119,
	QL_VOICE_PING_SHOP_THROW_HEAL = 120,
	QL_VOICE_PING_SHOP_BANDAGE = 121,
	QL_VOICE_PING_SHOP_ARMORPLATE = 122,
	QL_VOICE_PING_SHOP_ASTRAPI = 123,
	QL_VOICE_PING_SHOP_SELFREVIVALKIT = 124,
	QL_VOICE_PING_SHOP_BOMBDEACTIVATEKIT = 125,
	QL_VOICE_PING_SHOP_JUGGERNAUT = 126,
	QL_VOICE_PING_SHOP_TEMABUFF = 127,
	QL_VOICE_PING_FUND_ARMORY = 128,
	QL_VOICE_PING_FUND_ORDNANCE = 129,
	QL_VOICE_PING_FUND_TACTICAL = 130,
	QL_VOICE_PING_GROGGY_MOVE = 131,
	QL_VOICE_PING_GROGGY_ENEMY = 132,
	QL_VOICE_PING_AGREE = 133,
	QL_VOICE_PING_DECLINE = 134,
	QL_VOICE_PING_TARGET_CANEL = 135,
	QL_VOICE_PING_CLAIM = 136,
	QL_VOICE_PING_HELP_AGREE = 137,
	QL_VOICE_BREAKINTO_START = 138,
	QL_VOICE_SCAN_ME = 139,
	QL_OPERATOR_ARMORY_UPGRADE = 140,
	QL_OPERATOR_TACTICAL_UPGRADE = 141,
	QL_OPERATOR_EQUIP_UPGRADE = 142,
	QL_OPERATOR_DERAILED_INGAME_MOVIE = 143,
	QL_OPERATOR_SHIPYARD_INGAME_MOVIE = 144,
	QL_OPERATOR_WINDFARM_INGAME_MOVIE = 145,
	QL_OPERATOR_BRIDGE_INGAME_MOVIE = 146,
	QL_OPERATOR_CHANGE_STARTPOINT_ATTACK = 147,
	QL_OPERATOR_CHANGE_STARTPOINT_DEFENCE = 148,
	QL_OPERATOR_REMAIN_TIME = 149,
	QL_OPERATOR_FILED_MOVE = 150,
	QL_OPERATOR_GET_SEED = 151,
	QL_OPERATOR_SEED_INSTALL = 152,
	QL_OPERATOR_SEED_RELEASE = 153,
	QL_OPERATOR_SEED_NOTIFY = 154,
	QL_OPERATOR_RESULT = 155,
	QL_OPERATOR_INTER_START = 156,
	QL_OPERATOR_INTER_END = 157,
	QL_OPERATOR_ARMED_TIME = 158,
	QL_OPERATOR_ALLREADY = 159,
	QL_OPERATOR_AUTO_SUPPLY = 160,
	QL_OPERATOR_ENEMY_INFO_OPEN = 161,
	QL_OPERATOR_ENEMY_INFO_OPEN_S = 162,
	QL_OPERATOR_ENEMY_UPGRADE_OPEN = 163,
	QL_OPERATOR_SEED_DROP = 164,
	QL_OPERATOR_BATTLE_ASPECT_E4_T3 = 165,
	QL_OPERATOR_BATTLE_ASPECT_E3_T1_AT = 166,
	QL_OPERATOR_BATTLE_ASPECT_E3_T1_DEF = 167,
	QL_OPERATOR_BATTLE_ASPECT_E1_T3_AT = 168,
	QL_OPERATOR_BATTLE_ASPECT_E1_T3_DEF = 169,
	QL_OPERATOR_BATTLE_ASPECT_E1_T1_AT = 170,
	QL_OPERATOR_BATTLE_ASPECT_E1_T1_DEF = 171,
	QL_OPERATOR_LAST_ROUND = 172,
	QL_OPERATOR_FIRST_WIN = 173,
	QL_OPERATOR_FIRST_LOSE = 174,
	QL_OPERATOR_WININGSTREAK_3 = 175,
	QL_OPERATOR_LOSINGSTREAK_3 = 176,
	QL_OPERATOR_WININGSTREAK_4 = 177,
	QL_OPERATOR_LOSINGSTREAK_4 = 178,
	QL_OPERATOR_WININGSTREAK_3_N_LOSE = 179,
	QL_OPERATOR_LOSINGSTREAK_3_N_WIN = 180,
	QL_OPERATOR_ENEMY_JUGGERNAUT_2 = 181,
	QL_OPERATOR_ENEMY_JUGGERNAUT_3 = 182,
	QL_OPERATOR_TEAM_JUGGERNAUT_2 = 183,
	QL_OPERATOR_TEAM_JUGGERNAUT_3 = 184,
	QL_OPERATOR_ENEMY_JUGGERNAUT_1 = 185,
	QL_OPERATOR_TEAM_JUGGERNAUT_1 = 186,
	QL_OPERATOR_TEAM_KILL = 187,
	QL_OPERATOR_FIRST_KILL = 188,
	QL_OPERATOR_DOUBLE_KILL = 189,
	QL_OPERATOR_TRIPLE_KILL = 190,
	QL_OPERATOR_ALL_KILL = 191,
	QL_OPERATOR_ALL_KILL_MELEE = 192,
	QL_OPERATOR_HALF_JUG_ARMOR = 193,
	QL_OPERATOR_HALF_JUG_AMMO = 194,
	QL_OPERATOR_ZERO_JUG_AMMO = 195,
	QL_OPERATOR_SHOP_NOTBUY_ARMOR = 196,
	QL_OPERATOR_SHOP_NOTBUY_AMMO = 197,
	QL_OPERATOR_SHOP_NOTBUY_SNIPERSCOPE = 198,
	QL_OPERATOR_30_UNDER_HAVE_HEAL_PACK = 199,
	QL_OPERATOR_30_UNDER_NEED_HEAL_PACK = 200,
	QL_OPERATOR_ARMORPLATE_USE = 201,
	QL_OPERATOR_ARMORPLATE_NEED = 202,
	QL_OPERATOR_SENDSTORM = 203,
	QL_OPERATOR_TUTORIAL_START_2 = 204,
	QL_OPERATOR_TUTORIAL_START_3 = 205,
	QL_OPERATOR_TUTORIAL_PHASE_2 = 206,
	QL_OPERATOR_TUTORIAL_PHASE_3 = 207,
	QL_OPERATOR_TUTORIAL_PHASE_4 = 208,
	QL_OPERATOR_TUTORIAL_PHASE_5 = 209,
	QL_OPERATOR_TUTORIAL_PHASE_6 = 210,
	QL_OPERATOR_TUTORIAL_PHASE_7 = 211,
	QL_OPERATOR_TUTORIAL_PHASE_8 = 212,
	QL_OPERATOR_TUTORIAL_PHASE_9 = 213,
	QL_OPERATOR_TUTORIAL_PHASE_10 = 214,
	QL_OPERATOR_TUTORIAL_PHASE_11 = 215,
	QL_OPERATOR_SIGNATURE_SCAN = 216,
	QL_OPERATOR_SOY_SIGNATURE_SCAN = 217,
	QL_OPERATOR_BREAKINTO_READY = 218,
	QL_OPERATOR_BREAKINTO_START = 219,
	QL_OPERATOR_BREAKINTO_TEAM_ALERT = 220,
	QL_TUTORIAL_OPEN_INVENTORY = 221,
	QL_TUTORIAL_BUY_MP5 = 222,
	QL_TUTORIAL_BUY_AMMO_10 = 223,
	QL_TUTORIAL_INVEST_ARMORY = 224,
	QL_TUTORIAL_ATTACH_WEAPON_PARTS = 225,
	QL_TUTORIAL_SET_LOADOUT = 226,
	QL_TUTORIAL_INVEST_ORDNANCE = 227,
	QL_TUTORIAL_BUY_BANDAGE = 228,
	QL_TUTORIAL_BUY_ARMOR_PLATE = 229,
	QL_TUTORIAL_BUY_GRENADE = 230,
	QL_TUTORIAL_MOVE_FRONT = 231,
	QL_TUTORIAL_MOVE_BACK = 232,
	QL_TUTORIAL_MOVE_LEFT = 233,
	QL_TUTORIAL_MOVE_RIGHT = 234,
	QL_TUTORIAL_CROUCH = 235,
	QL_TUTORIAL_WALK = 236,
	QL_TUTORIAL_JUMP = 237,
	QL_TUTORIAL_LONG_JUMP = 238,
	QL_TUTORIAL_ROLL = 239,
	QL_TUTORIAL_ROLL_LEFT = 240,
	QL_TUTORIAL_ROLL_RIGHT = 241,
	QL_TUTORIAL_FIRE_WEAPON = 242,
	QL_TUTORIAL_RELOAD_WEAPON = 243,
	QL_TUTORIAL_AIMING = 244,
	QL_TUTORIAL_AIM_TO_ADS = 245,
	QL_TUTORIAL_ADS = 246,
	QL_TUTORIAL_LEAN_LEFT = 247,
	QL_TUTORIAL_LEAN_RIGHT = 248,
	QL_TUTORIAL_GROGGY_BULLET = 249,
	QL_TUTORIAL_KILL_BULLET = 250,
	QL_TUTORIAL_MELEE_V = 251,
	QL_TUTORIAL_SWITCH_MELEE_WEAPON = 252,
	QL_TUTORIAL_MELEE_MOUSE = 253,
	QL_TUTORIAL_GROGGY_MELEE = 254,
	QL_TUTORIAL_KILL_MELEE = 255,
	QL_TUTORIAL_LOOT_ITEM = 256,
	QL_TUTORIAL_RESCUE_ALLY = 257,
	QL_TUTORIAL_INTERACT_ITEM_BOX = 258,
	QL_TUTORIAL_GET_DROP_ITEM = 259,
	QL_TUTORIAL_USE_ITEM_RECOVER = 260,
	QL_TUTORIAL_SIGNATURE_ACTION = 261,
	QL_TUTORIAL_USE_ZIPLINE = 262,
	QL_TUTORIAL_SWITCH_THROW_WEAPON = 263,
	QL_TUTORIAL_THROW_WEAPON = 264,
	QL_TUTORIAL_FAST_THROW_WEAPON = 265,
	QL_TUTORIAL_MARK_PING_MOVE = 266,
	QL_TUTORIAL_MARK_PING_ENEMY = 267,
	QL_TUTORIAL_MARK_PING_SUPPORT = 268,
	QL_TUTORIAL_OPEN_STATUS_BOARD = 269,
	QL_TUTORIAL_DRAW_STATUS_BOARD = 270,
	QL_TUTORIAL_PING_STATUS_BOARD = 271,
	QL_TUTORIAL_GET_BOMB = 272,
	QL_TUTORIAL_INSTALL_BOMB = 273,
	QL_TUTORIAL_WAIT_EXPLOSION_BOMB = 274,
	QL_TUTORIAL_USE_ARMOR_PLATE = 275,
	QL_TUTORIAL_STEALTH = 276,
	QL_BI_NORMAL = 277,
	QL_BI_ALARMED = 278,
	QL_BI_COMBAT_SIMPLE = 279,
	QL_BI_COMBAT_HARD = 280,
	QL_Max = 281,
};

// Enum ProjectD.EQuestType
enum class EQuestType : uint8_t {
	QT_VOICE = 0,
	QT_TUTORIAL = 1,
	QT_BATTLE_INTENSITY = 2,
	QT_MAX = 3,
};

// Enum ProjectD.EReloadNotifyType
enum class EReloadNotifyType : uint8_t {
	NONE = 0,
	AttachMagazineToHand = 1,
	HideMagazine = 2,
	All = 3,
	EReloadNotifyType_MAX = 4,
};

// Enum ProjectD.EGuideType
enum class EGuideType : uint8_t {
	ROUND_OFFENSE = 0,
	ROUND_DEFENSE = 1,
	AREA = 2,
	PATH = 3,
	EGuideType_MAX = 4,
};

// Enum ProjectD.ESceneEvent
enum class ESceneEvent : uint8_t {
	SE_None = 0,
	SE_MatchingStarted = 1,
	SE_MatchingCanceled = 2,
	SE_MAX = 3,
};

// Enum ProjectD.ESceneName
enum class ESceneName : uint8_t {
	None = 0,
	Start = 1,
	Login = 2,
	lobby = 3,
	AgentNick = 4,
	AgentCreate = 5,
	AgentInven = 6,
	AgentLobby = 7,
	Custom = 8,
	CustomCharacterPerk = 9,
	CustomCharacterDeco = 10,
	CustomVoice = 11,
	CustomWeapon = 12,
	CustomGameDeco = 13,
	Clan = 14,
	ClanInfo = 15,
	ClanList = 16,
	ClanCreate = 17,
	DebugLog = 18,
	PlayLogReport = 19,
	Loading = 20,
	LoadBase = 21,
	LoadIntro = 22,
	LoadMatch = 23,
	LoadResult = 24,
	Ingame = 25,
	GameResult = 26,
	Scene_Max = 27,
	ESceneName_MAX = 28,
};

// Enum ProjectD.EBowStringAction
enum class EBowStringAction : uint8_t {
	Grab = 0,
	Release = 1,
	PullTight = 2,
	EBowStringAction_MAX = 3,
};

// Enum ProjectD.EPDSlidableType
enum class EPDSlidableType : uint8_t {
	Slidable_None = 0,
	Slidable_Start = 1,
	Slidable_Loop = 2,
	Slidable_End = 3,
	Slidable_MAX = 4,
};

// Enum ProjectD.ESoundTapType
enum class ESoundTapType : int32_t {
	None = -1,
	Sound = 0,
	Voice = 1,
	ESoundTapType_MAX = 2,
};

// Enum ProjectD.ESplineTrace
enum class ESplineTrace : uint8_t {
	ST_None = 0,
	SR_TraceTarget = 1,
	ESplineTrace_MAX = 2,
};

// Enum ProjectD.ESplineRotation
enum class ESplineRotation : uint8_t {
	SR_None = 0,
	SR_LookAtTarget = 1,
	SR_Local = 2,
	SR_World = 3,
	SR_InterpPoint = 4,
	SR_InterpPointLocal = 5,
	SR_MAX = 6,
};

// Enum ProjectD.ESplineMovementType
enum class ESplineMovementType : uint8_t {
	Position = 0,
	OffsetRotateAndPosition = 1,
	RotateAndPosition = 2,
	UseCustomRotation = 3,
	UseCharacterBone = 4,
	FOVOnly = 5,
	ESplineMovementType_MAX = 6,
};

// Enum ProjectD.EMoveInterpolateType
enum class EMoveInterpolateType : uint8_t {
	None = 0,
	PrevPosInclusive = 1,
	EMoveInterpolateType_MAX = 2,
};

// Enum ProjectD.ETabButtonState
enum class ETabButtonState : uint8_t {
	UnSelect = 0,
	Select = 1,
	ETabButtonState_MAX = 2,
};

// Enum ProjectD.ERookieEventState
enum class ERookieEventState : uint8_t {
	FirstLogin = 0,
	Incomplete = 1,
	CompleteTutorial = 2,
	CompletePlayGames = 3,
	CompleteAll = 4,
	ERookieEventState_MAX = 5,
};

// Enum ProjectD.EInvenSortOrder
enum class EInvenSortOrder : uint8_t {
	Property_Mission_ModeItem = 0,
	Property_Coin = 1,
	Property_ArmorPlate = 2,
	Property_Bandage = 3,
	Property_Painkiller = 4,
	Property_Pouchkit = 5,
	Property_FirstAidkit = 6,
	Property_Astrapi = 7,
	Property_SelfRevivalKit = 8,
	Property_Scope = 9,
	Property_FrontSight = 10,
	Property_SideSight = 11,
	Property_RearSight = 12,
	Property_Grip = 13,
	Property_Muzzle = 14,
	Property_Stock = 15,
	Property_Magazine = 16,
	Property_Ammo_10 = 17,
	Property_Ammo_557 = 18,
	Property_Ammo_763 = 19,
	Property_Ammo_12Gauge = 20,
	Property_Ammo_47 = 21,
	Property_Ammo_128 = 22,
	Property_Ammo_762G = 23,
	Property_Ammo_Arrow = 24,
	Property_Ammo_Exosuit = 25,
	Property_AR = 26,
	Property_SMG = 27,
	Property_SR = 28,
	Property_SG = 29,
	Property_LMG = 30,
	Property_BOW = 31,
	Property_RPG = 32,
	Property_MINIGUN = 33,
	Property_EXOSUIT_SMG = 34,
	Property_ETC = 35,
	Property_Pistol = 36,
	Property_Grenade = 37,
	Property_Smoke = 38,
	Property_GasGrenade = 39,
	Property_ScanGrenade = 40,
	Property_HealGrenade = 41,
	Property_Explosive = 42,
	Property_WhitePhosphorus = 43,
	Property_SND_BombDeactivateKit = 44,
	Property_MAX = 45,
};

// Enum ProjectD.EUIEvent
enum class EUIEvent : uint8_t {
	UE_None = 0,
	UE_ClanNameCheck = 1,
	UE_ClanCreate = 2,
	UE_ClanBreakRequested = 3,
	UE_ClanDestroyed = 4,
	UE_ClanInfoUpdated = 5,
	UE_ClanMemberListUpdated = 6,
	UE_ClanWaiterListUpdated = 7,
	UE_ClanListUpdated = 8,
	UE_ClanBreakCanceled = 9,
	UE_ClanJoined = 10,
	UE_ClanMemberRemoved = 11,
	UE_ClanDetailGet = 12,
	UE_ClanListLeftClicked = 13,
	UE_LeptonEquipFailed = 14,
	UE_LeptonSeasonMissionStatusUpdated = 15,
	UE_LeptonEquipListUpdated = 16,
	UE_Mercenary_Notify_Invite = 17,
	UE_InviteParty_Result = 18,
	UE_AcceptInviteParty_Result = 19,
	UE_NotifyBreakParty = 20,
	UE_OnShutDown = 21,
	UE_ReloadFindPartyUI = 22,
	UE_ReloadRegisterMercenaryUI = 23,
	UE_FindPartyPageVisibilityUpdated = 24,
	UE_ShowMatching = 25,
	UE_MatchingTime = 26,
	UE_HideMatching = 27,
	UE_ReloadPenalty = 28,
	UE_DefaultCustomRoom = 29,
	UE_ReloadCustomRoom = 30,
	UE_ReloadCustomRoomOption = 31,
	UE_ReloadHideCode = 32,
	UE_ReloadCustomRoomState = 33,
	UE_ReloadCustomRoomButton = 34,
	UI_MailListUpdate = 35,
	UI_MailUpdateItemStatus = 36,
	UE_NewMailVisibilityUpdated = 37,
	UE_MailUIClosed = 38,
	UE_ReloadOptionPopup = 39,
	MAXUIEvent = 40,
	EUIEvent_MAX = 41,
};

// Enum ProjectD.EChannelRange
enum class EChannelRange : uint8_t {
	None = 0,
	Party = 1,
	Area = 2,
	Team = 3,
	Text = 4,
	Max = 5,
};

// Enum ProjectD.EMapObjectState
enum class EMapObjectState : uint8_t {
	None = 0,
	Normal = 1,
	Groggy = 2,
	Dead = 3,
	Rescue = 4,
	Bandage = 5,
	Astrapi = 6,
	ArmorKit = 7,
	Seed = 8,
	Revive = 9,
	Shop = 10,
	Max = 11,
};

// Enum ProjectD.EMapObjectType
enum class EMapObjectType : uint8_t {
	None = 0,
	MainPlayer = 1,
	Ally = 2,
	Enemy = 3,
	Npc = 4,
	Object = 101,
	Seed = 102,
	Demolition = 103,
	EnemyDamage = 104,
	EnemyDeath = 105,
	SafeZone = 106,
	FireSound = 107,
	Ping = 108,
	Camp = 109,
	Drawing = 110,
	ItemBox = 111,
	Mission_Lepton = 112,
	RecMainPlayer = 201,
	RecAlly = 202,
	RecEnemy = 203,
	YoungsikHacking = 204,
	Max = 205,
};

// Enum ProjectD.EEntryPointType
enum class EEntryPointType : uint8_t {
	EPT_NONE = 0,
	EPT_Entry = 1,
	EPT_Exit = 2,
	EPT_MAX = 3,
};

// Class ProjectD.AnimNotify_PlayFacialMontage
class UAnimNotify_PlayFacialMontage : public UAnimNotify {

public:

	struct FName Name; // 0x38 (8)
};

// Class ProjectD.ExportCharacterSpawn
class AExportCharacterSpawn : public UActor {

public:

	struct UStaticMeshComponent StaticMeshComp; // 0x220 (8)
	enum class ECharacterSpawnGroup Grouptype; // 0x228 (1)
	int32_t Index; // 0x22C (4)
};

// Class ProjectD.ExportMissionScoreModeSpawnSystem
class AExportMissionScoreModeSpawnSystem : public UActor {

public:

	int32_t PcID; // 0x220 (4)
	struct UStaticMeshComponent GroupComp; // 0x228 (8)
	struct FGroupRangeInfo GroupRangeInfo; // 0x230 (36)
	struct UChildActorComponent CCTV_ActorComp; // 0x258 (8)
	bool bInGameDebugDraw; // 0x260 (1)
};

// Class ProjectD.ExportModeSpawnSystem
class AExportModeSpawnSystem : public UActor {

public:

	int32_t PcID; // 0x220 (4)
	bool bInGameLineVisible; // 0x224 (1)
	struct UStaticMeshComponent DefuseBombComp; // 0x228 (8)
	struct UStaticMeshComponent TeamAComp; // 0x230 (8)
	struct UStaticMeshComponent TeamBComp; // 0x238 (8)
	struct UStaticMeshComponent TeamAShopTrigger; // 0x240 (8)
	struct UBoxComponent TeamAShopBoxComp; // 0x248 (8)
	struct UStaticMeshComponent TeamBShopTrigger; // 0x250 (8)
	struct UBoxComponent TeamBShopBoxComp; // 0x258 (8)
	struct UChildActorComponent TeamA_CCTV_ActorComp; // 0x260 (8)
	struct UChildActorComponent TeamB_CCTV_ActorComp; // 0x268 (8)
	struct UChildActorComponent TeamA_IntroCam_ActorComp; // 0x270 (8)
	struct UChildActorComponent TeamB_IntroCam_ActorComp; // 0x278 (8)
};

// Class ProjectD.ExportTeamModeSpawnSystem
class AExportTeamModeSpawnSystem : public UActor {

public:

	int32_t PcID; // 0x220 (4)
	bool bInGameLineVisible; // 0x224 (1)
	struct UStaticMeshComponent DefuseBombComp; // 0x228 (8)
	struct UStaticMeshComponent TeamAComp; // 0x230 (8)
	struct UStaticMeshComponent TeamBComp; // 0x238 (8)
	struct UStaticMeshComponent TeamAShopTrigger; // 0x240 (8)
	struct UBoxComponent TeamAShopBoxComp; // 0x248 (8)
	struct UStaticMeshComponent TeamBShopTrigger; // 0x250 (8)
	struct UBoxComponent TeamBShopBoxComp; // 0x258 (8)
	struct UChildActorComponent TeamA_CCTV_ActorComp; // 0x260 (8)
	struct UChildActorComponent TeamB_CCTV_ActorComp; // 0x268 (8)
	struct UChildActorComponent TeamA_IntroCam_ActorComp; // 0x270 (8)
	struct UChildActorComponent TeamB_IntroCam_ActorComp; // 0x278 (8)
};

// Class ProjectD.ExportTriggerBox
class AExportTriggerBox : public ATriggerBox {

public:

	int32_t TargetType; // 0x228 (4)
	bool EnableExport; // 0x22C (1)
};

// Class ProjectD.ExportWorldItem
class AExportWorldItem : public UActor {

public:

	struct UStaticMeshComponent StaticMeshComp; // 0x220 (8)
	bool bUseItemSpawn; // 0x228 (1)
	bool bRandomZRotation; // 0x229 (1)
	int32_t ModeItemIndex; // 0x22C (4)
	struct TArray<int32_t> ItemsGroupIndexList; // 0x230 (16)
};

// Class ProjectD.IKTargetGetter_Parkour
class UIKTargetGetter_Parkour : public UIKTargetGetter {

public:

	struct UAnimNotify_SetIKTarget IKTargetNotify; // 0x30 (8)
	struct UAnimationAsset Animation; // 0x38 (8)
};

// Class ProjectD.IKTargetGetter_Weapon
class UIKTargetGetter_Weapon : public UIKTargetGetter {

public:

	struct FName SocketName; // 0x30 (8)
};

// Class ProjectD.LiveDataTableAsset
class ULiveDataTableAsset : public UDataAsset {

public:

	struct FName Name; // 0x30 (8)
	struct FFilePath SourcePath; // 0x38 (16)
	struct UScriptStruct DataClass; // 0x48 (8)
	struct ULiveDataTable Table; // 0x50 (8)
};

// Class ProjectD.PDUserWidget
class UPDUserWidget : public UUserWidget {

public:

	struct TMap<struct FName, struct UWidgetAnimation> AnimMap; // 0x238 (80)
};

// Class ProjectD.PD3DIndicatorUI
class UPD3DIndicatorUI : public UPDIngameModeWidget {

public:

	struct UCanvasPanel CP_3DIndicator; // 0x290 (8)
	struct UPDImage IMG_Arrow; // 0x298 (8)
	struct UWidgetSwitcher WS_IndicatorType; // 0x2A0 (8)
	float SphereRadius; // 0x2A8 (4)
	struct FVector2D MinScale; // 0x2AC (8)
	float RadiusX; // 0x2B4 (4)
	float MinRadiusY; // 0x2B8 (4)
	float MaxPingDistance; // 0x2BC (4)
	float CreateTime; // 0x2C0 (4)
	float CreateTranslationRate; // 0x2C4 (4)
	float CreateScaleRate; // 0x2C8 (4)
	float HoldTime; // 0x2CC (4)
	float RemoveTime; // 0x2D0 (4)
	float RemoveScaleRate; // 0x2D4 (4)
};

// Class ProjectD.PDActionBase
class UPDActionBase : public Object {

public:

	struct UPDActionComponent OwnerActionComponent; // 0x48 (8)
	struct UPDMainPlayerActionComponent OwnerMainPlayerActionComponent; // 0x50 (8)
	struct UPDStateComponent OwnerStateComponent; // 0x58 (8)
	struct UPDMainPlayerStateComponent OwnerMainPlayerStateComponent; // 0x60 (8)
	struct APDPlayerCharacter OwnerPlayerCharacter; // 0x68 (8)
	struct APDMainPlayerCharacter OwnerMainPlayerCharacter; // 0x70 (8)
	struct UAnimMontage CurrentPlayingMontage; // 0x78 (8)
};

// Class ProjectD.PDAnimInstance
class UPDAnimInstance : public UAnimInstance {

public:

	enum class EPDAnimset AnimSet; // 0x268 (1)
	struct APDPlayerCharacter OwnerPlayerCharacter; // 0x270 (8)
	struct UPDStateComponent OwnerStateComponent; // 0x278 (8)
};

// Class ProjectD.PDPlayerAnimInstance
class UPDPlayerAnimInstance : public UPDAnimInstance {

public:

	enum class EPDLocoType PrevLocoType; // 0x280 (1)
	enum class EPDLocoType LocoType; // 0x281 (1)
	enum class EPDLocoState LocoState; // 0x282 (1)
	enum class EPDMovementState MovementState; // 0x283 (1)
	enum class EPDLeanState LeanState; // 0x284 (1)
	enum class EPDStanceState StanceState; // 0x285 (1)
	enum class EPDClimbStanceState ClimbStanceState; // 0x286 (1)
	enum class EPDThrowStanceState ThrowStanceState; // 0x287 (1)
	enum class EPDSlideStanceState SlideStanceState; // 0x288 (1)
	enum class EPDAimingState AimingState; // 0x289 (1)
	enum class EPDAimingState PrevAimingState; // 0x28A (1)
	enum class EPDGaitsState GaitState; // 0x28B (1)
	float GaitStateValue; // 0x28C (4)
	float GaitValue; // 0x290 (4)
	float Direction; // 0x294 (4)
	float AimPitch; // 0x298 (4)
	float AimYaw; // 0x29C (4)
	float FreeLookYaw; // 0x2A0 (4)
	float AimInterpTime; // 0x2A4 (4)
	float LeanFB; // 0x2A8 (4)
	float LeanLR; // 0x2AC (4)
	float AbsLeanFactor; // 0x2D0 (4)
	float StartPosition; // 0x2D4 (4)
	float PlayRate; // 0x2D8 (4)
	bool WStanceIsValid; // 0x2DC (1)
	bool SWStanceIsValid; // 0x2DD (1)
	struct FPDPerSpecificWeaponAnimDatas PSpecificWeaponAnimDatas; // 0x2E0 (200)
	struct FPDPWUsingInABPAnimDatas PWAnimDatas; // 0x3A8 (296)
	struct FPDPCUsingInABPAnimDatas PCAnimDatas; // 0x4D0 (96)
	struct FPDIngameFacialAnimData IngameFacialAnimData; // 0x530 (104)
	bool IsCharacterDead; // 0x598 (1)
	bool bIsExhausted; // 0x599 (1)
	bool bIsStealth; // 0x59A (1)
	bool MirrorFinalPose; // 0x59B (1)
	bool bWeaponN_To_WeaponL; // 0x59C (1)
	bool bOverrideUpper; // 0x59D (1)
	bool bOverrideLower; // 0x59E (1)
	bool bIsRagdoll; // 0x59F (1)
	bool bInSnapshot; // 0x5A0 (1)
	struct UCurveVector YawOffset_FB; // 0x5A8 (8)
	struct UCurveFloat LeanCurve; // 0x5B0 (8)
	struct FPDAnimGraphAimingValues AimingValues; // 0x5B8 (12)
	struct UBlendSpace CurFRAnim; // 0x5C8 (8)
	struct UPDFireRecoilLevel FRLevel; // 0x5D0 (8)
	enum class EPD4DirType StartingDir; // 0x5D8 (1)
	enum class EPD4DirType StoppingDir; // 0x5D9 (1)
	float CrouchPoseStartRatio; // 0x5DC (4)
	float StandPoseStartRatio; // 0x5E0 (4)
};

// Class ProjectD.PDActionAnimNotify
class UPDActionAnimNotify : public UAnimNotify {

public:

	struct FName EventName; // 0x38 (8)
};

// Class ProjectD.PDActionAnimNotifyState
class UPDActionAnimNotifyState : public UAnimNotifyState {

public:

	struct FName BeginEventName; // 0x30 (8)
	struct UCurveBase BeginCurve; // 0x38 (8)
	struct FVector BeginVector; // 0x40 (12)
	struct FName EndEventName; // 0x4C (8)
	struct FVector EndVector; // 0x54 (12)
	enum class ECameraMovementType CameraMovement; // 0x60 (1)
};

// Class ProjectD.PDActionComponent
class UPDActionComponent : public UActorComponent {

public:

	struct TArray<struct UPDActionBase> ActionList; // 0xC8 (16)
	struct TArray<struct UClass*> ActionClassList; // 0xD8 (16)
	struct UDataTable ClimbUpHandOffsets; // 0x100 (8)
	struct UDataTable VaultHandOffsets; // 0x108 (8)
	struct UDataTable LedgeGrapHandOffsets; // 0x110 (8)
};

// Class ProjectD.PDActionParkourBase
class UPDActionParkourBase : public UPDActionBase {

public:

	bool bShowDebug; // 0x1AC (1)
	float HandPointThreshold; // 0x1B0 (4)
	float CapsuleHalfHeightThreshold; // 0x1B4 (4)
	float HandPointGap; // 0x1B8 (4)
	float ForwardOffset; // 0x1BC (4)
	float OverCapsuleHalfHeight; // 0x1C0 (4)
	float OverCollisionThickness; // 0x1C4 (4)
	float VaultHeightThreshold; // 0x1C8 (4)
};

// Class ProjectD.PDAgentCreateUI
class UPDAgentCreateUI : public UPDSceneBaseUI {

public:

	struct UTileView TV_AgentList; // 0x288 (8)
	struct UPDTabButtonGroup AgentTabBtnGroup; // 0x290 (8)
	struct UPDButton CreateBtn; // 0x298 (8)
	struct UPDKeyButton Btn_Back; // 0x2A0 (8)
	struct UWidget IMG_Movie; // 0x2A8 (8)
	struct UPDTextBlock T_Name; // 0x2B0 (8)
	struct UPDTextBlock T_Num; // 0x2B8 (8)
	struct UPDTextBlock T_Nationality; // 0x2C0 (8)
	struct UImage IMG_ProfileBg_Pic; // 0x2C8 (8)
	struct UImage IMG_ProfilePic; // 0x2D0 (8)
	struct UImage IMG_Sign; // 0x2D8 (8)
	struct UImage IMG_Icon_Lepton_01; // 0x2E0 (8)
	struct UImage IMG_Icon_Lepton_02; // 0x2E8 (8)
	struct UImage IMG_Icon_Signature; // 0x2F0 (8)
	struct UPDTextBlock T_Title_Lepton_01; // 0x2F8 (8)
	struct UPDTextBlock T_Desc_Lepton_01; // 0x300 (8)
	struct UPDTextBlock T_Title_Lepton_02; // 0x308 (8)
	struct UPDTextBlock T_Desc_Lepton_02; // 0x310 (8)
	struct UPDTextBlock T_Desc_Signature; // 0x318 (8)
	struct UPDTextBlock T_ProfileDesc_01; // 0x320 (8)
	struct UPDTextBlock T_ProfileDesc_02; // 0x328 (8)
	struct UMediaPlayer AgentMediaPlayer; // 0x330 (8)

	void SetAgentInfo(int32_t SkillIndex, struct FVector2D InfoAbsolutePos); // Function ProjectD.PDAgentCreateUI.SetAgentInfo(Final|Native|Private|HasDefaults) // <VeiledExperts-Win64-Shipping.exe+0x18054E0>
	void OnMovieOpened(); // Function ProjectD.PDAgentCreateUI.OnMovieOpened(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnMovieClosed(); // Function ProjectD.PDAgentCreateUI.OnMovieClosed(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnInitMediaPlayer(); // Function ProjectD.PDAgentCreateUI.OnInitMediaPlayer(Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnCreateAgentClicked(); // Function ProjectD.PDAgentCreateUI.OnCreateAgentClicked(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1805420>
	void OnConfirmCreate(int32_t AgentIndex); // Function ProjectD.PDAgentCreateUI.OnConfirmCreate(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18053A0>
	void OnBackClicked(); // Function ProjectD.PDAgentCreateUI.OnBackClicked(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1805380>
	void AgentSkillVisible(bool bShow); // Function ProjectD.PDAgentCreateUI.AgentSkillVisible(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1805190>
};

// Class ProjectD.PDAgentInvenCustomTarget
class UPDAgentInvenCustomTarget : public UPDUserWidget {

public:

	struct UWidgetSwitcher WS_SelectedState; // 0x288 (8)
};

// Class ProjectD.PDAgentInvenPerkListItem
class UPDAgentInvenPerkListItem : public UPDUserWidget {

public:

	struct UImage Img_Bg; // 0x290 (8)
	struct UImage IMG_Item; // 0x298 (8)
	struct UBorder BD_ItemOutline; // 0x2A0 (8)
	struct UPDButton Btn_GoEquipPerk; // 0x2A8 (8)

	void GotoCharacterPerk(); // Function ProjectD.PDAgentInvenPerkListItem.GotoCharacterPerk(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1805300>
};

// Class ProjectD.PDAgentInventoryUI
class UPDAgentInventoryUI : public UPDSceneBaseUI {

public:

	struct UCanvasPanel CP_AgentInventory; // 0x288 (8)
	struct UVerticalBox VB_CharacterSlots; // 0x290 (8)
	struct UPDTabButtonGroup AgentSlotTabBtnGroup; // 0x298 (8)
	struct UImage IMG_Siluet; // 0x2A0 (8)
	struct UPDButton Btn_GotoLobby; // 0x2A8 (8)
	struct UPDTextBlock T_ContractNum; // 0x2B0 (8)
	struct UPDTextBlock T_SelectedAgent_Name; // 0x2B8 (8)
	struct UPDTextBlock T_SelectedAgent_Nationality; // 0x2C0 (8)
	struct UPDTextBlock T_SelectedAgent_CodeName; // 0x2C8 (8)
	struct UCanvasPanel CP_AgentSign; // 0x2D0 (8)
	struct UImage IMG_AgentSign; // 0x2D8 (8)
	struct UPDButton Btn_QuickContract; // 0x2E0 (8)
	struct UCanvasPanel CP_PageInfo; // 0x2E8 (8)
	struct UCanvasPanel CP_SlotChanger_L; // 0x2F0 (8)
	struct UCanvasPanel CP_SlotChanger_R; // 0x2F8 (8)
	struct UPDButton Btn_SlotChanger_L; // 0x300 (8)
	struct UPDButton Btn_SlotChanger_R; // 0x308 (8)
	struct UWidgetSwitcher WS_SlotChanger_L; // 0x310 (8)
	struct UWidgetSwitcher WS_SlotChanger_R; // 0x318 (8)
	struct UPDTextBlock TB_CurPage; // 0x320 (8)
	struct UPDTextBlock TB_MaxPage; // 0x328 (8)
	struct UCanvasPanel CP_AgentPos; // 0x330 (8)
	struct UCanvasPanel CP_GamePos; // 0x338 (8)
	struct UCanvasPanel CP_WeaponPos; // 0x340 (8)
	struct UPDAgentInvenCustomTarget AICT_Agent; // 0x348 (8)
	struct UPDAgentInvenCustomTarget AICT_Game; // 0x350 (8)
	struct UPDAgentInvenCustomTarget AICT_Weapon; // 0x358 (8)
	struct UCanvasPanel CP_CustomAgent; // 0x360 (8)
	struct UCanvasPanel CP_CustomGame; // 0x368 (8)
	struct UCanvasPanel CP_CustomWeapon; // 0x370 (8)
	struct UImage IMG_New_Perk; // 0x378 (8)
	struct UPDButton Btn_CustomAgent_Perk; // 0x380 (8)
	struct UImage IMG_New_Look; // 0x388 (8)
	struct UPDButton Btn_CustomAgent_Look; // 0x390 (8)
	struct UPDButton Btn_CustomAgent_Voice; // 0x398 (8)
	struct UPDButton Btn_CustomGame; // 0x3A0 (8)
	struct UPDButton Btn_CustomWeapon; // 0x3A8 (8)
	struct UCanvasPanel CP_Rental_ToolTip; // 0x3B0 (8)
	struct UCanvasPanel CP_Title; // 0x3B8 (8)
	struct UPDButton Btn_Back; // 0x3C0 (8)
	struct TMap<int32_t, struct FVector> CharacterMenuPositionMap; // 0x3C8 (80)
	struct TMap<int32_t, struct FVector> GameMenuPositionMap; // 0x418 (80)
	struct TMap<int32_t, struct FVector> WeaponMenuPositionMap; // 0x468 (80)
	float RandomLineMin; // 0x4B8 (4)
	float RandomLineMax; // 0x4BC (4)
	struct FLinearColor NormalLineColor; // 0x4C0 (16)
	struct FLinearColor OverLineColor; // 0x4D0 (16)
	struct UPDEquipPerkList EquipPerkList; // 0x4E0 (8)
	struct UCanvasPanel CP_PerkList; // 0x4E8 (8)

	void SlotChangerRight(); // Function ProjectD.PDAgentInventoryUI.SlotChangerRight(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18055C0>
	void SlotChangerLeft(); // Function ProjectD.PDAgentInventoryUI.SlotChangerLeft(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18055A0>
	void QuickContract(); // Function ProjectD.PDAgentInventoryUI.QuickContract(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18054C0>
	void GotoLobby(); // Function ProjectD.PDAgentInventoryUI.GotoLobby(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1805360>
	void GotoGameDeco(); // Function ProjectD.PDAgentInventoryUI.GotoGameDeco(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void GotoCharacterWeapon(); // Function ProjectD.PDAgentInventoryUI.GotoCharacterWeapon(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1805340>
	void GotoCharacterVoice(); // Function ProjectD.PDAgentInventoryUI.GotoCharacterVoice(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void GotoCharacterPerk(); // Function ProjectD.PDAgentInventoryUI.GotoCharacterPerk(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1805320>
	void GotoCharacterDeco(); // Function ProjectD.PDAgentInventoryUI.GotoCharacterDeco(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18052E0>
	void CustomWeaponBtnOver(); // Function ProjectD.PDAgentInventoryUI.CustomWeaponBtnOver(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18052C0>
	void CustomWeaponBtnOut(); // Function ProjectD.PDAgentInventoryUI.CustomWeaponBtnOut(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18052A0>
	void CustomGameBtnOver(); // Function ProjectD.PDAgentInventoryUI.CustomGameBtnOver(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1805280>
	void CustomGameBtnOut(); // Function ProjectD.PDAgentInventoryUI.CustomGameBtnOut(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1805260>
	void CustomCharacterPerkBtnOver(); // Function ProjectD.PDAgentInventoryUI.CustomCharacterPerkBtnOver(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1805240>
	void CustomCharacterPerkBtnOut(); // Function ProjectD.PDAgentInventoryUI.CustomCharacterPerkBtnOut(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1805220>
};

// Class ProjectD.PDAgentLeptonInfo
class UPDAgentLeptonInfo : public UPDIngameModeWidget {

public:

	struct UImage IMG_UniqueSlot_Perk1; // 0x290 (8)
	struct UPDTextBlock T_UniqueSlot_PerkName1; // 0x298 (8)
	struct UPDTextBlock T_UniqueSlot_PerkDesc1; // 0x2A0 (8)
	struct UImage IMG_UniqueSlot_Perk2; // 0x2A8 (8)
	struct UPDTextBlock T_UniqueSlot_PerkName2; // 0x2B0 (8)
	struct UPDTextBlock T_UniqueSlot_PerkDesc2; // 0x2B8 (8)
	struct UWidgetSwitcher WS_EquipSlot1; // 0x2D0 (8)
	struct UImage IMG_EquipSlot_Perk1; // 0x2D8 (8)
	struct UPDTextBlock T_EquipSlot_PerkName1; // 0x2E0 (8)
	struct UPDTextBlock T_EquipSlot_PerkDesc1; // 0x2E8 (8)
	struct UWidgetSwitcher WS_EquipSlot2; // 0x2F0 (8)
	struct UImage IMG_EquipSlot_Perk2; // 0x2F8 (8)
	struct UPDTextBlock T_EquipSlot_PerkName2; // 0x300 (8)
	struct UPDTextBlock T_EquipSlot_PerkDesc2; // 0x308 (8)
	struct UWidgetSwitcher WS_EquipSlot3; // 0x310 (8)
	struct UImage IMG_EquipSlot_Perk3; // 0x318 (8)
	struct UPDTextBlock T_EquipSlot_PerkName3; // 0x320 (8)
	struct UPDTextBlock T_EquipSlot_PerkDesc3; // 0x328 (8)
	struct UImage IMG_Signature; // 0x340 (8)
	struct UPDTextBlock T_Signature_Name; // 0x348 (8)
	struct UPDTextBlock T_Signature_Desc; // 0x350 (8)
	struct UPDTextBlock T_AgentName; // 0x358 (8)
};

// Class ProjectD.PDAgentListItemUI
class UPDAgentListItemUI : public UPDUserWidget {

public:

	struct UImage IMG_Face; // 0x290 (8)
	struct UPDTextBlock T_Name; // 0x298 (8)
	struct UPDTextBlock T_HoldingText; // 0x2A0 (8)
	struct UPDTabButton Btn_Select; // 0x2A8 (8)
	struct UCanvasPanel CP_Holding; // 0x2B0 (8)
	struct UCanvasPanel CP_Selected; // 0x2B8 (8)
	struct UWidgetSwitcher WS_LockState; // 0x2C0 (8)

	void OnUnSelectAgent(); // Function ProjectD.PDAgentListItemUI.OnUnSelectAgent(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18054A0>
	void OnUnHoverAgent(); // Function ProjectD.PDAgentListItemUI.OnUnHoverAgent(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1805480>
	void OnSelectAgent(); // Function ProjectD.PDAgentListItemUI.OnSelectAgent(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1805460>
	void OnHoverAgent(); // Function ProjectD.PDAgentListItemUI.OnHoverAgent(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
};

// Class ProjectD.PDAgentPresetListItem
class UPDAgentPresetListItem : public UPDUserWidget {

public:

	struct UBorder BD_Normal; // 0x290 (8)
	struct UBorder BD_Hover; // 0x298 (8)
	struct UBorder BD_Select; // 0x2A0 (8)
	struct UPDTextBlock TB_Name; // 0x2A8 (8)
};

// Class ProjectD.PDAgentSkillListUI
class UPDAgentSkillListUI : public UPDUserWidget {

public:

	struct UImage IMG_Icon; // 0x290 (8)
	struct UPDButton Btn_Skill; // 0x298 (8)
	struct UPDTextBlock TB_Name; // 0x2A0 (8)
	struct UPDTextBlock TB_Desc; // 0x2A8 (8)

	void OnUnHoverAgentSkill(); // Function ProjectD.PDAgentSkillListUI.OnUnHoverAgentSkill(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnHoverAgentSkill(); // Function ProjectD.PDAgentSkillListUI.OnHoverAgentSkill(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
};

// Class ProjectD.PDAgentSlotListItemUI
class UPDAgentSlotListItemUI : public UPDUserWidget {

public:

	struct UImage IMG_New; // 0x290 (8)
	struct UWidgetSwitcher WS_CharacterSlot; // 0x298 (8)
	struct UWidgetSwitcher WS_TagState; // 0x2A0 (8)
	struct UPDButton Btn_CreateButton; // 0x2A8 (8)
	struct UPDButton Btn_AgentSelectButton; // 0x2B0 (8)
	struct UPDTextBlock TB_CharacterName; // 0x2B8 (8)
	struct UPDTextBlock TB_CharacterAncestry; // 0x2C0 (8)
	struct UPDTextBlock TB_Level; // 0x2C8 (8)
	struct UProgressBar PB_Exp; // 0x2D0 (8)
	struct UCanvasPanel CP_CharacterSlot_OverSet; // 0x2D8 (8)
	struct UCanvasPanel CP_CharacterSlot_SelectedSet; // 0x2E0 (8)
	struct UImage IMG_CharacterSlot_Portrait; // 0x2E8 (8)
	struct UCanvasPanel CP_Empty_OverSet; // 0x2F0 (8)
	struct UImage IMG_Signature; // 0x2F8 (8)
	struct UCanvasPanel CP_OverDeco; // 0x300 (8)
	struct UCanvasPanel CP_ExpiredSet; // 0x308 (8)

	void OnUnHoverSelectAgent(); // Function ProjectD.PDAgentSlotListItemUI.OnUnHoverSelectAgent(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1808520>
	void OnUnHoverCreateAgent(); // Function ProjectD.PDAgentSlotListItemUI.OnUnHoverCreateAgent(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1808500>
	void OnHoverSelectAgent(); // Function ProjectD.PDAgentSlotListItemUI.OnHoverSelectAgent(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18084E0>
	void OnHoverCreateAgent(); // Function ProjectD.PDAgentSlotListItemUI.OnHoverCreateAgent(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18084C0>
	void OnClickSelectAgent(); // Function ProjectD.PDAgentSlotListItemUI.OnClickSelectAgent(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18084A0>
	void OnClickCreateAgent(); // Function ProjectD.PDAgentSlotListItemUI.OnClickCreateAgent(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1808480>
};

// Class ProjectD.PDAkEventAnimNotifyState
class UPDAkEventAnimNotifyState : public UAnimNotifyState {

public:

	bool bAutoStopBeginEventPlayingOnEnd; // 0x30 (1)
	struct UAkAudioEvent EventOnBegin; // 0x38 (8)
	struct UAkAudioEvent EventOnEnd; // 0x40 (8)
};

// Class ProjectD.PDAkEventLoadList
class UPDAkEventLoadList : public Object {

public:

	struct TArray<struct UAkAudioEvent> EventsToLoad; // 0x28 (16)
};

// Class ProjectD.PDAkEventTriggerVolume
class APDAkEventTriggerVolume : public ATriggerVolume {

public:

	struct UPDAkComponent PDAkComponent; // 0x258 (8)
	struct TArray<struct UAkAudioEvent> BeginOverlapAkEvents; // 0x260 (16)
	struct TArray<struct UAkAudioEvent> EndOverlapAkEvents; // 0x270 (16)
	struct TArray<struct FPDAudioSwitch> Switches; // 0x280 (16)
	struct FString StateGroup; // 0x290 (16)
	struct FString State; // 0x2A0 (16)
	bool StopWhenOwnerIsDestroyed; // 0x2B0 (1)
};

// Class ProjectD.PDAkReactor
class APDAkReactor : public UActor {

public:

	struct USphereComponent SphereComponent; // 0x2C8 (8)
	struct UPDAkComponent PDAkComponent; // 0x2D0 (8)
};

// Class ProjectD.PDAnimDynamicsInstBase
class UPDAnimDynamicsInstBase : public UPDAnimInstance {

public:

	struct FVector WindVelocity; // 0x280 (12)
	bool UseAnimDynamics; // 0x28C (1)
	bool UseWind; // 0x28D (1)
	float WindInterval; // 0x290 (4)
	float MinWindForce; // 0x294 (4)
	float MaxWindForce; // 0x298 (4)
};

// Class ProjectD.PDAnimNotifyState
class UPDAnimNotifyState : public UAnimNotifyState {

public:

	struct FActionNotifyData BeginNotifyData; // 0x30 (56)
	struct FActionNotifyData EndNotifyData; // 0x68 (56)
};

// Class ProjectD.PDArmorGauge
class UPDArmorGauge : public UPDUserWidget {

public:

	struct FSlateBrush ArmorDisableBrush; // 0x288 (136)
	struct FSlateBrush ArmorBackgroundBrush; // 0x310 (136)
	struct FSlateBrush ArmorFillBrush; // 0x398 (136)
	struct FSlateBrush ArmorMaxBrush; // 0x420 (136)
	struct UCanvasPanel CP_Normal; // 0x4A8 (8)
	struct UHorizontalBox HB_NormalBar; // 0x4B0 (8)
	struct UCanvasPanel CP_Juggernaut; // 0x4B8 (8)
	struct UProgressBar PB_Juggernaut; // 0x4C0 (8)
};

// Class ProjectD.PDArmorGaugeDetail
class UPDArmorGaugeDetail : public UPDArmorGauge {

public:

	struct UHorizontalBox HB_NormalText; // 0x4D0 (8)
	struct UPDMaskedText MT_Juggernaut; // 0x4D8 (8)
	struct FSlateBrush ArmorRecoverBrush; // 0x4E0 (136)
	struct UClass* NormalTextClass; // 0x570 (8)
	float Width; // 0x578 (4)
};

// Class ProjectD.PDAsyncMeshActor
class APDAsyncMeshActor : public UActor {

public:

	struct UBoxComponent BoxComponent; // 0x220 (8)
	struct UPDAsyncMeshComponent AsyncMeshComponent; // 0x228 (8)
};

// Class ProjectD.PDAttackDamageIndicatorUI
class UPDAttackDamageIndicatorUI : public UPDHUDIconBaseUI {

public:

	struct UBorder BD_OutArrow; // 0x2A0 (8)
	struct UOverlay O_Damage; // 0x2A8 (8)
	struct UPDTextBlock TB_TotalDamage; // 0x2B0 (8)
	struct UPDTextBlock TB_TotalArmorDamage; // 0x2B8 (8)
	struct UPDTextBlock TB_TotalGroggyDamage; // 0x2C0 (8)
	struct FSlateColor WeakDamageColor; // 0x2C8 (40)
	struct FSlateColor MediumDamageColor; // 0x2F0 (40)
	struct FSlateColor StrongDamageColor; // 0x318 (40)
	int32_t NormalDamageFontSize; // 0x340 (4)
	struct FSlateColor ArmorDamageColor; // 0x348 (40)
	int32_t ArmorDamageFontSize; // 0x370 (4)
	struct FSlateColor GroggyDamageColor; // 0x378 (40)
	int32_t GroggyDamageFontSize; // 0x3A0 (4)
	struct FVector2D DamageRandBoxSize; // 0x3A4 (8)
	struct FVector2D DamageOffsetSize; // 0x3AC (8)
	float DamageShowTime; // 0x3B4 (4)
};

// Class ProjectD.PDBaseModeUI
class UPDBaseModeUI : public UPDUserWidget {

public:

	struct UCanvasPanel CP_GameModeLayer; // 0x288 (8)
	struct TMap<enum class EGameModeWidget, struct UPDIngameModeWidget> ModeWidgetMap; // 0x290 (80)
	struct UPDPlayerInfoUI PlayerInfo; // 0x2E0 (8)
	struct UPDPerkUI PerkUI; // 0x2E8 (8)
	struct UPDPerkNotifyUI PerkNotifyUI; // 0x2F0 (8)
	struct UPDCoinInfoUI CoinInfo; // 0x2F8 (8)
	struct UPDCrossHairUI CrossHair; // 0x300 (8)
	struct UPDInteractionInfoUI InteractionInfo; // 0x308 (8)
	struct UPDDamageScreenIndicatorUI DamageScreenIndicator; // 0x310 (8)
	struct UPD3DIndicatorUI ThreeDIndicator; // 0x318 (8)
	struct UPDTargetScreenUI TargetScreen; // 0x320 (8)
	struct UPDGameTimeUI GameTime; // 0x328 (8)
	struct UPDIngameMapUI IngameMap; // 0x330 (8)
	struct UPDWorldMessageUI WorldMessage; // 0x338 (8)
	struct UPDBattleLogUI BattleLog; // 0x340 (8)
	struct UPDKillLogUI KillLog; // 0x348 (8)
	struct UPDPingLog PingLog; // 0x350 (8)
	struct UPDUnKnownMarket UnKnownMarket; // 0x358 (8)
	struct UPDTutorialQuestListUI TutorialQuest; // 0x360 (8)
	struct UPDSpectatorUI SpectatorUI; // 0x368 (8)
	struct UPDRingCommandUI RingCommand; // 0x370 (8)
	struct UPDMarkerGuide MarkerGuide; // 0x378 (8)
	struct UPDStateGaugeUI StateGauge; // 0x380 (8)
	struct UPDAgentLeptonInfo AgentLeptonInfo; // 0x388 (8)
	struct UPDPersonalMissionUI PersonalMissionUI; // 0x390 (8)
	struct UPDChattingUI Chatting; // 0x398 (8)
	struct UCanvasPanel CP_ChatLayer; // 0x3A0 (8)
	struct UCanvasPanel CP_CCTVLayer; // 0x3A8 (8)
	struct UCanvasPanel CP_IntroCinemaLayer; // 0x3B0 (8)
	struct UCanvasPanel CP_SubtitleLayer; // 0x3B8 (8)
	struct UPDIngameVideoUI IngameVideo; // 0x3C0 (8)
	struct UPDSubtitleUI SubtitleUI; // 0x3C8 (8)
	struct UCanvasPanel CP_EscMenu; // 0x3D0 (8)
	struct UPDEscMenuUI EscMenu; // 0x3D8 (8)
	struct UCanvasPanel CP_BreakIntoLayer; // 0x3E0 (8)
	struct UPDBreakIntoUI BreakInto; // 0x3E8 (8)
	struct UPDRoundWaitUI RoundWait; // 0x3F0 (8)
	struct UPDPlayerSettingUI PlayerSetting; // 0x3F8 (8)
	struct UScaleBox NoneScale_Inventory; // 0x400 (8)
	struct UScaleBox NoneScale_CrossHair; // 0x408 (8)
	struct UScaleBox NoneScale_StatusBoard; // 0x410 (8)
	struct UScaleBox NoneScale_IngameMap; // 0x418 (8)
	struct UScaleBox NoneScale_Replay; // 0x420 (8)
	struct UScaleBox NoneScale_PlayerSetting; // 0x428 (8)
	struct UScaleBox NoneScale_MarketGuide; // 0x430 (8)
	struct UScaleBox NoneScale_RingCommand; // 0x438 (8)
	struct UScaleBox NoneScale_AgentLeptonInfo; // 0x440 (8)
	struct UScaleBox NoneScale_RoundResult; // 0x448 (8)
	struct UScaleBox NoneScale_ReportPopup; // 0x450 (8)
	struct UScaleBox NoneScale_CCTV; // 0x458 (8)
	struct UScaleBox NoneScale_IntroCinema; // 0x460 (8)
	struct UScaleBox NoneScale_Menu; // 0x468 (8)
};

// Class ProjectD.PDBaseUI
class UPDBaseUI : public UPDUserWidget {

public:

	struct UCanvasPanel CP_SceneLayer; // 0x288 (8)
	struct UCanvasPanel CP_PopupLayer; // 0x290 (8)
	struct UCanvasPanel CP_GlobalPopupLayer; // 0x298 (8)
	struct UCanvasPanel CP_TopLayer; // 0x2A0 (8)
	struct UCanvasPanel CP_Blind; // 0x2A8 (8)
	struct UImage IMG_Blind; // 0x2B0 (8)
	struct UCanvasPanel CP_DevLayer; // 0x2B8 (8)
	struct UPDMatchingUI MatchingUI; // 0x2C0 (8)
	struct UPDOutGameTopMenu OutGameTopMenu; // 0x2C8 (8)
	struct UPDCustomRoomUI CustomRoom; // 0x2D0 (8)
	struct UPDChattingUI ChattingUI; // 0x2D8 (8)
	struct TMap<enum class EUIName, struct UClass*> UIClassMap; // 0x2E0 (80)
	struct TMap<enum class EUIName, struct UPDSceneBaseUI> SceneUIWidgetMap; // 0x330 (80)
	struct UPDSystemMessageUI SystemMessageUIWidget; // 0x380 (8)
	struct UPDSceneBaseUI MatchSceneUI; // 0x388 (8)
	struct TArray<struct UPDPopupBaseUI> PopupUIStack; // 0x398 (16)
	struct TArray<struct UPDPopupBaseUI> GlobalPopupUIStack; // 0x3A8 (16)
	struct UPDTextBlock Dev_Text; // 0x3B8 (8)
	struct UPDTextBlock Connect_State_Text; // 0x3C0 (8)
	struct UPDTextBlock TB_FPS; // 0x3C8 (8)
	struct UPDTextBlock TB_BuildInfo; // 0x3D0 (8)
	struct UPDTextBlock TB_ConnectInfo; // 0x3D8 (8)
	struct UPDTextBlock TB_MatchID; // 0x3E0 (8)
	struct UPDTextBlock TB_Ping; // 0x3E8 (8)
	struct UImage IMG_Connect; // 0x3F0 (8)
	struct UPDTextBlock TB_Graphics; // 0x3F8 (8)
};

// Class ProjectD.PDBattleLogModule
class UPDBattleLogModule : public UPDUserWidget {

public:

	struct UPDTextBlock TB_Log; // 0x288 (8)
	struct UBorder BD_Bg; // 0x290 (8)
};

// Class ProjectD.PDBattleLogUI
class UPDBattleLogUI : public UPDIngameModeWidget {

public:

	struct UVerticalBox VB_EventLog; // 0x298 (8)
	enum class EHorizontalAlignment LogHAlign; // 0x2A0 (1)
	struct FMargin LogPadding; // 0x2A4 (16)
	bool InvertToAdd; // 0x2B4 (1)
	int32_t MaxLogCount; // 0x2B8 (4)
	float DefaultDuration; // 0x2BC (4)
	bool AutoRemove; // 0x2C0 (1)
	struct UVerticalBox VB_WarningList; // 0x2C8 (8)
	struct UVerticalBox VB_FeedbackLog; // 0x2D0 (8)
	enum class EHorizontalAlignment FeedbackHAlign; // 0x2D8 (1)
	struct FMargin FeedbackPadding; // 0x2DC (16)
	int32_t MaxFeedbackCount; // 0x2EC (4)
	float DefaultFeedbackDuration; // 0x2F0 (4)
	bool bAutoRemoveFeedback; // 0x2F4 (1)
	bool bReverseToAddFeedback; // 0x2F5 (1)
	struct UPDNotificationAlert AlertWidget; // 0x2F8 (8)
};

// Class ProjectD.PDBreakableObject
class APDBreakableObject : public UActor {

public:

	struct UChildActorComponent SwitchActor; // 0x288 (8)
	struct USkeletalMeshComponent AnimMesh; // 0x290 (8)
	struct TArray<enum class EDamageType> EffectiveDamages; // 0x298 (16)
	int32_t StartHP; // 0x2A8 (4)
	struct FString Start_BaseSocket; // 0x2B0 (16)
	int32_t Start_BaseEffectID; // 0x2C0 (4)
	struct FString DestructSound; // 0x2C8 (16)
	float Middle_Time; // 0x2D8 (4)
	struct FString Middle_ResultSocket; // 0x2E0 (16)
	int32_t Middle_ResultEffectID; // 0x2F0 (4)
	float Middle_Damage; // 0x2F4 (4)
	float End_Time; // 0x2F8 (4)
	struct UStaticMeshComponent BaseMesh; // 0x300 (8)
	struct UStaticMeshComponent ResultMesh; // 0x308 (8)
	struct USphereComponent DamageArea; // 0x310 (8)
};

// Class ProjectD.PDBreakIntoPlayerItem
class UPDBreakIntoPlayerItem : public UPDUserWidget {

public:

	struct UImage IMG_PlayerPic; // 0x288 (8)
	struct UImage IMG_SlotBg_L; // 0x290 (8)
	struct UImage IMG_SlotBg_R; // 0x298 (8)
	struct UImage IMG_Divider; // 0x2A0 (8)
	struct UImage IMG_SlotOutline; // 0x2A8 (8)
	struct UPDTextBlock T_PlayerName; // 0x2B0 (8)
};

// Class ProjectD.PDBreakIntoUI
class UPDBreakIntoUI : public UPDIngameModeWidget {

public:

	struct UPDTextBlock TB_PlayTimeMin; // 0x290 (8)
	struct UPDTextBlock TB_PlayTimeSec; // 0x298 (8)
	struct UPDTextBlock TB_Round; // 0x2A0 (8)
	struct UPDGameMapModule GameMap; // 0x2A8 (8)
	struct UImage IMG_TeamBG_Ally; // 0x2B0 (8)
	struct UPDTextBlock TB_TeamName_Ally; // 0x2B8 (8)
	struct UImage IMG_TeamBG_Enemy; // 0x2C0 (8)
	struct UPDTextBlock TB_TeamName_Enemy; // 0x2C8 (8)
	struct UPDBreakIntoPlayerItem AllyPlayer_01; // 0x2D0 (8)
	struct UPDBreakIntoPlayerItem AllyPlayer_02; // 0x2D8 (8)
	struct UPDBreakIntoPlayerItem AllyPlayer_03; // 0x2E0 (8)
	struct UPDBreakIntoPlayerItem AllyPlayer_04; // 0x2E8 (8)
	struct UPDBreakIntoPlayerItem AllyPlayer_05; // 0x2F0 (8)
	struct UPDBreakIntoPlayerItem EnemyPlayer_01; // 0x2F8 (8)
	struct UPDBreakIntoPlayerItem EnemyPlayer_02; // 0x300 (8)
	struct UPDBreakIntoPlayerItem EnemyPlayer_03; // 0x308 (8)
	struct UPDBreakIntoPlayerItem EnemyPlayer_04; // 0x310 (8)
	struct UPDBreakIntoPlayerItem EnemyPlayer_05; // 0x318 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_2; // 0x320 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_3; // 0x328 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_4; // 0x330 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_5; // 0x338 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_6; // 0x340 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_7; // 0x348 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_8; // 0x350 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_9; // 0x358 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_10; // 0x360 (8)
	struct TArray<struct UPDStatusBoardRoundResultItem> RoundResultList; // 0x368 (16)
};

// Class ProjectD.PDBrickListItem
class UPDBrickListItem : public UPDUserWidget {

public:

	struct UImage IMG_Brick; // 0x290 (8)
	struct UPDTextBlock TB_Title; // 0x298 (8)
	struct UBorder BD_ItemOutline; // 0x2A0 (8)
	struct UBorder BD_ItemOverOutline; // 0x2A8 (8)
	struct UBorder BD_ItemSelOutline; // 0x2B0 (8)
};

// Class ProjectD.PDButton
class UPDButton : public UPDUserWidget {

public:

	struct UPDCustomButton Button; // 0x288 (8)
	struct UPDTextBlock Text; // 0x290 (8)
	struct UBorder BD_Outline; // 0x298 (8)
	struct UWidgetSwitcher WS_IMGState; // 0x2A0 (8)
	struct UImage IMG_Normal; // 0x2A8 (8)
	struct UImage IMG_Hover; // 0x2B0 (8)
	struct UImage IMG_Press; // 0x2B8 (8)
	struct UImage IMG_Disable; // 0x2C0 (8)
	struct UImage IMG_Ani1; // 0x2C8 (8)
	struct UImage IMG_Ani2; // 0x2D0 (8)
	struct TArray<struct UImage> AniImages; // 0x2D8 (16)
	struct FButtonStyle ButtonStyle; // 0x2E8 (632)
	struct FText InText; // 0x560 (24)
	struct FSlateFontInfo Font; // 0x578 (80)
	struct FMargin TextMargin; // 0x5C8 (16)
	enum class ETextJustify TextJustfication; // 0x5D8 (1)
	struct FString NormalAniName; // 0x5E0 (16)
	bool IsLoopNormalAni; // 0x5F0 (1)
	struct FString HoverAniName; // 0x5F8 (16)
	bool IsLoopHoverAni; // 0x608 (1)
	struct TArray<struct FSlateBrush> AniImageBrushs; // 0x610 (16)
	struct UAkAudioEvent HoverSound; // 0x620 (8)
	struct UAkAudioEvent ClickSound; // 0x628 (8)
	struct FSlateBrush ButtonNormalStyle; // 0x638 (136)
	struct FSlateBrush ButtonHoverStyle; // 0x6C0 (136)
	struct FSlateBrush ButtonPressStyle; // 0x748 (136)
	struct FSlateBrush ButtonDisableStyle; // 0x7D0 (136)
	bool UseNormalOutline; // 0x858 (1)
	bool UseHoverOutline; // 0x859 (1)
	bool UseClickOutline; // 0x85A (1)
	bool UseDisableOutline; // 0x85B (1)
	struct FPDButtonOutLine NormalOutLineStyle; // 0x860 (200)
	struct FPDButtonOutLine HoverOutLineStyle; // 0x928 (200)
	struct FPDButtonOutLine ClickOutLineStyle; // 0x9F0 (200)
	struct FPDButtonOutLine DisableOutLineStyle; // 0xAB8 (200)
	struct FSlateColor NormalTextColor; // 0xB80 (40)
	struct FSlateColor HoverTextColor; // 0xBA8 (40)
	struct FSlateColor PressTextColor; // 0xBD0 (40)
	struct FSlateColor DisableTextColor; // 0xBF8 (40)

	void OnUnHovered(); // Function ProjectD.PDButton.OnUnHovered(Native|Public) // <VeiledExperts-Win64-Shipping.exe+0x180DB60>
	void OnReleased(); // Function ProjectD.PDButton.OnReleased(Native|Public) // <VeiledExperts-Win64-Shipping.exe+0x180DB40>
	void OnHovered(); // Function ProjectD.PDButton.OnHovered(Native|Public) // <VeiledExperts-Win64-Shipping.exe+0x180DB20>
	void OnClicked(); // Function ProjectD.PDButton.OnClicked(Native|Public) // <VeiledExperts-Win64-Shipping.exe+0x180DB00>
};

// Class ProjectD.PDCamSpline
class APDCamSpline : public UActor {

public:

	struct UPDSplineComponent SplineComp; // 0x220 (8)
	int32_t SplineID; // 0x228 (4)
	int32_t FOVStart; // 0x22C (4)
	int32_t FOVEnd; // 0x230 (4)
	bool ApplyRotation; // 0x234 (1)
	struct FRotator TargetRotation; // 0x238 (12)
	struct UActor LookAtTarget; // 0x248 (8)
};

// Class ProjectD.PDCCTVUI
class UPDCCTVUI : public UPDUserWidget {

public:

	struct UPDTextBlock T_Desc_01; // 0x288 (8)
	struct UPDTextBlock T_Desc_02; // 0x290 (8)
	struct UPDTextBlock T_Desc_03; // 0x298 (8)
	struct UPDTextBlock T_Desc_04; // 0x2A0 (8)
};

// Class ProjectD.PDChattingUI
class UPDChattingUI : public UPDUserWidget {

public:

	struct UImage IMG_ChatBg; // 0x288 (8)
	struct UScrollBox SB_Chatting; // 0x290 (8)
	struct UBorder BD_BlockArea; // 0x298 (8)
	struct UCanvasPanel CP_ChatArea; // 0x2A0 (8)
	struct UCanvasPanel CP_InputType; // 0x2A8 (8)
	struct UCanvasPanel CP_ChatImg; // 0x2B0 (8)
	struct URichTextBlock RTB_ChatType; // 0x2B8 (8)
	struct UEditableText ET_Chatting; // 0x2C0 (8)
	struct URichTextBlock RTB_CopyTextBlock; // 0x2C8 (8)
	struct UCanvasPanel CP_ChattingHelp; // 0x2D0 (8)
	struct UPDButton Btn_WhisperChat; // 0x2D8 (8)
	struct UPDButton Btn_ReplyChat; // 0x2E0 (8)
	struct UPDButton Btn_TeamChat; // 0x2E8 (8)
	struct UPDButton Btn_SquadChat; // 0x2F0 (8)
	struct UPDButton Btn_ClanChat; // 0x2F8 (8)
	struct UPDButton Btn_Hide; // 0x300 (8)
	struct UPDCustomSlider SD_Slider; // 0x308 (8)

	void SendChatMessage(struct FText& Text, enum class ETextCommit CommitMethod); // Function ProjectD.PDChattingUI.SendChatMessage(Final|Native|Public|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1812A90>
	void OnValueChanged(float InValue); // Function ProjectD.PDChattingUI.OnValueChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1812260>
	void OnClickWhisperChatBtn(); // Function ProjectD.PDChattingUI.OnClickWhisperChatBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1811880>
	void OnClickTeamChatBtn(); // Function ProjectD.PDChattingUI.OnClickTeamChatBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1811880>
	void OnClickSquadChatBtn(); // Function ProjectD.PDChattingUI.OnClickSquadChatBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1811880>
	void OnClickReplyChatBtn(); // Function ProjectD.PDChattingUI.OnClickReplyChatBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1811880>
	void OnClickHideBtn(); // Function ProjectD.PDChattingUI.OnClickHideBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1811880>
	void OnClickClanChatBtn(); // Function ProjectD.PDChattingUI.OnClickClanChatBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1811880>
	void ChangeText(struct FText& InText); // Function ProjectD.PDChattingUI.ChangeText(Final|Native|Public|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1810D10>
};

// Class ProjectD.PDCheckBox
class UPDCheckBox : public UPDUserWidget {

public:

	struct UCheckBox CheckBox; // 0x288 (8)
	struct UAkAudioEvent HoverSound; // 0x290 (8)
};

// Class ProjectD.PDCheerMarkFx
class UPDCheerMarkFx : public UPDUserWidget {

public:

	struct UWidgetSwitcher WS_Cheer; // 0x288 (8)
};

// Class ProjectD.PDCircleProgress
class UPDCircleProgress : public UPDUserWidget {

public:

	struct UImage Img_Bg; // 0x288 (8)
	struct UImage IMG_Gauge; // 0x290 (8)
	struct UImage IMG_Glow; // 0x298 (8)
	struct Object BGTexture; // 0x2A0 (8)
	struct FLinearColor BGColor; // 0x2A8 (16)
	struct Object GaugeTexture; // 0x2B8 (8)
	struct FLinearColor GaugeColor; // 0x2C0 (16)
	bool UseGlow; // 0x2D0 (1)
	struct Object GlowTexture; // 0x2D8 (8)
	struct FLinearColor GlowColor; // 0x2E0 (16)
	float DefaultPercent; // 0x2F0 (4)
};

// Class ProjectD.PDCircleProgressModule
class UPDCircleProgressModule : public UPDUserWidget {

public:

	struct UImage IMG_CircleProgress; // 0x288 (8)
	struct UPDTextBlock TB_ProgressTime; // 0x290 (8)
	bool IsInverse; // 0x298 (1)
	bool IsClockWise; // 0x299 (1)
	bool IsDivide; // 0x29A (1)
	int32_t DivideNum; // 0x29C (4)
	float DivideAntiAliasing; // 0x2A0 (4)
	float DivideGapSize; // 0x2A4 (4)
	float StartPos; // 0x2A8 (4)
	float CompleteRange; // 0x2AC (4)
	float AntiAliasing; // 0x2B0 (4)
	float CircleSize; // 0x2B4 (4)
	bool IsColorTexture; // 0x2B8 (1)
	struct UTexture ColorTexture; // 0x2C0 (8)
	bool IsMaskTexture; // 0x2C8 (1)
	struct UTexture MaskTexture; // 0x2D0 (8)
	struct FDelegate GetProgressPerDelegate; // 0x2E8 (16)

	void OnSynchronizeProperties(); // Function ProjectD.PDCircleProgressModule.OnSynchronizeProperties(Native|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1811A40>
};

// Class ProjectD.PDClanApplicantListItemUI
class UPDClanApplicantListItemUI : public UPDUserWidget {

public:

	struct UPDTextBlock TB_Nickname; // 0x290 (8)
	struct UPDTextBlock TB_PassedTime; // 0x298 (8)
	struct UCanvasPanel CP_Normal; // 0x2A0 (8)
	struct UPDButton BTN_Accept; // 0x2A8 (8)
	struct UPDButton BTN_Decline; // 0x2B0 (8)
	struct UCanvasPanel CP_Wait; // 0x2B8 (8)
	struct UPDButton BTN_CancelReqJoin; // 0x2C0 (8)
	struct UBorder BD_Outline; // 0x2C8 (8)

	void OnClickDecline(); // Function ProjectD.PDClanApplicantListItemUI.OnClickDecline(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1811800>
	void OnClickCancelReqJoin(); // Function ProjectD.PDClanApplicantListItemUI.OnClickCancelReqJoin(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1811800>
	void OnClickAccept(); // Function ProjectD.PDClanApplicantListItemUI.OnClickAccept(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18117C0>
};

// Class ProjectD.PDClanCreateUI
class UPDClanCreateUI : public UPDSceneBaseUI {

public:

	struct UEditableTextBox ET_ClanName; // 0x288 (8)
	struct UPDButton BTN_CheckInUse; // 0x290 (8)
	struct UPDTextBlock T_ClanName_Msg; // 0x298 (8)
	struct UPDTabButtonGroup TabGroupMembership; // 0x2A0 (8)
	struct UPDTabButton TAB_FreeJoin; // 0x2A8 (8)
	struct UPDTabButton TAB_SignUp; // 0x2B0 (8)
	struct UPDTabButtonGroup TabGroupClanStyle; // 0x2B8 (8)
	struct UPDTabButton TAB_Social; // 0x2C0 (8)
	struct UPDTabButton TAB_Normal; // 0x2C8 (8)
	struct UPDTabButton TAB_Competition; // 0x2D0 (8)
	struct UEditableTextBox ET_ClanTagInput1; // 0x2D8 (8)
	struct UEditableTextBox ET_ClanTagInput2; // 0x2E0 (8)
	struct UEditableTextBox ET_ClanTagInput3; // 0x2E8 (8)
	struct UPDButton BTN_CreateClan; // 0x2F0 (8)
	struct UPDTextBlock T_CreateClan_Msg; // 0x2F8 (8)
	struct UImage IMG_ClanMarkBG; // 0x300 (8)
	struct UImage IMG_ClanMarkFG; // 0x308 (8)
	struct UPDButton BTN_RandomMark; // 0x310 (8)
	struct UMultiLineEditableText MET_ClanDesc; // 0x318 (8)

	void OnTextChangedClanTag3(struct FText& InText); // Function ProjectD.PDClanCreateUI.OnTextChangedClanTag3(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1812080>
	void OnTextChangedClanTag2(struct FText& InText); // Function ProjectD.PDClanCreateUI.OnTextChangedClanTag2(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1811EC0>
	void OnTextChangedClanTag1(struct FText& InText); // Function ProjectD.PDClanCreateUI.OnTextChangedClanTag1(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1811D00>
	void OnTextChangedClanDesc(struct FText& Text); // Function ProjectD.PDClanCreateUI.OnTextChangedClanDesc(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1811A60>
	void OnCreateConfirm(); // Function ProjectD.PDClanCreateUI.OnCreateConfirm(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18119E0>
	void OnClickSocialTab(); // Function ProjectD.PDClanCreateUI.OnClickSocialTab(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnClickSingUpTab(); // Function ProjectD.PDClanCreateUI.OnClickSingUpTab(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnClickRandomMark(); // Function ProjectD.PDClanCreateUI.OnClickRandomMark(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1811980>
	void OnClickNormalTab(); // Function ProjectD.PDClanCreateUI.OnClickNormalTab(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnClickFreeJoinTab(); // Function ProjectD.PDClanCreateUI.OnClickFreeJoinTab(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnClickCreateClan(); // Function ProjectD.PDClanCreateUI.OnClickCreateClan(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18118E0>
	void OnClickCompetitionTab(); // Function ProjectD.PDClanCreateUI.OnClickCompetitionTab(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnClickCheckInUse(); // Function ProjectD.PDClanCreateUI.OnClickCheckInUse(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1811840>
	void OnClanNameTextChanged(struct FText& InText); // Function ProjectD.PDClanCreateUI.OnClanNameTextChanged(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x18116E0>
};

// Class ProjectD.PDOKPopupUI
class UPDOKPopupUI : public UPDPopupBaseUI {

public:

	struct UPDTextBlock Desc; // 0x2B8 (8)
	struct UPDButton OKBtn; // 0x2C0 (8)
};

// Class ProjectD.PDClanInfoPopupUI
class UPDClanInfoPopupUI : public UPDOKPopupUI {

public:

	struct UPDTextBlock T_ClanName; // 0x2D0 (8)
	struct UPDTextBlock T_Public; // 0x2D8 (8)
	struct UWidgetSwitcher WS_ClanTrend; // 0x2E0 (8)
	struct UPDTextBlock T_ClanTag; // 0x2E8 (8)
	struct UImage IMG_ClanMarkBG; // 0x2F0 (8)
	struct UImage IMG_ClanMarkFG; // 0x2F8 (8)
	struct UPDTextBlock T_ClanDesc; // 0x300 (8)
	struct UMultiLineEditableText ET_ClanDesc; // 0x308 (8)
	struct UPDTextBlock T_ClanMaster; // 0x310 (8)
	struct UPDTextBlock T_ClanMemberNum; // 0x318 (8)
	struct UPDTextBlock T_ClanCreateDate; // 0x320 (8)
};

// Class ProjectD.PDClanInfoUI
class UPDClanInfoUI : public UPDSceneBaseUI {

public:

	struct UPDButton BTN_ShowClanInfo; // 0x288 (8)
	struct UWidgetSwitcher WS_Info; // 0x290 (8)
	struct UPDTextBlock TB_ClanMsg; // 0x298 (8)
	struct UPDTextBlock T_ClanName; // 0x2A0 (8)
	struct UImage IMG_Info_Hover; // 0x2A8 (8)
	struct UCanvasPanel CP_None; // 0x2B0 (8)
	struct UCanvasPanel CP_Info; // 0x2B8 (8)
	struct UCanvasPanel CP_Member; // 0x2C0 (8)
	struct UCanvasPanel CP_Applicant; // 0x2C8 (8)
	struct UCanvasPanel CP_Manage; // 0x2D0 (8)
	struct UPDButton BTN_Leave; // 0x2D8 (8)
	struct UPDTabButtonGroup TabGroupMenu; // 0x2E0 (8)
	struct UPDTabButton TAB_Member; // 0x2E8 (8)
	struct UPDTabButtonGroup TabGroupMenu_Right; // 0x2F0 (8)
	struct UPDTabButton TAB_Applicant; // 0x2F8 (8)
	struct UPDTabButton TAB_ClanManage; // 0x300 (8)
	struct UPDTabButton TAB_BreakClan; // 0x308 (8)
	struct UListView LV_MemberList; // 0x310 (8)
	struct UListView LV_ApplicantList; // 0x318 (8)
	struct UPDButton BTN_Create; // 0x320 (8)
	struct UPDButton BTN_Search; // 0x328 (8)
	struct UPDButton BTN_ForceClanBreak; // 0x330 (8)
	struct UEditableTextBox ET_ClanName; // 0x338 (8)
	struct UPDButton BTN_CheckInUse; // 0x340 (8)
	struct UPDTabButtonGroup TabGroupMembership; // 0x348 (8)
	struct UPDTabButton TAB_FreeJoin; // 0x350 (8)
	struct UPDTabButton TAB_SignUp; // 0x358 (8)
	struct UPDTabButtonGroup TabGroupClanStyle; // 0x360 (8)
	struct UPDTabButton TAB_Social; // 0x368 (8)
	struct UPDTabButton TAB_Normal; // 0x370 (8)
	struct UPDTabButton TAB_Competition; // 0x378 (8)
	struct UEditableTextBox ET_ClanTagInput1; // 0x380 (8)
	struct UEditableTextBox ET_ClanTagInput2; // 0x388 (8)
	struct UEditableTextBox ET_ClanTagInput3; // 0x390 (8)
	struct UPDButton BTN_ManageChange; // 0x398 (8)
	struct UImage IMG_ClanMarkBG; // 0x3A0 (8)
	struct UImage IMG_ClanMarkFG; // 0x3A8 (8)
	struct UPDButton BTN_ChangeMark; // 0x3B0 (8)
	struct UMultiLineEditableText MET_ClanDesc; // 0x3B8 (8)

	void OnUnhoveredShowClanInfo(); // Function ProjectD.PDClanInfoUI.OnUnhoveredShowClanInfo(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1812240>
	void OnTextChangedClanTag3(struct FText& InText); // Function ProjectD.PDClanInfoUI.OnTextChangedClanTag3(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1812160>
	void OnTextChangedClanTag2(struct FText& InText); // Function ProjectD.PDClanInfoUI.OnTextChangedClanTag2(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1811FA0>
	void OnTextChangedClanTag1(struct FText& InText); // Function ProjectD.PDClanInfoUI.OnTextChangedClanTag1(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1811DE0>
	void OnTextChangedClanName(struct FText& Text); // Function ProjectD.PDClanInfoUI.OnTextChangedClanName(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1811C20>
	void OnTextChangedClanDesc(struct FText& Text); // Function ProjectD.PDClanInfoUI.OnTextChangedClanDesc(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1811B40>
	void OnLeaveConfirm(); // Function ProjectD.PDClanInfoUI.OnLeaveConfirm(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1811A20>
	void OnHoveredShowClanInfo(); // Function ProjectD.PDClanInfoUI.OnHoveredShowClanInfo(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1811A00>
	void OnForceClanBreakButton(); // Function ProjectD.PDClanInfoUI.OnForceClanBreakButton(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18116C0>
	void OnClickSocialTab(); // Function ProjectD.PDClanInfoUI.OnClickSocialTab(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnClickSingUpTab(); // Function ProjectD.PDClanInfoUI.OnClickSingUpTab(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnClickShowClanInfo(); // Function ProjectD.PDClanInfoUI.OnClickShowClanInfo(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18119C0>
	void OnClickSearch(); // Function ProjectD.PDClanInfoUI.OnClickSearch(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18119A0>
	void OnClickNormalTab(); // Function ProjectD.PDClanInfoUI.OnClickNormalTab(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnClickMemberTab(); // Function ProjectD.PDClanInfoUI.OnClickMemberTab(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1811960>
	void OnClickManageChange(); // Function ProjectD.PDClanInfoUI.OnClickManageChange(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1811940>
	void OnClickLeave(); // Function ProjectD.PDClanInfoUI.OnClickLeave(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1811920>
	void OnClickFreeJoinTab(); // Function ProjectD.PDClanInfoUI.OnClickFreeJoinTab(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnClickDisband(); // Function ProjectD.PDClanInfoUI.OnClickDisband(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1811900>
	void OnClickCreate(); // Function ProjectD.PDClanInfoUI.OnClickCreate(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18118C0>
	void OnClickCompetitionTab(); // Function ProjectD.PDClanInfoUI.OnClickCompetitionTab(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnClickClanManageTab(); // Function ProjectD.PDClanInfoUI.OnClickClanManageTab(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18118A0>
	void OnClickCheckInUse(); // Function ProjectD.PDClanInfoUI.OnClickCheckInUse(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1811860>
	void OnClickChangeMark(); // Function ProjectD.PDClanInfoUI.OnClickChangeMark(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1811820>
	void OnClickApplicantTab(); // Function ProjectD.PDClanInfoUI.OnClickApplicantTab(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18117E0>
	void OnBreakClanConfirmButton(); // Function ProjectD.PDClanInfoUI.OnBreakClanConfirmButton(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18116C0>
	void OnBreakClanCancelButton(); // Function ProjectD.PDClanInfoUI.OnBreakClanCancelButton(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18116A0>
	void OnBreakClanButton(); // Function ProjectD.PDClanInfoUI.OnBreakClanButton(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1811680>
};

// Class ProjectD.PDClanListUI
class UPDClanListUI : public UPDSceneBaseUI {

public:

	struct UPDComboBox CBO_ClanStyle2; // 0x288 (8)
	struct UListView LV_ClanList; // 0x290 (8)
	struct UEditableTextBox ET_Search; // 0x298 (8)
	struct UPDButton BTN_Search; // 0x2A0 (8)
	struct UCanvasPanel CP_ClanListContext; // 0x2A8 (8)
	struct UPDButton BTN_ClanInfo; // 0x2B0 (8)

	void OnEnterSearch(struct FText& Text, enum class ETextCommit CommitMethod); // Function ProjectD.PDClanListUI.OnEnterSearch(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1816D90>
	void OnClickSeach(); // Function ProjectD.PDClanListUI.OnClickSeach(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816AD0>
	void OnClickClanInfo(); // Function ProjectD.PDClanListUI.OnClickClanInfo(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816870>
	void OnClanStyleSelectionChanged(struct FString SelectedItem, enum class ESelectInfo SelectionType); // Function ProjectD.PDClanListUI.OnClanStyleSelectionChanged(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816700>
	void OnChangeSearchText(struct FText& InText); // Function ProjectD.PDClanListUI.OnChangeSearchText(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1816600>
};

// Class ProjectD.PDClanMainUI
class UPDClanMainUI : public UPDSceneBaseUI {

public:

	struct UPDButton Btn_GotoLobby; // 0x288 (8)
	struct UPDTabButtonGroup MenuTabGroup; // 0x290 (8)
	struct UPDTabButton TAB_ClanInfo; // 0x298 (8)
	struct UPDTabButton TAB_ClanList; // 0x2A0 (8)
	struct UPDTabButton TAB_ClanCreate; // 0x2A8 (8)
	struct TMap<char, struct UPDTabButton> ClanTabs; // 0x2B0 (80)

	void OnClickTabClanList(); // Function ProjectD.PDClanMainUI.OnClickTabClanList(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816BB0>
	void OnClickTabClanInfo(); // Function ProjectD.PDClanMainUI.OnClickTabClanInfo(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816B90>
	void OnClickTabClanCreate(); // Function ProjectD.PDClanMainUI.OnClickTabClanCreate(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816B70>
	void OnClickBtnGotoLobby(); // Function ProjectD.PDClanMainUI.OnClickBtnGotoLobby(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816850>
};

// Class ProjectD.PDClanMemberListItemUI
class UPDClanMemberListItemUI : public UPDUserWidget {

public:

	struct UPDTextBlock TB_Nickname; // 0x290 (8)
	struct UImage IMG_Agent; // 0x298 (8)
	struct UImage IMG_Master; // 0x2A0 (8)
	struct UPDTextBlock TB_ConnectState; // 0x2A8 (8)
	struct UPDButton BTN_Kick; // 0x2B0 (8)
	struct UBorder BD_Outline; // 0x2B8 (8)

	void OnKickConfirm(); // Function ProjectD.PDClanMemberListItemUI.OnKickConfirm(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1817000>
	void OnClickKick(); // Function ProjectD.PDClanMemberListItemUI.OnClickKick(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18169D0>
};

// Class ProjectD.PDClanOtherListItemUI
class UPDClanOtherListItemUI : public UPDUserWidget {

public:

	struct UImage IMG_ClanMarkBG; // 0x290 (8)
	struct UImage IMG_ClanMarkFG; // 0x298 (8)
	struct UPDTextBlock TB_ClanName; // 0x2A0 (8)
	struct UPDTextBlock TB_MemberCount; // 0x2A8 (8)
	struct UImage IMG_ActivityIndex; // 0x2B0 (8)
	struct UWidgetSwitcher WS_ClanTrend; // 0x2B8 (8)
	struct UPDTextBlock TB_ClanTag; // 0x2C0 (8)
	struct UWidgetSwitcher WS_Membership_Case; // 0x2C8 (8)
	struct UPDImageButton Btn_Bg; // 0x2D0 (8)
	struct UPDButton BTN_Join; // 0x2D8 (8)
	struct UPDButton BTN_Full; // 0x2E0 (8)
	struct UBorder BD_Outline; // 0x2E8 (8)

	void OnDblClicked(); // Function ProjectD.PDClanOtherListItemUI.OnDblClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816D70>
	void OnClickJoin(); // Function ProjectD.PDClanOtherListItemUI.OnClickJoin(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18169B0>
};

// Class ProjectD.PDCommPage
class UPDCommPage : public UPDUserWidget {

public:

	struct UTreeView TV_Display; // 0x288 (8)
};

// Class ProjectD.PDClimbNodeActor
class APDClimbNodeActor : public UActor {

public:

	struct USphereComponent Sphere; // 0x220 (8)
	struct UArrowComponent Arrow; // 0x228 (8)
	struct FNeighborInfo NeighborInfo; // 0x230 (64)
};

// Class ProjectD.PDClimbableActor
class APDClimbableActor : public UActor {

public:

	struct UBoxComponent Box; // 0x230 (8)
	bool bDataOverridden; // 0x250 (1)
	bool bBidirectional; // 0x251 (1)
	struct APDClimbableActor OppositeDirectionActor; // 0x258 (8)
	struct FNeighborInfoArray NeighborInfos; // 0x260 (72)
	struct TArray<struct APDClimbableActor> IgnoreActorsOnBuild; // 0x2A8 (16)
};

// Class ProjectD.PDCoinInfoListItemUI
class UPDCoinInfoListItemUI : public UPDUserWidget {

public:

	struct UCanvasPanel CP_Coin; // 0x288 (8)
	struct UPDTextBlock TB_HoldingCoin; // 0x290 (8)
	struct UPDTextBlock TB_GetCoin; // 0x298 (8)
	struct UPDTextBlock TB_GetCoin_Back; // 0x2A0 (8)
	float TotalShowTime; // 0x2A8 (4)
};

// Class ProjectD.PDCoinInfoUI
class UPDCoinInfoUI : public UPDIngameModeWidget {

public:

	struct UCanvasPanel CP_RoundCoinBoard; // 0x298 (8)
	struct UVerticalBox VB_CoinList; // 0x2A0 (8)
	struct UPDTextBlock TB_TotalCoin; // 0x2A8 (8)
	float ShowDuration; // 0x2B0 (4)
	int32_t MaxListNum; // 0x2B4 (4)
};

// Class ProjectD.PDComboBox
class UPDComboBox : public UPDUserWidget {

public:

	struct UComboBoxString ComboBox; // 0x288 (8)
	struct FSlateFontInfo ComboFontInfo; // 0x290 (80)
	struct FMargin ComboTextMargin; // 0x2E0 (16)
	struct FComboBoxStyle ComboBoxWidgetStyle; // 0x2F0 (1008)
	struct FTableRowStyle ComboBoxItemStyle; // 0x6E0 (1992)
	float ItemHeight; // 0xEA8 (4)
	struct TMap<struct FString, struct USizeBox> ItemBlocks; // 0xEB0 (80)
	struct TMap<struct FString, struct UPDTextBlock> ItemTexts; // 0xF00 (80)

	struct UWidget OnComboBoxGenerateWidget(struct FString Item); // Function ProjectD.PDComboBox.OnComboBoxGenerateWidget(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816C50>
};

// Class ProjectD.PDCommunityPopupUI
class UPDCommunityPopupUI : public UPDPopupBaseUI {

public:

	struct UPDTextBlock T_CCU; // 0x2B8 (8)
	struct UPDImageButton IMG_Btn_Bg; // 0x2C0 (8)
	struct UPDTabButton Btn_FriendTab; // 0x2C8 (8)
	struct UPDTabButton Btn_ClanTab; // 0x2D0 (8)
	struct UPDTabButton Btn_FriendAddTab; // 0x2D8 (8)
	struct UPDTabButtonGroup TabGroup; // 0x2E0 (8)
	struct UPDButton Btn_FriendAdd; // 0x2E8 (8)
	struct UPDButton Btn_FriendRemove; // 0x2F0 (8)
	struct UPDButton Btn_FavoriteAdd; // 0x2F8 (8)
	struct UPDButton Btn_UnFavorite; // 0x300 (8)
	struct UPDButton Btn_PartyInvite; // 0x308 (8)
	struct UPDButton Btn_Whisper; // 0x310 (8)
	struct UPDButton Btn_CustomInvite; // 0x318 (8)
	struct UPDButton BTN_ClanInfo; // 0x320 (8)
	struct UPDButton Btn_WIC; // 0x328 (8)
	struct UPDButton Btn_Close; // 0x330 (8)
	struct UCanvasPanel CP_ContextMenu; // 0x338 (8)
	struct UWidgetSwitcher PageSwitcher; // 0x340 (8)
	struct UPDFriendPage FriendPage; // 0x348 (8)
	struct UPDClanPage ClanPage; // 0x350 (8)
	struct UPDFriendAddPage FriendAddPage; // 0x358 (8)
	struct UPDFindPartyPageUI FindPartyPage; // 0x360 (8)
	struct UPDButton Btn_FindParty; // 0x368 (8)
	struct UCanvasPanel CP_ToolTip; // 0x370 (8)
	struct UPDTextBlock TB_DataName; // 0x378 (8)
	struct UPDTextBlock TB_DataValue; // 0x380 (8)
	struct UCanvasPanel CP_MannerToolTip; // 0x388 (8)
	struct UPDTextBlock TB_PointLevel; // 0x390 (8)
	struct UCanvasPanel CP_FindPartyMannerToolTip; // 0x398 (8)
	struct UPDTextBlock TB_FindPartyPointLevel; // 0x3A0 (8)

	void OnWICClicked(); // Function ProjectD.PDCommunityPopupUI.OnWICClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1817060>
	void OnWhisperClicked(); // Function ProjectD.PDCommunityPopupUI.OnWhisperClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1817080>
	void OnUnFavoriteClicked(); // Function ProjectD.PDCommunityPopupUI.OnUnFavoriteClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1817040>
	void OnPartyInviteClicked(); // Function ProjectD.PDCommunityPopupUI.OnPartyInviteClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1817020>
	void OnFriendTabClicked(); // Function ProjectD.PDCommunityPopupUI.OnFriendTabClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816F60>
	void OnFriendRemoveClicked(); // Function ProjectD.PDCommunityPopupUI.OnFriendRemoveClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816F40>
	void OnFriendAddTabClicked(); // Function ProjectD.PDCommunityPopupUI.OnFriendAddTabClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816F20>
	void OnFriendAddClicked(); // Function ProjectD.PDCommunityPopupUI.OnFriendAddClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816F00>
	void OnFindPartyClicked(); // Function ProjectD.PDCommunityPopupUI.OnFindPartyClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816EE0>
	void OnFavoriteAddClicked(); // Function ProjectD.PDCommunityPopupUI.OnFavoriteAddClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816EC0>
	void OnCustomInviteClicked(); // Function ProjectD.PDCommunityPopupUI.OnCustomInviteClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816D50>
	void OnClanTabClicked(); // Function ProjectD.PDCommunityPopupUI.OnClanTabClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816830>
	void OnClanInfoClicked(); // Function ProjectD.PDCommunityPopupUI.OnClanInfoClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18166E0>
};

// Class ProjectD.PDOptionUIBase
class UPDOptionUIBase : public UPDUserWidget {

public:

	struct UPDTabButtonGroup MiddleOptionTabBtnGroup; // 0x288 (8)
	struct FSlateFontInfo CategoryFont; // 0x290 (80)
	struct TMap<struct FString, struct UPDOptionContent> MapOptionContents; // 0x2E0 (80)
};

// Class ProjectD.PDControlOptionUI
class UPDControlOptionUI : public UPDOptionUIBase {

public:

	struct UPDTabButton MoveNActionSettingBtn; // 0x338 (8)
	struct UPDTabButton ETCActionSettingBtn; // 0x340 (8)
	struct UScrollBox SB_Controls; // 0x348 (8)

	void OnInputKeySelected(struct UPDOptionContent Content); // Function ProjectD.PDControlOptionUI.OnInputKeySelected(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816F80>
	void OnClickZoom2ToggleButton(); // Function ProjectD.PDControlOptionUI.OnClickZoom2ToggleButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816C30>
	void OnClickZoom2DefaultButton(); // Function ProjectD.PDControlOptionUI.OnClickZoom2DefaultButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816C10>
	void OnClickZoom1ToggleButton(); // Function ProjectD.PDControlOptionUI.OnClickZoom1ToggleButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816BF0>
	void OnClickZoom1DefaultButton(); // Function ProjectD.PDControlOptionUI.OnClickZoom1DefaultButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816BD0>
	void OnClickShootingRightButton(); // Function ProjectD.PDControlOptionUI.OnClickShootingRightButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816B50>
	void OnClickShootingLeftButton(); // Function ProjectD.PDControlOptionUI.OnClickShootingLeftButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816B30>
	void OnClickSetToggleButton(); // Function ProjectD.PDControlOptionUI.OnClickSetToggleButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816B10>
	void OnClickSetDefaultButton(); // Function ProjectD.PDControlOptionUI.OnClickSetDefaultButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816AF0>
	void OnClickScoreBoardToggleButton(); // Function ProjectD.PDControlOptionUI.OnClickScoreBoardToggleButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816AB0>
	void OnClickScoreBoardHoldeButton(); // Function ProjectD.PDControlOptionUI.OnClickScoreBoardHoldeButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816A90>
	void OnClickScope2ToggleButton(); // Function ProjectD.PDControlOptionUI.OnClickScope2ToggleButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816A70>
	void OnClickScope2DefaultButton(); // Function ProjectD.PDControlOptionUI.OnClickScope2DefaultButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816A50>
	void OnClickMoveNActionSettingButton(); // Function ProjectD.PDControlOptionUI.OnClickMoveNActionSettingButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816A30>
	void OnClickLeanToggleButton(); // Function ProjectD.PDControlOptionUI.OnClickLeanToggleButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816A10>
	void OnClickLeanHoldButton(); // Function ProjectD.PDControlOptionUI.OnClickLeanHoldButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18169F0>
	void OnClickIngameMapSizeToggleButton(); // Function ProjectD.PDControlOptionUI.OnClickIngameMapSizeToggleButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816990>
	void OnClickIngameMapSizeHoldeButton(); // Function ProjectD.PDControlOptionUI.OnClickIngameMapSizeHoldeButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816970>
	void OnClickETCActionSettingButton(); // Function ProjectD.PDControlOptionUI.OnClickETCActionSettingButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816910>
	void OnClickEnableWeaponChange2Button(); // Function ProjectD.PDControlOptionUI.OnClickEnableWeaponChange2Button(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816950>
	void OnClickEnableWeaponChange1Button(); // Function ProjectD.PDControlOptionUI.OnClickEnableWeaponChange1Button(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816930>
	void OnClickDisableWeaponChange2Button(); // Function ProjectD.PDControlOptionUI.OnClickDisableWeaponChange2Button(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18168F0>
	void OnClickDisableWeaponChange1Button(); // Function ProjectD.PDControlOptionUI.OnClickDisableWeaponChange1Button(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18168D0>
	void OnClickCrouchToggleButton(); // Function ProjectD.PDControlOptionUI.OnClickCrouchToggleButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18168B0>
	void OnClickCrouchHoldButton(); // Function ProjectD.PDControlOptionUI.OnClickCrouchHoldButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816890>
	void OnChangePing1DblClickType(struct FString Item, enum class ESelectInfo SelType); // Function ProjectD.PDControlOptionUI.OnChangePing1DblClickType(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18164D0>
	void OnChangePing1ClickType(struct FString Item, enum class ESelectInfo SelType); // Function ProjectD.PDControlOptionUI.OnChangePing1ClickType(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18163A0>
	void OnAutoReloadEnabled(); // Function ProjectD.PDControlOptionUI.OnAutoReloadEnabled(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816380>
	void OnAutoReloadDisabled(); // Function ProjectD.PDControlOptionUI.OnAutoReloadDisabled(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816360>
};

// Class ProjectD.PDCrossHairUI
class UPDCrossHairUI : public UPDIngameModeWidget {

public:

	struct UWidgetSwitcher WS_FireIndicator; // 0x290 (8)
	struct UPanelWidget CP_Aim; // 0x298 (8)
	struct UPanelWidget CP_Aim_Offset; // 0x2A0 (8)
	struct UPanelWidget CP_Aim_Crosshair; // 0x2A8 (8)
	struct UPanelWidget CP_Crosshair_Default; // 0x2B0 (8)
	struct UPanelWidget CP_Crosshair_SG; // 0x2B8 (8)
	struct UBorder BD_Kill; // 0x2C0 (8)
	struct UPanelWidget CP_Ammo; // 0x2C8 (8)
	struct UPDCircleProgressModule CPM_Ammo; // 0x2D0 (8)
	struct UPDCircleProgressModule CPM_AmmoBG; // 0x2D8 (8)
	struct UBorder BD_AmmoInfo; // 0x2E0 (8)
	struct USizeBox SB_Key; // 0x2E8 (8)
	struct UPDTextBlock TB_Key; // 0x2F0 (8)
	struct UPDTextBlock TB_AmmoInfo; // 0x2F8 (8)
	struct UImage IMG_CrossHairSight; // 0x300 (8)
	struct UImage IMG_CrossHairC; // 0x308 (8)
	struct UImage IMG_CrossHairL; // 0x310 (8)
	struct UImage IMG_CrossHairR; // 0x318 (8)
	struct UImage IMG_CrossHairT; // 0x320 (8)
	struct UImage IMG_CrossHairB; // 0x328 (8)
	struct UImage IMG_CrossHairC_L; // 0x330 (8)
	struct UImage IMG_CrossHairC_R; // 0x338 (8)
	struct UImage IMG_CrossHairC_T; // 0x340 (8)
	struct UImage IMG_CrossHairC_B; // 0x348 (8)
	struct UImage IMG_CrossHairC_C; // 0x350 (8)
	struct UPanelWidget CP_RedDot; // 0x358 (8)
	struct UImage IMG_RedDot; // 0x360 (8)
	struct UImage IMG_RedDotActive; // 0x368 (8)
	struct UImage IMG_RedDotLine; // 0x370 (8)
	struct UImage IMG_AimWarning; // 0x378 (8)
	struct UPanelWidget CP_Melee; // 0x380 (8)
	struct UImage IMG_CrossHairMelee; // 0x388 (8)
	struct UImage IMG_ReloadIcon; // 0x390 (8)
	struct UBorder BD_Hit; // 0x398 (8)
	struct UImage IMG_Hit_L; // 0x3A0 (8)
	struct UImage IMG_Hit_R; // 0x3A8 (8)
	struct UImage IMG_Hit_T; // 0x3B0 (8)
	struct UImage IMG_Hit_D; // 0x3B8 (8)
	struct UPDHitFeedBackUI HitFeedback_Armor; // 0x3C0 (8)
	struct UPDHitFeedBackUI HitFeedback_kill; // 0x3C8 (8)
	bool bEnableCrosshairLineAlpha; // 0x3D0 (1)
	struct UCurveFloat CrosshairFireCurve; // 0x3D8 (8)
	struct TArray<struct UImage> HitLines; // 0x460 (16)
	struct FSlateBrush CenterDotBrush; // 0x470 (136)
	struct FSlateBrush CrossHairBrush; // 0x4F8 (136)
	struct FSlateBrush HitLineBrush; // 0x580 (136)
	struct FSlateBrush KillLineBrush; // 0x608 (136)
	struct FSlateBrush RedDotBrush; // 0x690 (136)
	struct FSlateBrush OutlineBrush; // 0x718 (136)
	float DefaultOutlineThickness; // 0x7A0 (4)
	enum class ECrossHairDrawStyle DrawStyle; // 0x7A4 (4)
};

// Class ProjectD.PDCursorWidget
class UPDCursorWidget : public UUserWidget {

public:

	struct UCanvasPanel CP_Parent; // 0x230 (8)
	struct UImage IMG_Cursor; // 0x238 (8)

	void SetSize(); // Function ProjectD.PDCursorWidget.SetSize(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181B1D0>
};

// Class ProjectD.PDCustomCategoryListItem
class UPDCustomCategoryListItem : public UPDUserWidget {

public:

	struct UBorder BD_ItemOutline; // 0x290 (8)
	struct UBorder BD_Back; // 0x298 (8)
	struct UPDTextBlock TB_Category; // 0x2A0 (8)
	struct UImage IMG_New; // 0x2A8 (8)
};

// Class ProjectD.PDCustomCharacterDecoUI
class UPDCustomCharacterDecoUI : public UPDSceneBaseUI {

public:

	struct UTileView TV_ClosetCategory; // 0x288 (8)
	struct UTileView TV_ClosetItemList; // 0x290 (8)
	struct UPDButton Btn_Restore; // 0x298 (8)
	struct UPDButton Btn_Save; // 0x2A0 (8)
	struct UBorder BD_Cover; // 0x2A8 (8)
	struct UPDButton Btn_Buy; // 0x2B0 (8)
	struct UPDCheckBox CB_AllSkin; // 0x2B8 (8)
	struct UPDCheckBox CB_HasSkin; // 0x2C0 (8)
	struct UPDCheckBox CB_AllHasSkin; // 0x2C8 (8)
	struct UPDKeyButton Btn_GotoBack; // 0x2D0 (8)
	struct UPDButton Btn_LeftTurn; // 0x2D8 (8)
	struct UPDButton Btn_Zoom; // 0x2E0 (8)
	struct UPDButton Btn_RightTurn; // 0x2E8 (8)
	struct UPDTextBlock TB_AllHasSkin; // 0x2F0 (8)

	void OnZoomReleased(); // Function ProjectD.PDCustomCharacterDecoUI.OnZoomReleased(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181B090>
	void OnZoomPressed(); // Function ProjectD.PDCustomCharacterDecoUI.OnZoomPressed(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181B050>
	void OnSelectedCustomItem(struct UPDCustomListItemData InListItemData); // Function ProjectD.PDCustomCharacterDecoUI.OnSelectedCustomItem(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181ADF0>
	void OnSelectedCategoryItem(struct UPDCustomCategoryListItemData InListItemData); // Function ProjectD.PDCustomCharacterDecoUI.OnSelectedCategoryItem(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181ACF0>
	void OnSaveAndLeave(); // Function ProjectD.PDCustomCharacterDecoUI.OnSaveAndLeave(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181AC90>
	void OnRightTurnReleased(); // Function ProjectD.PDCustomCharacterDecoUI.OnRightTurnReleased(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A5B0>
	void OnRightTurnPressed(); // Function ProjectD.PDCustomCharacterDecoUI.OnRightTurnPressed(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181AB20>
	void OnRestore(); // Function ProjectD.PDCustomCharacterDecoUI.OnRestore(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181AB00>
	void OnMenuCoverMouseDown(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function ProjectD.PDCustomCharacterDecoUI.OnMenuCoverMouseDown(Final|Native|Private|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x181A720>
	void OnLeftTurnReleased(); // Function ProjectD.PDCustomCharacterDecoUI.OnLeftTurnReleased(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A5B0>
	void OnLeftTurnPressed(); // Function ProjectD.PDCustomCharacterDecoUI.OnLeftTurnPressed(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A570>
	void OnHasSkinCheckBoxChanged(bool InIsChecked); // Function ProjectD.PDCustomCharacterDecoUI.OnHasSkinCheckBoxChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A3D0>
	void OnBuyItem(); // Function ProjectD.PDCustomCharacterDecoUI.OnBuyItem(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A150>
	void OnAllSkinCheckBoxChanged(bool InIsChecked); // Function ProjectD.PDCustomCharacterDecoUI.OnAllSkinCheckBoxChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A010>
	void GotoBack(); // Function ProjectD.PDCustomCharacterDecoUI.GotoBack(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1819F20>
};

// Class ProjectD.PDCustomCharacterPerkUI
class UPDCustomCharacterPerkUI : public UPDSceneBaseUI {

public:

	struct UTileView TV_UniqueLeptonList; // 0x298 (8)
	struct UTileView TV_ProgressLeptonList; // 0x2A0 (8)
	struct UTileView TV_OwnLeptonList; // 0x2A8 (8)
	struct UTileView TV_EquipLeptonList; // 0x2B0 (8)
	struct UImage IMG_CostBg1; // 0x2B8 (8)
	struct UImage IMG_Cost1; // 0x2C0 (8)
	struct UImage IMG_CostBg2; // 0x2C8 (8)
	struct UImage IMG_Cost2; // 0x2D0 (8)
	struct UImage IMG_CostBg3; // 0x2D8 (8)
	struct UImage IMG_Cost3; // 0x2E0 (8)
	struct UImage IMG_CostBg4; // 0x2E8 (8)
	struct UImage IMG_Cost4; // 0x2F0 (8)
	struct UImage IMG_CostBg5; // 0x2F8 (8)
	struct UImage IMG_Cost5; // 0x300 (8)
	struct TArray<struct UImage> IMG_CostBgs; // 0x308 (16)
	struct TArray<struct UImage> IMG_Costs; // 0x318 (16)
	struct UPDTextBlock TB_Level; // 0x328 (8)
	struct UPDTextBlock TB_Name; // 0x330 (8)
	struct UCanvasPanel CP_SkillToolTip; // 0x338 (8)
	struct UImage IMG_PerkPreview; // 0x340 (8)
	struct UImage IMG_DescIcon; // 0x348 (8)
	struct UPDTextBlock TB_PerkName; // 0x350 (8)
	struct UPDTextBlock TB_PerkDesc; // 0x358 (8)
	struct UPDTextBlock TB_PerkStory; // 0x360 (8)
	struct UPDKeyButton Btn_GotoBack; // 0x368 (8)
	struct UCanvasPanel CP_Loading; // 0x370 (8)
	struct UPDTabButton TBtn_Preset01; // 0x378 (8)
	struct UPDTabButton TBtn_Preset02; // 0x380 (8)
	struct UPDTabButton TBtn_Preset03; // 0x388 (8)
	struct UPDButton Btn_List01; // 0x390 (8)
	struct UPDButton Btn_List02; // 0x398 (8)
	struct UPDButton Btn_List03; // 0x3A0 (8)
	struct UImage IMG_List01; // 0x3A8 (8)
	struct UImage IMG_List02; // 0x3B0 (8)
	struct UImage IMG_List03; // 0x3B8 (8)
	struct UCanvasPanel CP_PresetList; // 0x3C0 (8)
	struct UListView LV_PresetList; // 0x3C8 (8)
	struct UPDButton Btn_ResetPreset; // 0x3D0 (8)
	struct UPDTabButtonGroup PresetCategoryGroup; // 0x3D8 (8)

	void SeLeptonInfo(int32_t SkillIndex, struct FVector2D InfoAbsolutePos, int32_t IconWidth); // Function ProjectD.PDCustomCharacterPerkUI.SeLeptonInfo(Final|Native|Protected|HasDefaults) // <VeiledExperts-Win64-Shipping.exe+0x181B0D0>
	void OnSelectedPresetNameList(struct UPDAgentPresetListItemData InListItemData); // Function ProjectD.PDCustomCharacterPerkUI.OnSelectedPresetNameList(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181AEF0>
	void OnSaveAndLeaveCustomCharacterLepton(); // Function ProjectD.PDCustomCharacterPerkUI.OnSaveAndLeaveCustomCharacterLepton(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181ACD0>
	void OnLeaveCustomCharacterLepton(); // Function ProjectD.PDCustomCharacterPerkUI.OnLeaveCustomCharacterLepton(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181A550>
	void OnClickResetPreset(); // Function ProjectD.PDCustomCharacterPerkUI.OnClickResetPreset(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181A350>
	void OnClickPresetThird(); // Function ProjectD.PDCustomCharacterPerkUI.OnClickPresetThird(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181A330>
	void OnClickPresetSecond(); // Function ProjectD.PDCustomCharacterPerkUI.OnClickPresetSecond(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181A310>
	void OnClickPresetFirst(); // Function ProjectD.PDCustomCharacterPerkUI.OnClickPresetFirst(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181A2F0>
	void OnClickNameList(); // Function ProjectD.PDCustomCharacterPerkUI.OnClickNameList(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181A2D0>
	void LeptonTooltipVisible(bool bShow); // Function ProjectD.PDCustomCharacterPerkUI.LeptonTooltipVisible(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1819F60>
	void GotoBack(); // Function ProjectD.PDCustomCharacterPerkUI.GotoBack(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1819F40>
};

// Class ProjectD.PDCustomJoinPopupUI
class UPDCustomJoinPopupUI : public UPDPopupBaseUI {

public:

	struct UPDButton Btn_Show; // 0x2B8 (8)
	struct UPDButton Btn_Hide; // 0x2C0 (8)
	struct UPDButton Btn_Ok; // 0x2C8 (8)
	struct UEditableTextBox ET_Code; // 0x2D0 (8)

	void OnClickShowBtn(); // Function ProjectD.PDCustomJoinPopupUI.OnClickShowBtn(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181A370>
	void OnClickHideBtn(); // Function ProjectD.PDCustomJoinPopupUI.OnClickHideBtn(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181A2B0>
	void OnChangeText(struct FText& InText); // Function ProjectD.PDCustomJoinPopupUI.OnChangeText(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x181A190>
};

// Class ProjectD.PDCustomListItem
class UPDCustomListItem : public UPDUserWidget {

public:

	struct UAkAudioEvent HoverSound; // 0x290 (8)
	struct UAkAudioEvent ClickSound; // 0x298 (8)
	struct UImage Img_Bg; // 0x2A0 (8)
	struct UImage IMG_Item; // 0x2A8 (8)
	struct UImage IMG_Lock; // 0x2B0 (8)
	struct UImage IMG_New; // 0x2B8 (8)
	struct UImage IMG_Equip; // 0x2C0 (8)
	struct UPDTextBlock TB_Name; // 0x2C8 (8)
	struct UPDTextBlock TB_Count; // 0x2D0 (8)
	struct UBorder BD_ItemOutline; // 0x2D8 (8)
	struct UBorder BD_ItemSelOutline; // 0x2E0 (8)
};

// Class ProjectD.PDCustomMatchCharItem
class UPDCustomMatchCharItem : public UPDUserWidget {

public:

	struct UImage Img_Bg; // 0x290 (8)
	struct UImage IMG_Item; // 0x298 (8)
	struct UBorder BD_ItemOutline; // 0x2A0 (8)
};

// Class ProjectD.PDCustomMatchListItem
class UPDCustomMatchListItem : public UPDUserWidget {

public:

	struct UCanvasPanel CP_Normal; // 0x290 (8)
	struct UCanvasPanel CP_Add; // 0x298 (8)
	struct UCanvasPanel CP_Join; // 0x2A0 (8)
	struct UCanvasPanel CP_Empty; // 0x2A8 (8)
	struct UBorder Background; // 0x2B0 (8)
	struct UImage IMG_Face; // 0x2B8 (8)
	struct UImage IMG_ClanMarkBG; // 0x2C0 (8)
	struct UImage IMG_ClanMarkFG; // 0x2C8 (8)
	struct UPDTextBlock TB_ClanName; // 0x2D0 (8)
	struct UCanvasPanel CP_ClanMark; // 0x2D8 (8)
	struct UPDButton Btn_Perk; // 0x2E0 (8)
	struct UImage IMG_Leader; // 0x2E8 (8)
	struct UPDTextBlock TB_NickName3; // 0x2F0 (8)
	struct UPDButton Btn_CharChange; // 0x2F8 (8)
	struct UPDButton BTN_Join; // 0x300 (8)

	void OnPerkUnHovered(); // Function ProjectD.PDCustomMatchListItem.OnPerkUnHovered(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181AAE0>
	void OnPerkHovered(); // Function ProjectD.PDCustomMatchListItem.OnPerkHovered(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181AAC0>
	void OnJoinClicked(); // Function ProjectD.PDCustomMatchListItem.OnJoinClicked(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A510>
	void OnCharChangeClicked(); // Function ProjectD.PDCustomMatchListItem.OnCharChangeClicked(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A290>
};

// Class ProjectD.PDCustomMatchTooltip
class UPDCustomMatchTooltip : public UPDUserWidget {

public:

	struct UListView LV_Perks; // 0x288 (8)
	struct UImage Img_Bg; // 0x290 (8)
};

// Class ProjectD.PDCustomPerkListItem
class UPDCustomPerkListItem : public UPDUserWidget {

public:

	struct UImage Img_SignatureBg; // 0x290 (8)
	struct UImage Img_Bg; // 0x298 (8)
	struct UImage IMG_Item; // 0x2A0 (8)
	struct UImage IMG_Lock; // 0x2A8 (8)
	struct UPDTextBlock TB_Name; // 0x2B0 (8)
	struct UPDTextBlock TB_Activate; // 0x2B8 (8)
	struct UBorder BD_ItemOutline; // 0x2C0 (8)
	struct UBorder BD_SignatureItemOutline; // 0x2C8 (8)
	struct UDragDropOperation DragDropOperation; // 0x2D0 (8)
};

// Class ProjectD.PDCustomRoomUI
class UPDCustomRoomUI : public UPDUserWidget {

public:

	struct UPDTextBlock T_Code; // 0x288 (8)
	struct UPDButton Btn_Hide; // 0x290 (8)
	struct UPDButton Btn_Copy; // 0x298 (8)
	struct UCanvasPanel CP_CharChange; // 0x2A0 (8)
	struct UPDCustomMatchTooltip CustomMatchTooltip; // 0x2A8 (8)
	struct UListView LV_Characters; // 0x2B0 (8)
	struct UCanvasPanel CP_ContextMenu; // 0x2B8 (8)
	struct UPDButton Btn_FriendAdd; // 0x2C0 (8)
	struct UPDButton Btn_Whisper; // 0x2C8 (8)
	struct UPDButton Btn_KickUser; // 0x2D0 (8)
	struct UPDButton Btn_TransferMaster; // 0x2D8 (8)
	struct UListView LV_ATeam; // 0x2E0 (8)
	struct UListView LV_BTeam; // 0x2E8 (8)
	struct UListView LV_NTeam; // 0x2F0 (8)
	struct UPDButton Btn_Back; // 0x2F8 (8)
	struct UPDButton Btn_Option; // 0x300 (8)
	struct UPDButton Btn_Comm; // 0x308 (8)
	struct UPDButton Btn_Start; // 0x310 (8)
	struct UPDComboBox CB_Mode; // 0x318 (8)
	struct UPDComboBox CB_Round; // 0x320 (8)
	struct UImage IMG_Disabled; // 0x328 (8)
	struct URichTextBlock RT_StartDesc; // 0x330 (8)

	void OnWhisperUserClicked(); // Function ProjectD.PDCustomRoomUI.OnWhisperUserClicked(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181B030>
	void OnTransferMasterClicked(); // Function ProjectD.PDCustomRoomUI.OnTransferMasterClicked(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181B010>
	void OnStartClicked(); // Function ProjectD.PDCustomRoomUI.OnStartClicked(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181AFF0>
	void OnRoundSelectedChanged(struct FString sItem, enum class ESelectInfo SelType); // Function ProjectD.PDCustomRoomUI.OnRoundSelectedChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181AB60>
	void OnOptionClicked(); // Function ProjectD.PDCustomRoomUI.OnOptionClicked(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181AAA0>
	void OnMapSelectedChanged(struct FString sItem, enum class ESelectInfo SelType); // Function ProjectD.PDCustomRoomUI.OnMapSelectedChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A5F0>
	void OnKickUserClicked(); // Function ProjectD.PDCustomRoomUI.OnKickUserClicked(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A530>
	void OnHideClicked(); // Function ProjectD.PDCustomRoomUI.OnHideClicked(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A4F0>
	void OnCopyClicked(); // Function ProjectD.PDCustomRoomUI.OnCopyClicked(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A3B0>
	void OnCommClicked(); // Function ProjectD.PDCustomRoomUI.OnCommClicked(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A390>
	void OnBackClicked(); // Function ProjectD.PDCustomRoomUI.OnBackClicked(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A130>
	void OnAddFriendClicked(); // Function ProjectD.PDCustomRoomUI.OnAddFriendClicked(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1819FF0>
};

// Class ProjectD.PDCustomWeaponAttribute
class UPDCustomWeaponAttribute : public UPDUserWidget {

public:

	struct UPDTextBlock T_StatName; // 0x288 (8)
	struct UPDTextBlock T_Stat_Value; // 0x290 (8)
	struct UProgressBar PB_Stat_Src; // 0x298 (8)
	struct FText InStatName; // 0x2A0 (24)
};

// Class ProjectD.PDCustomWeaponListItem
class UPDCustomWeaponListItem : public UPDUserWidget {

public:

	struct UImage Img_Bg; // 0x290 (8)
	struct UImage IMG_Item; // 0x298 (8)
	struct UImage IMG_Lock; // 0x2A0 (8)
	struct UImage IMG_Equip; // 0x2A8 (8)
	struct UPDTextBlock TB_Name; // 0x2B0 (8)
	struct UPDTextBlock TB_Count; // 0x2B8 (8)
	struct UBorder BD_ItemOutline; // 0x2C0 (8)
};

// Class ProjectD.PDCustomWeaponUI
class UPDCustomWeaponUI : public UPDSceneBaseUI {

public:

	struct UTileView TV_WeaponCategory; // 0x288 (8)
	struct UTileView TV_WeaponItemList; // 0x290 (8)
	struct UTileView TV_ItemSkinList; // 0x298 (8)
	struct UCanvasPanel CP_Inventory; // 0x2A0 (8)
	struct UPDButton Btn_Restore; // 0x2A8 (8)
	struct UPDButton Btn_Buy; // 0x2B0 (8)
	struct UPDButton Btn_LoadOut; // 0x2B8 (8)
	struct UPDButton Btn_SaveAndOut; // 0x2C0 (8)
	struct UPDButton Btn_ChangeView; // 0x2C8 (8)
	struct UBorder BD_Cover; // 0x2D0 (8)
	struct UPDTextBlock T_FireModeInfo; // 0x2D8 (8)
	struct UPDTextBlock T_BulletInfo; // 0x2E0 (8)
	struct UImage IMG_Info_Bullet; // 0x2E8 (8)
	struct UPDCustomWeaponAttribute WeaponStat1; // 0x2F0 (8)
	struct UPDCustomWeaponAttribute WeaponStat2; // 0x2F8 (8)
	struct UPDCustomWeaponAttribute WeaponStat3; // 0x300 (8)
	struct UPDCustomWeaponAttribute WeaponStat4; // 0x308 (8)
	struct UPDCustomWeaponAttribute WeaponStat5; // 0x310 (8)
	struct UPDCustomWeaponAttribute WeaponStat6; // 0x318 (8)
	struct UPDCheckBox CB_AllSkin; // 0x320 (8)
	struct UPDCheckBox CB_HasSkin; // 0x328 (8)
	struct UPDButton Btn_LeftTurn; // 0x330 (8)
	struct UPDButton Btn_Zoom; // 0x338 (8)
	struct UPDButton Btn_RightTurn; // 0x340 (8)
	struct UPDKeyButton Btn_GotoBack; // 0x348 (8)
	struct UImage IMG_Zoom; // 0x350 (8)
	struct TArray<struct UPDCustomWeaponListItemData> WeaponSkinListItems; // 0x358 (16)
	struct FVector WeaponPivot; // 0x368 (12)

	void OnZoomReleased(); // Function ProjectD.PDCustomWeaponUI.OnZoomReleased(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181B0B0>
	void OnZoomPressed(); // Function ProjectD.PDCustomWeaponUI.OnZoomPressed(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181B070>
	void OnSelectedSkinListItem(struct UPDCustomWeaponListItemData InListItemData); // Function ProjectD.PDCustomWeaponUI.OnSelectedSkinListItem(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181AF70>
	void OnSelectedItemListItem(struct UPDCustomWeaponListItemData InListItemData); // Function ProjectD.PDCustomWeaponUI.OnSelectedItemListItem(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181AE70>
	void OnSelectedCategoryItem(struct UPDCustomCategoryListItemData InListItemData); // Function ProjectD.PDCustomWeaponUI.OnSelectedCategoryItem(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181AD70>
	void OnSaveAndLeave(); // Function ProjectD.PDCustomWeaponUI.OnSaveAndLeave(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181ACB0>
	void OnRightTurnReleased(); // Function ProjectD.PDCustomWeaponUI.OnRightTurnReleased(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A5D0>
	void OnRightTurnPressed(); // Function ProjectD.PDCustomWeaponUI.OnRightTurnPressed(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181AB40>
	void OnRestore(); // Function ProjectD.PDCustomWeaponUI.OnRestore(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnMenuCoverMouseDown(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function ProjectD.PDCustomWeaponUI.OnMenuCoverMouseDown(Final|Native|Private|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x181A8E0>
	void OnLoadOut(); // Function ProjectD.PDCustomWeaponUI.OnLoadOut(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnLeftTurnReleased(); // Function ProjectD.PDCustomWeaponUI.OnLeftTurnReleased(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A5D0>
	void OnLeftTurnPressed(); // Function ProjectD.PDCustomWeaponUI.OnLeftTurnPressed(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A590>
	void OnHasSkinCheckBoxChanged(bool InIsChecked); // Function ProjectD.PDCustomWeaponUI.OnHasSkinCheckBoxChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A460>
	void OnChangeView(); // Function ProjectD.PDCustomWeaponUI.OnChangeView(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A270>
	void OnBuyItem(); // Function ProjectD.PDCustomWeaponUI.OnBuyItem(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A170>
	void OnAllSkinCheckBoxChanged(bool InIsChecked); // Function ProjectD.PDCustomWeaponUI.OnAllSkinCheckBoxChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181A0A0>
	void GotoBack(); // Function ProjectD.PDCustomWeaponUI.GotoBack(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1819F20>
};

// Class ProjectD.PDDamageIndicatorUI
class UPDDamageIndicatorUI : public UPDUserWidget {

public:

	struct UBorder BD_Rotator; // 0x288 (8)
	struct UImage IMG_DamageIndicator; // 0x290 (8)
};

// Class ProjectD.PDDamageScreenIndicatorUI
class UPDDamageScreenIndicatorUI : public UPDIngameModeWidget {

public:

	struct UImage IMG_LeftUp; // 0x290 (8)
	struct UImage IMG_Up; // 0x298 (8)
	struct UImage IMG_RightUp; // 0x2A0 (8)
	struct UImage IMG_Right; // 0x2A8 (8)
	struct UImage IMG_RightDown; // 0x2B0 (8)
	struct UImage IMG_Down; // 0x2B8 (8)
	struct UImage IMG_LeftDown; // 0x2C0 (8)
	struct UImage IMG_Left; // 0x2C8 (8)
	struct UCanvasPanel CP_Impact; // 0x2D0 (8)
};

// Class ProjectD.PDDebugLogUI
class UPDDebugLogUI : public UPDSceneBaseUI {

public:

	struct UPDButton Btn_GotoLobby; // 0x2B8 (8)
	struct UButton BTN_FP_Left; // 0x2C0 (8)
	struct UButton BTN_FP_Right; // 0x2C8 (8)
	struct UMultiLineEditableTextBox MTXT_Content; // 0x2D0 (8)
	struct UTextBlock TXT_FP_Page; // 0x2D8 (8)
	struct TArray<struct UPDButton> FileNameButtonList; // 0x2E0 (16)
	struct UPDButton Filename_1; // 0x2F0 (8)
	struct UPDButton Filename_2; // 0x2F8 (8)
	struct UPDButton Filename_3; // 0x300 (8)
	struct UPDButton Filename_4; // 0x308 (8)
	struct UPDButton Filename_5; // 0x310 (8)
	struct UPDButton Filename_6; // 0x318 (8)
	struct UPDButton Filename_7; // 0x320 (8)
	struct UPDButton Filename_8; // 0x328 (8)
	struct UPDButton Filename_9; // 0x330 (8)
	struct UPDButton Filename_10; // 0x338 (8)
	struct UPDButton Filename_11; // 0x340 (8)
	struct UPDButton Filename_12; // 0x348 (8)
	struct UPDButton Filename_13; // 0x350 (8)
	struct UPDButton Filename_14; // 0x358 (8)
	struct UPDButton Filename_15; // 0x360 (8)
	struct UPDButton Filename_16; // 0x368 (8)
	struct UPDButton Filename_17; // 0x370 (8)
	struct UPDButton Filename_18; // 0x378 (8)
	struct UPDButton Filename_19; // 0x380 (8)

	void OnClickBtnGotoLobby(); // Function ProjectD.PDDebugLogUI.OnClickBtnGotoLobby(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1816850>
	void OnClickBtnFPRight(); // Function ProjectD.PDDebugLogUI.OnClickBtnFPRight(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DDD0>
	void OnClickBtnFPLeft(); // Function ProjectD.PDDebugLogUI.OnClickBtnFPLeft(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DDB0>
	void OnClickBtnFileName_10(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_10(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181E030>
	void OnClickBtnFileName_9(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_9(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181E010>
	void OnClickBtnFileName_8(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_8(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DFF0>
	void OnClickBtnFileName_7(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_7(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DFD0>
	void OnClickBtnFileName_6(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_6(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DFB0>
	void OnClickBtnFileName_5(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_5(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DF90>
	void OnClickBtnFileName_4(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_4(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DF70>
	void OnClickBtnFileName_3(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_3(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DF50>
	void OnClickBtnFileName_19(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_19(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DF10>
	void OnClickBtnFileName_18(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_18(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DEF0>
	void OnClickBtnFileName_17(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_17(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DED0>
	void OnClickBtnFileName_16(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_16(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DEB0>
	void OnClickBtnFileName_15(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_15(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DE90>
	void OnClickBtnFileName_14(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_14(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DE70>
	void OnClickBtnFileName_13(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_13(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DE50>
	void OnClickBtnFileName_12(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_12(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DE30>
	void OnClickBtnFileName_11(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_11(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DE10>
	void OnClickBtnFileName_2(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_2(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DF30>
	void OnClickBtnFileName_1(); // Function ProjectD.PDDebugLogUI.OnClickBtnFileName_1(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181DDF0>
};

// Class ProjectD.PDDefuseBombModeUI
class UPDDefuseBombModeUI : public UPDBaseModeUI {

public:

	struct UPDCCTVUI CCTV; // 0x4C8 (8)
	struct UPDSkyViewUI SkyView; // 0x4D0 (8)
	struct UPDIngameStatusBoardUI IngameStatusBoard; // 0x4D8 (8)
	struct UPDRoundInfoUI RoundInfo; // 0x4E0 (8)
	struct UPDRoundResult RoundResult; // 0x4E8 (8)
	struct UPDKillMessage KillMessage; // 0x4F0 (8)
	struct UPDRoundReplayer RoundReplayer; // 0x4F8 (8)
	struct UPDReportPopupUI ReportPopup; // 0x500 (8)
};

// Class ProjectD.PDDisplayOptionUI
class UPDDisplayOptionUI : public UPDOptionUIBase {

public:

	struct UPDTabButton VideoSettingBtn; // 0x338 (8)
	struct UPDTabButton SystemSettingBtn; // 0x340 (8)
	struct UScrollBox SB_Display; // 0x348 (8)
	struct UEnum EDisplayModePtr; // 0x3A8 (8)
	struct UEnum EFrameRateModePtr; // 0x3B0 (8)
	struct UEnum EGraphicsQualityPtr; // 0x3B8 (8)
	struct UEnum EBlockTypePtr; // 0x3C0 (8)

	void OnWhisperBlockChanged(struct FString sItem, enum class ESelectInfo SelType); // Function ProjectD.PDDisplayOptionUI.OnWhisperBlockChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181EFD0>
	void OnViewDistanceQualityChanged(float Value); // Function ProjectD.PDDisplayOptionUI.OnViewDistanceQualityChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181EF50>
	void OnUseVSyncChanged(bool bIsChecked); // Function ProjectD.PDDisplayOptionUI.OnUseVSyncChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181EEC0>
	void OnUseAdditionalPostProcessesChanged(bool Value); // Function ProjectD.PDDisplayOptionUI.OnUseAdditionalPostProcessesChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181EE30>
	void OnTextureQualityChanged(float Value); // Function ProjectD.PDDisplayOptionUI.OnTextureQualityChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181EDB0>
	void OnShadowQualityChanged(float Value); // Function ProjectD.PDDisplayOptionUI.OnShadowQualityChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181ED30>
	void OnScreenPercentageChanged(float Value); // Function ProjectD.PDDisplayOptionUI.OnScreenPercentageChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181ECB0>
	void OnResolutionChanged(struct FString sItem, enum class ESelectInfo SelType); // Function ProjectD.PDDisplayOptionUI.OnResolutionChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181EB80>
	void OnPostProcessQualityChanged(float Value); // Function ProjectD.PDDisplayOptionUI.OnPostProcessQualityChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181EB00>
	void OnPostProcessAAQualityChanged(float Value); // Function ProjectD.PDDisplayOptionUI.OnPostProcessAAQualityChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181EA80>
	void OnPartyInviteBlockChanged(struct FString sItem, enum class ESelectInfo SelType); // Function ProjectD.PDDisplayOptionUI.OnPartyInviteBlockChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181E950>
	void OnOutGameBrightnessVolumeChanged(float Value); // Function ProjectD.PDDisplayOptionUI.OnOutGameBrightnessVolumeChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181E8D0>
	void OnMaxAnisotropyChanged(float Value); // Function ProjectD.PDDisplayOptionUI.OnMaxAnisotropyChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181E850>
	void OnLightShaftChanged(bool Value); // Function ProjectD.PDDisplayOptionUI.OnLightShaftChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181E7C0>
	void OnLanguageChanged(struct FString sItem, enum class ESelectInfo SelType); // Function ProjectD.PDDisplayOptionUI.OnLanguageChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181E690>
	void OnInGameBrightnessVolumeChanged(float Value); // Function ProjectD.PDDisplayOptionUI.OnInGameBrightnessVolumeChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181E610>
	void OnFullScreenModeChanged(struct FString sItem, enum class ESelectInfo SelType); // Function ProjectD.PDDisplayOptionUI.OnFullScreenModeChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181E4E0>
	void OnFrameRateModeChanged(struct FString sItem, enum class ESelectInfo SelType); // Function ProjectD.PDDisplayOptionUI.OnFrameRateModeChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181E3B0>
	void OnFrameRateLimitChanged(float Value); // Function ProjectD.PDDisplayOptionUI.OnFrameRateLimitChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181E330>
	void OnFoliageQualityChanged(float Value); // Function ProjectD.PDDisplayOptionUI.OnFoliageQualityChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181E2B0>
	void OnEffectsQualityChanged(float Value); // Function ProjectD.PDDisplayOptionUI.OnEffectsQualityChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181E0F0>
	void OnClickVideoSettingButton(); // Function ProjectD.PDDisplayOptionUI.OnClickVideoSettingButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816A30>
	void OnClickSystemSettingButton(); // Function ProjectD.PDDisplayOptionUI.OnClickSystemSettingButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816910>
	void OnClickMidiumGraphicButton(); // Function ProjectD.PDDisplayOptionUI.OnClickMidiumGraphicButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181E0D0>
	void OnClickLowGraphicButton(); // Function ProjectD.PDDisplayOptionUI.OnClickLowGraphicButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181E0B0>
	void OnClickHighGraphicButton(); // Function ProjectD.PDDisplayOptionUI.OnClickHighGraphicButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181E090>
	void OnClickEpicGraphicButton(); // Function ProjectD.PDDisplayOptionUI.OnClickEpicGraphicButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181E070>
	void OnClickCustomGraphicButton(); // Function ProjectD.PDDisplayOptionUI.OnClickCustomGraphicButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181E050>
	void OnBackGroundQualityChanged(float Value); // Function ProjectD.PDDisplayOptionUI.OnBackGroundQualityChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181DB40>
	void OnAddFriendBlockChanged(struct FString sItem, enum class ESelectInfo SelType); // Function ProjectD.PDDisplayOptionUI.OnAddFriendBlockChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x181DA10>
};

// Class ProjectD.PDDroneSpringArmComponent
class UPDDroneSpringArmComponent : public USpringArmComponent {

public:

	float CrouchTargetOffsetLagSpeed; // 0x280 (4)
};

// Class ProjectD.PDDynamicObjectEvent
class APDDynamicObjectEvent : public UActor {

public:

	int32_t DBID; // 0x240 (4)
	bool UseCollisionBox; // 0x244 (1)

	void OnActorEndOverlapEvent(struct UActor OverlappedActor, struct UActor OtherActor); // Function ProjectD.PDDynamicObjectEvent.OnActorEndOverlapEvent(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181D950>
	void OnActorBeginOverlapEvent(struct UActor OverlappedActor, struct UActor OtherActor); // Function ProjectD.PDDynamicObjectEvent.OnActorBeginOverlapEvent(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x181D890>
};

// Class ProjectD.PDDynamicObject
class APDDynamicObject : public APDDynamicObjectEvent {

public:

	enum class EDYNAMICOBJECTSTATE DefaultState; // 0x420 (1)
	bool ReverseDirection; // 0x421 (1)
};

// Class ProjectD.PDDynamicObjectSwitchComponent
class UPDDynamicObjectSwitchComponent : public UStaticMeshComponent {

public:

	struct UArrowComponent InteractionArrow; // 0x498 (8)
	struct UBoxComponent SwitchExtentBox; // 0x4A0 (8)
	struct TSet<struct FString> ReactNames; // 0x4A8 (80)
	struct TMap<int32_t, struct UMaterialInstance> ActiveMaterial; // 0x4F8 (80)

	void OnEndTriggerOverlap(struct UPrimitiveComponent OverlappedComp, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex); // Function ProjectD.PDDynamicObjectSwitchComponent.OnEndTriggerOverlap(Final|Native|Public) // <VeiledExperts-Win64-Shipping.exe+0x181E170>
	void OnBeginTriggerOverlap(struct UPrimitiveComponent OverlappedComp, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function ProjectD.PDDynamicObjectSwitchComponent.OnBeginTriggerOverlap(Final|Native|Public|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x181DBC0>
};

// Class ProjectD.PDEndAnimNotifyState
class UPDEndAnimNotifyState : public UAnimNotifyState {

public:

	enum class EPDEndAnimationType EndAnimationType; // 0x30 (1)
};

// Class ProjectD.PDEnvEffect
class APDEnvEffect : public UActor {

public:

	enum class EPDEnvEffectClientType EffectType; // 0x220 (1)
	struct UArrowComponent MovingObjectSoundHelper; // 0x228 (8)
	struct UArrowComponent CameraMountedHelper; // 0x230 (8)
	struct UArrowComponent FrontOutdoor; // 0x238 (8)
	struct UMaterialParameterCollection MPC; // 0x240 (8)
	struct UCurveLinearColor SandStormCurve; // 0x248 (8)
	struct UCurveLinearColor SandStormCurve2; // 0x250 (8)
	struct FEnvSetting OrgSetting; // 0x258 (100)
	struct FEnvSetting TargetSetting; // 0x2BC (100)
	float TransitionDistance; // 0x320 (4)
	float EnteringDistance; // 0x324 (4)
	float CameraImpactDistance; // 0x328 (4)
	float IntensityFactor; // 0x32C (4)
	float OutdoornessTransitionTime; // 0x330 (4)
	float VisibilityToggleDistance; // 0x334 (4)
	struct TWeakObjectPtr<struct UExponentialHeightFogComponent> GlobalFog; // 0x33C (8)
	struct TWeakObjectPtr<struct UDirectionalLightComponent> GlobalDirectionalLightComponent; // 0x344 (8)
	struct TWeakObjectPtr<struct USkyLightComponent> GlobalSkyLightComponent; // 0x34C (8)
	struct FVector MovingObjectInitPosition; // 0x4A0 (12)
	struct FVector MovingObjectTargetPosition; // 0x4AC (12)
	struct TWeakObjectPtr<struct UMaterialParameterCollectionInstance> MPCI; // 0x4B8 (8)
	struct TWeakObjectPtr<struct UParticleSystemComponent> MovingEffect; // 0x4C0 (8)
	struct TArray<struct TWeakObjectPtr<struct UParticleSystemComponent>> Particles; // 0x4C8 (16)
	struct TArray<struct TWeakObjectPtr<struct UParticleSystemComponent>> SolidParticles; // 0x4D8 (16)
	struct TArray<struct TWeakObjectPtr<struct UParticleSystemComponent>> SwitchableParticles; // 0x4E8 (16)
	struct TWeakObjectPtr<struct UPostProcessComponent> PostProcessRef; // 0x4F8 (8)
	struct TWeakObjectPtr<struct APDIndoorVolume> IndoorVolume; // 0x500 (8)
	struct TArray<struct TWeakObjectPtr<struct UActor>> ActorsForVisibilityToggleByDistance; // 0x508 (16)
};

// Class ProjectD.PDEquipLeptonListItem
class UPDEquipLeptonListItem : public UPDUserWidget {

public:

	struct UWidgetSwitcher WS_EquipLepton; // 0x290 (8)
	struct UImage IMG_Item; // 0x298 (8)
	struct UPDTextBlock TB_Name; // 0x2A0 (8)
	struct UImage IMG_Cost1; // 0x2A8 (8)
	struct UImage IMG_Cost2; // 0x2B0 (8)
	struct UImage IMG_Cost3; // 0x2B8 (8)
	struct UImage IMG_Cost4; // 0x2C0 (8)
	struct UImage IMG_Cost5; // 0x2C8 (8)
	struct UBorder BD_Outline; // 0x2D0 (8)
	struct UDragDropOperation DragDropOperation; // 0x2D8 (8)
	struct TArray<struct UImage> CostImgArr; // 0x308 (16)
};

// Class ProjectD.PDEquipPerkList
class UPDEquipPerkList : public UPDUserWidget {

public:

	struct UTileView TV_PerkSignatureList; // 0x2A0 (8)
	struct UTileView TV_PerkSocketList; // 0x2A8 (8)
	struct UTileView TV_PerkPassiveList; // 0x2B0 (8)
	struct UCanvasPanel CP_SkillToolTip; // 0x2B8 (8)
	struct UBorder B_SkillToolTip; // 0x2C0 (8)
	struct UImage IMG_DescIcon; // 0x2C8 (8)
	struct UPDTextBlock TB_PerkName; // 0x2D0 (8)
	struct UPDTextBlock TB_PerkDesc; // 0x2D8 (8)
	struct UPDTextBlock TB_PerkStory; // 0x2E0 (8)
	struct UCanvasPanel CP_AlertEquipPerk; // 0x2E8 (8)
	struct UPDButton Btn_GoEquipPerk; // 0x2F0 (8)
	struct UCanvasPanel CP_Perk_Alert; // 0x2F8 (8)
	struct UHorizontalBox HP_PerkList; // 0x300 (8)

	void SetSkillToolTipVisible(bool bShow); // Function ProjectD.PDEquipPerkList.SetSkillToolTipVisible(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1823280>
	void SetSkillInfo(int32_t SkillIndex, struct FVector2D InfoAbsolutePos, int32_t IconWidth); // Function ProjectD.PDEquipPerkList.SetSkillInfo(Final|Native|Private|HasDefaults) // <VeiledExperts-Win64-Shipping.exe+0x1823180>
	void SetSignatureInfo(int32_t SignatureIndex, struct FVector2D InfoAbsolutePos, int32_t IconWidth); // Function ProjectD.PDEquipPerkList.SetSignatureInfo(Final|Native|Private|HasDefaults) // <VeiledExperts-Win64-Shipping.exe+0x1823080>
	void OnListClickItem(struct UPDCustomPerkListItemData InListItemData); // Function ProjectD.PDEquipPerkList.OnListClickItem(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1822EA0>
};

// Class ProjectD.PDEscMenuUI
class UPDEscMenuUI : public UPDUserWidget {

public:

	struct UPDButton ResumeBtn; // 0x288 (8)
	struct UPDButton LeaveGameBtn; // 0x290 (8)
	struct UPDButton QuitBtn; // 0x298 (8)
	struct UPDButton OptionBtn; // 0x2A0 (8)

	void OnClickResumeBtn(); // Function ProjectD.PDEscMenuUI.OnClickResumeBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18228B0>
	void OnClickQuitBtn(); // Function ProjectD.PDEscMenuUI.OnClickQuitBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1822850>
	void OnClickOptionBtn(); // Function ProjectD.PDEscMenuUI.OnClickOptionBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1822830>
	void OnClickLeaveGameBtn(); // Function ProjectD.PDEscMenuUI.OnClickLeaveGameBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1822810>
};

// Class ProjectD.PDExportSafeZoneInitialVertices
class APDExportSafeZoneInitialVertices : public UActor {

public:

	char GroupID; // 0x220 (1)
	char UsageVertexNum; // 0x221 (1)
	struct UStaticMeshComponent Origin; // 0x228 (8)
	struct UPDExportSafeZoneVertexComponent Vertex_00; // 0x230 (8)
	struct UPDExportSafeZoneVertexComponent Vertex_01; // 0x238 (8)
	struct UPDExportSafeZoneVertexComponent Vertex_02; // 0x240 (8)
	struct UPDExportSafeZoneVertexComponent Vertex_03; // 0x248 (8)
	struct UPDExportSafeZoneVertexComponent Vertex_04; // 0x250 (8)
	struct UPDExportSafeZoneVertexComponent Vertex_05; // 0x258 (8)
	struct UPDExportSafeZoneVertexComponent Vertex_06; // 0x260 (8)
	struct UPDExportSafeZoneVertexComponent Vertex_07; // 0x268 (8)
	struct UPDExportSafeZoneVertexComponent Vertex_08; // 0x270 (8)
	struct UPDExportSafeZoneVertexComponent Vertex_09; // 0x278 (8)
	struct UPDExportSafeZoneVertexComponent Vertex_11; // 0x280 (8)
};

// Class ProjectD.PDExportSafeZoneSelectPoint
class APDExportSafeZoneSelectPoint : public UActor {

public:

	struct UStaticMeshComponent Mesh; // 0x220 (8)
	struct TSet<char> UsagePhaseGroupIDs; // 0x228 (80)
};

// Class ProjectD.PDExportSafeZoneVertexComponent
class UPDExportSafeZoneVertexComponent : public UStaticMeshComponent {

public:

	char Index; // 0x498 (1)
};

// Class ProjectD.PDExportSeedArea
class APDExportSeedArea : public UActor {

public:

	int32_t SeedAreaID; // 0x220 (4)
	struct UStaticMeshComponent SeedAComp; // 0x228 (8)
	struct UStaticMeshComponent SeedBComp; // 0x230 (8)

	void OnEndSeedBBoxOverlap(struct UPrimitiveComponent OverlappedComp, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex); // Function ProjectD.PDExportSeedArea.OnEndSeedBBoxOverlap(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1822D40>
	void OnEndSeedABoxOverlap(struct UPrimitiveComponent OverlappedComp, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex); // Function ProjectD.PDExportSeedArea.OnEndSeedABoxOverlap(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1822C00>
	void OnBeginSeedBBoxOverlap(struct UPrimitiveComponent OverlappedComp, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function ProjectD.PDExportSeedArea.OnBeginSeedBBoxOverlap(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1822500>
	void OnBeginSeedABoxOverlap(struct UPrimitiveComponent OverlappedComp, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function ProjectD.PDExportSeedArea.OnBeginSeedABoxOverlap(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1822310>
};

// Class ProjectD.PDFindPartyListItem
class UPDFindPartyListItem : public UPDUserWidget {

public:

	struct UBorder BD_Background; // 0x290 (8)
	struct UWidgetSwitcher WS_State; // 0x298 (8)
	struct UImage IMG_Face; // 0x2A0 (8)
	struct UCanvasPanel CP_ClanMarkInfo; // 0x2A8 (8)
	struct UImage IMG_ClanMarkBG; // 0x2B0 (8)
	struct UImage IMG_ClanMarkFG; // 0x2B8 (8)
	struct UPDTextBlock TB_ClanName; // 0x2C0 (8)
	struct UPDTextBlock TB_Nickname; // 0x2C8 (8)
	struct UWidgetSwitcher WS_UserInfo; // 0x2D0 (8)
	struct UPDTextBlock TB_KD; // 0x2D8 (8)
	struct UPDTextBlock TB_ADR; // 0x2E0 (8)
	struct UWidgetSwitcher WS_BtnState; // 0x2E8 (8)
	struct UPDButton Btn_Recruit; // 0x2F0 (8)
	struct UHorizontalBox HB_UserData; // 0x2F8 (8)
	struct UImage IMG_Manner; // 0x300 (8)
	struct UImage IMG_Medal1; // 0x308 (8)
	struct UImage IMG_Medal2; // 0x310 (8)
	struct UImage IMG_Medal3; // 0x318 (8)
	struct UPDTextBlock TB_Medal1; // 0x320 (8)
	struct UPDTextBlock TB_Medal2; // 0x328 (8)
	struct UPDTextBlock TB_Medal3; // 0x330 (8)
	struct UImage IMG_Ping_01; // 0x338 (8)
	struct UImage IMG_Ping_02; // 0x340 (8)
	struct UImage IMG_Ping_03; // 0x348 (8)
	struct UImage IMG_Ping_04; // 0x350 (8)
	struct UImage IMG_Ping_05; // 0x358 (8)
	struct TArray<struct UImage> PingImgList; // 0x360 (16)

	struct FEventReply OnDoubleClickItem(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function ProjectD.PDFindPartyListItem.OnDoubleClickItem(Final|Native|Private|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1822A20>
	void OnClickRecruitButton(); // Function ProjectD.PDFindPartyListItem.OnClickRecruitButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1822870>
};

// Class ProjectD.PDFindPartyPageUI
class UPDFindPartyPageUI : public UPDUserWidget {

public:

	struct UPDButton Btn_FindParty; // 0x288 (8)
	struct UPDButton BTN_RegisterMercenary; // 0x290 (8)
	struct UPDButton Btn_ResetBrick; // 0x298 (8)
	struct UWidgetSwitcher WS_FindParty; // 0x2A0 (8)
	struct UWidgetSwitcher WS_RegisterMercenary; // 0x2A8 (8)
	struct UWidgetSwitcher WS_Content; // 0x2B0 (8)
	struct UPDTextBlock TB_Title; // 0x2B8 (8)
	struct UTileView TV_Team; // 0x2C0 (8)
	struct UTileView TV_Person; // 0x2C8 (8)
	struct UHorizontalBox HB_Alert; // 0x2D0 (8)
	struct UPDButton BTN_FindPartyHome; // 0x2D8 (8)
	struct UCanvasPanel CP_BackFindParty; // 0x2E0 (8)
	struct UListView LV_PartyList; // 0x2E8 (8)
	struct UListView LV_RecruitList; // 0x2F0 (8)

	void OnSelectedTeamBrick(struct UPDBrickListItemData InListItemData); // Function ProjectD.PDFindPartyPageUI.OnSelectedTeamBrick(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1822FE0>
	void OnSelectedPersonBrick(struct UPDBrickListItemData InListItemData); // Function ProjectD.PDFindPartyPageUI.OnSelectedPersonBrick(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1822F60>
	void OnResetBrickClicked(); // Function ProjectD.PDFindPartyPageUI.OnResetBrickClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1822F20>
	void OnClickRegisterMercenaryButton(); // Function ProjectD.PDFindPartyPageUI.OnClickRegisterMercenaryButton(Final|Native|Public) // <VeiledExperts-Win64-Shipping.exe+0x1822890>
	void OnClickFindPartyHomeButton(); // Function ProjectD.PDFindPartyPageUI.OnClickFindPartyHomeButton(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18227F0>
	void OnClickFindPartyButton(); // Function ProjectD.PDFindPartyPageUI.OnClickFindPartyButton(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18227D0>
};

// Class ProjectD.PDFireRecoilAnimInstance
class UPDFireRecoilAnimInstance : public UPDPlayerAnimInstance {

public:

	struct UBlendSpace CurrentAnim; // 0x5E8 (8)
	struct UPDFireRecoilLevel FireRecoilLevel; // 0x5F0 (8)
};

// Class ProjectD.PDFireRecoilLevelData
class UPDFireRecoilLevelData : public UDataAsset {

public:

	struct UCurveFloat RecoilCurve; // 0x30 (8)
	struct UCurveFloat FractalCurve; // 0x38 (8)
	float PushingForce; // 0x40 (4)
	float PushingTime; // 0x44 (4)
	float RecoveryForce; // 0x48 (4)
	float RecoveryDelay; // 0x4C (4)
	float ZoomRateOnFire; // 0x50 (4)
	float ZoomDelayOnFire; // 0x54 (4)
	float ZoomDelayOnReleaseFire; // 0x58 (4)
	float ZoomInterpTimeOnFire; // 0x5C (4)
	float ZoomInterpTimeOnReleaseFire; // 0x60 (4)
	float MinX; // 0x64 (4)
	float MaxX; // 0x68 (4)
};

// Class ProjectD.PDFireRecoilLevel
class UPDFireRecoilLevel : public Object {

public:

	struct UPDFireRecoilLevelData RecoilData; // 0x28 (8)
	struct UPDFireRecoilLevelData OldRecoilData; // 0x30 (8)
	struct FVector2D Level; // 0x38 (8)
};

// Class ProjectD.PDFPPCamera
class APDFPPCamera : public UActor {

public:

	struct UCameraComponent Cam; // 0x220 (8)
	struct USkeletalMeshComponent CameraMesh; // 0x228 (8)
};

// Class ProjectD.PDFPWeapon
class APDFPWeapon : public UActor {

public:

	struct USceneComponent MoveControlComp; // 0x220 (8)
};

// Class ProjectD.PDFriendAddItemData
class UPDFriendAddItemData : public Object {

public:

	struct TArray<struct UPDFriendAddItemData> TreeChildren; // 0x78 (16)
};

// Class ProjectD.PDFriendAddItem
class UPDFriendAddItem : public UPDUserWidget {

public:

	struct UCanvasPanel CP_User; // 0x290 (8)
	struct UCanvasPanel CP_Category; // 0x298 (8)
	struct UBorder Background; // 0x2A0 (8)
	struct UImage IMG_Face; // 0x2A8 (8)
	struct UPDTextBlock TB_Nickname; // 0x2B0 (8)
	struct UImage IMG_ClanMarkBG; // 0x2B8 (8)
	struct UImage IMG_ClanMarkFG; // 0x2C0 (8)
	struct UPDTextBlock TB_ClanName; // 0x2C8 (8)
	struct UCanvasPanel CP_ClanMark; // 0x2D0 (8)
	struct UPDTextBlock TB_Category; // 0x2D8 (8)
	struct UPDButton BTN_Accept; // 0x2E0 (8)
	struct UPDButton BTN_Decline; // 0x2E8 (8)

	void OnDeclineClicked(); // Function ProjectD.PDFriendAddItem.OnDeclineClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1822A00>
	void OnAcceptClicked(); // Function ProjectD.PDFriendAddItem.OnAcceptClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18222F0>
};

// Class ProjectD.PDFriendAddPage
class UPDFriendAddPage : public UPDCommPage {

public:

	struct UEditableTextBox ET_NickName; // 0x290 (8)
	struct UPDButton BTN_Search; // 0x298 (8)

	void OnSearchNickClicked(); // Function ProjectD.PDFriendAddPage.OnSearchNickClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1822F40>
	void OnCommitSearchNick(struct FText& Text, enum class ETextCommit CommitMethod); // Function ProjectD.PDFriendAddPage.OnCommitSearchNick(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x18228D0>
	void OnChangeText(struct FText& InText); // Function ProjectD.PDFriendAddPage.OnChangeText(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x18226F0>
};

// Class ProjectD.PDFriendClanItemData
class UPDFriendClanItemData : public Object {

public:

	struct TArray<struct UPDFriendClanItemData> TreeChildren; // 0x68 (16)
};

// Class ProjectD.PDFriendClanItem
class UPDFriendClanItem : public UPDUserWidget {

public:

	struct UCanvasPanel CP_User; // 0x290 (8)
	struct UCanvasPanel CP_Category; // 0x298 (8)
	struct UBorder Background; // 0x2A0 (8)
	struct UImage IMG_Face; // 0x2A8 (8)
	struct UImage IMG_ClanMarkBG; // 0x2B0 (8)
	struct UImage IMG_ClanMarkFG; // 0x2B8 (8)
	struct UPDTextBlock TB_ClanName; // 0x2C0 (8)
	struct UPDTextBlock TB_Nickname; // 0x2C8 (8)
	struct UPDTextBlock TB_State; // 0x2D0 (8)
	struct UPDTextBlock TB_Category; // 0x2D8 (8)
	struct UHorizontalBox HB_UserData; // 0x2E0 (8)
	struct UImage IMG_Manner; // 0x2E8 (8)
	struct UImage IMG_Medal1; // 0x2F0 (8)
	struct UImage IMG_Medal2; // 0x2F8 (8)
	struct UImage IMG_Medal3; // 0x300 (8)
	struct UCanvasPanel CP_GradeNone; // 0x308 (8)
	struct UPDButton BTN_GradeNone; // 0x310 (8)
	struct UImage IMG_GradeNone; // 0x318 (8)
	struct UCanvasPanel CP_ToolTip; // 0x320 (8)

	void OnUnHoveredGradeNoneBtn(); // Function ProjectD.PDFriendClanItem.OnUnHoveredGradeNoneBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1823060>
	void OnHoveredGradeNoneBtn(); // Function ProjectD.PDFriendClanItem.OnHoveredGradeNoneBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1822E80>
};

// Class ProjectD.PDFriendListItemData
class UPDFriendListItemData : public Object {

public:

	struct TArray<struct UPDFriendListItemData> TreeChildren; // 0x90 (16)
};

// Class ProjectD.PDFriendListItem
class UPDFriendListItem : public UPDUserWidget {

public:

	struct UCanvasPanel CP_User; // 0x290 (8)
	struct UCanvasPanel CP_Category; // 0x298 (8)
	struct UBorder Background; // 0x2A0 (8)
	struct UImage IMG_Face; // 0x2A8 (8)
	struct UPDTextBlock TB_Nickname; // 0x2B0 (8)
	struct UImage IMG_ClanMarkBG; // 0x2B8 (8)
	struct UImage IMG_ClanMarkFG; // 0x2C0 (8)
	struct UPDTextBlock TB_ClanName; // 0x2C8 (8)
	struct UPDTextBlock TB_State; // 0x2D0 (8)
	struct UPDTextBlock TB_Category; // 0x2D8 (8)
	struct UHorizontalBox HB_UserData; // 0x2E0 (8)
	struct UImage IMG_Manner; // 0x2E8 (8)
	struct UImage IMG_Medal1; // 0x2F0 (8)
	struct UImage IMG_Medal2; // 0x2F8 (8)
	struct UImage IMG_Medal3; // 0x300 (8)
	struct UCanvasPanel CP_GradeNone; // 0x308 (8)
	struct UPDButton BTN_GradeNone; // 0x310 (8)
	struct UImage IMG_GradeNone; // 0x318 (8)
	struct UCanvasPanel CP_ToolTip; // 0x320 (8)

	void OnUnHoveredGradeNoneBtn(); // Function ProjectD.PDFriendListItem.OnUnHoveredGradeNoneBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1823060>
	void OnHoveredGradeNoneBtn(); // Function ProjectD.PDFriendListItem.OnHoveredGradeNoneBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1822E80>
};

// Class ProjectD.PDGameMapIconModule
class UPDGameMapIconModule : public UPDUserWidget {

public:

	struct UImage IMG_Icon; // 0x288 (8)
	struct UPDTextBlock TB_Label; // 0x290 (8)
};

// Class ProjectD.PDGameMapIconCamp
class UPDGameMapIconCamp : public UPDGameMapIconModule {

public:

	struct UImage IMG_Area; // 0x2A0 (8)
	struct UImage IMG_Shop; // 0x2A8 (8)
	struct UCanvasPanel CP_Info; // 0x2B0 (8)
	struct UPDGameMapIconCampDrawer CampDrawer; // 0x2B8 (8)
};

// Class ProjectD.PDGameMapIconCampDrawer
class UPDGameMapIconCampDrawer : public UPDUserWidget {

public:

	struct FSlateBrush AreaBrush; // 0x2B8 (136)
};

// Class ProjectD.PDGameMapIconDemolition
class UPDGameMapIconDemolition : public UPDGameMapIconModule {

public:

	struct UCanvasPanel CP_Reply; // 0x2A0 (8)
	struct UPDPingReplyUI Reply01; // 0x2A8 (8)
	struct UPDPingReplyUI Reply02; // 0x2B0 (8)
	struct UPDPingReplyUI Reply03; // 0x2B8 (8)
	struct UPDPingReplyUI Reply04; // 0x2C0 (8)
	struct UPDPingReplyUI Reply05; // 0x2C8 (8)
	struct TArray<struct UPDPingReplyUI> ReplyList; // 0x2D0 (16)
};

// Class ProjectD.PDGameMapIconFireSoundUI
class UPDGameMapIconFireSoundUI : public UPDGameMapIconModule {

public:

	struct USizeBox SB_Icon; // 0x2A0 (8)
};

// Class ProjectD.PDGameMapIconPing
class UPDGameMapIconPing : public UPDGameMapIconModule {

public:

	struct UCanvasPanel CP_Normal; // 0x2A0 (8)
	struct UImage IMG_IconFx; // 0x2A8 (8)
	struct UCanvasPanel CP_Item; // 0x2B0 (8)
	struct UImage IMG_Item; // 0x2B8 (8)
	struct UScaleBox SB_Weapon; // 0x2C0 (8)
	struct UImage IMG_Weapon; // 0x2C8 (8)
	struct UCanvasPanel CP_Info; // 0x2D0 (8)
	struct UBorder BD_UserColor; // 0x2D8 (8)
	struct UPDTextBlock TB_UserNum; // 0x2E0 (8)
};

// Class ProjectD.PDGameMapIconPlayerUI
class UPDGameMapIconPlayerUI : public UPDGameMapIconModule {

public:

	struct UCanvasPanel CP_Direction; // 0x2A0 (8)
	struct UCanvasPanel CP_Normal; // 0x2A8 (8)
	struct UBorder BD_Arrow; // 0x2B0 (8)
	struct UBorder BD_View; // 0x2B8 (8)
	struct UWidgetSwitcher WS_State; // 0x2C0 (8)
	struct UProgressBar PB_Groggy; // 0x2C8 (8)
	struct UPDTextBlock TB_Name; // 0x2D0 (8)
	struct UBorder BD_Fire; // 0x2D8 (8)
	struct UImage IMG_Speaking_Normal; // 0x2E0 (8)
	struct UImage IMG_Speaking_Groggy; // 0x2E8 (8)
	struct UImage IMG_Item; // 0x2F0 (8)
	struct UImage IMG_HasSeed; // 0x2F8 (8)
	struct UPaperSprite IMG_Rescue; // 0x300 (8)
	struct UPaperSprite IMG_ItemUse_Bandage; // 0x308 (8)
	struct UPaperSprite IMG_ItemUse_Astrapi; // 0x310 (8)
	struct UPaperSprite IMG_ItemUse_ArmorKit; // 0x318 (8)
};

// Class ProjectD.PDGameMapIconSafeZoneDrawer
class UPDGameMapIconSafeZoneDrawer : public UPDUserWidget {

public:

	enum class ESafeZoneDrawType DrawType; // 0x288 (1)
	struct TArray<struct FSafeZoneDrawing> Drawings; // 0x290 (16)
	bool DrawLineAntialias; // 0x2A0 (1)
	float DrawLineTickness; // 0x2A4 (4)
	bool bEdgeRounding; // 0x2A8 (1)
	float EdgeRoundingLen; // 0x2AC (4)
	int32_t EdgeRoundingSegment; // 0x2B0 (4)
};

// Class ProjectD.PDGameMapIconSafeZoneModule
class UPDGameMapIconSafeZoneModule : public UPDGameMapIconModule {

public:

	struct URetainerBox RB_Mask; // 0x2A0 (8)
	struct UCanvasPanel CP_Mask; // 0x2A8 (8)
	struct UImage IMG_Area; // 0x2B0 (8)
	struct UPDGameMapIconSafeZoneDrawer DrawerCurrent; // 0x2B8 (8)
	struct UPDGameMapIconSafeZoneDrawer DrawerNext; // 0x2C0 (8)
};

// Class ProjectD.PDGameMapModule
class UPDGameMapModule : public UPDUserWidget {

public:

	struct UImage IMG_Map; // 0x288 (8)
	struct UCanvasPanel CP_Map; // 0x290 (8)
	struct UCanvasPanel CP_Restriction; // 0x298 (8)
	enum class EMapShape MapShape; // 0x2A0 (1)
	enum class EWidgetClipping AreaClipping; // 0x2A1 (1)
	struct UClass* IconClassDefault; // 0x2A8 (8)
	struct TMap<enum class EMapObjectType, struct UClass*> IconClassMap; // 0x2B0 (80)
};

// Class ProjectD.PDGameModeSelectItemUI
class UPDGameModeSelectItemUI : public UPDUserWidget {

public:

	struct UImage IMG_Mode; // 0x2A0 (8)
	struct UPDButton GameModeButton; // 0x2A8 (8)

	void OnClick(); // Function ProjectD.PDGameModeSelectItemUI.OnClick(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826650>
};

// Class ProjectD.PDGameModeSelectUI
class UPDGameModeSelectUI : public UPDSceneBaseUI {

public:

	struct UTileView TV_GameModeList; // 0x288 (8)
	struct UPDButton Btn_GotoLobby; // 0x290 (8)

	void GotoLobby(); // Function ProjectD.PDGameModeSelectUI.GotoLobby(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1816850>
	void GameModeSelect(int32_t SelectModeID); // Function ProjectD.PDGameModeSelectUI.GameModeSelect(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826530>
};

// Class ProjectD.PDGameplayOptionUI
class UPDGameplayOptionUI : public UPDOptionUIBase {

public:

	struct UScrollBox SB_Gameplay; // 0x338 (8)
	struct UPDTabButton MouseSettingBtn; // 0x340 (8)
	struct UPDTabButton UISettingBtn; // 0x348 (8)

	void Onx80ZoomScopeChanged(float Value); // Function ProjectD.PDGameplayOptionUI.Onx80ZoomScopeChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18271A0>
	void Onx40ZoomScopeChanged(float Value); // Function ProjectD.PDGameplayOptionUI.Onx40ZoomScopeChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1827120>
	void Onx20ZoomScopeChanged(float Value); // Function ProjectD.PDGameplayOptionUI.Onx20ZoomScopeChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18270A0>
	void Onx160ZoomScopeChanged(float Value); // Function ProjectD.PDGameplayOptionUI.Onx160ZoomScopeChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1827020>
	void OnSubtitleUseChanged(bool Value); // Function ProjectD.PDGameplayOptionUI.OnSubtitleUseChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826F90>
	void OnSubtitlePlayerNumberUseChanged(bool Value); // Function ProjectD.PDGameplayOptionUI.OnSubtitlePlayerNumberUseChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826F00>
	void OnSubtitleBGAlphaChanged(float Value); // Function ProjectD.PDGameplayOptionUI.OnSubtitleBGAlphaChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826E80>
	void OnPingAutoHipFire(); // Function ProjectD.PDGameplayOptionUI.OnPingAutoHipFire(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826E60>
	void OnPingAutoEnabled(); // Function ProjectD.PDGameplayOptionUI.OnPingAutoEnabled(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826E40>
	void OnPingAutoDisabled(); // Function ProjectD.PDGameplayOptionUI.OnPingAutoDisabled(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826E20>
	void OnPingAutoAll(); // Function ProjectD.PDGameplayOptionUI.OnPingAutoAll(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826E00>
	void OnPingAutoAim(); // Function ProjectD.PDGameplayOptionUI.OnPingAutoAim(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826DE0>
	void OnParkourVisibilityChanged(bool Value); // Function ProjectD.PDGameplayOptionUI.OnParkourVisibilityChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826D50>
	void OnNormalSensitivityChanged(float Value); // Function ProjectD.PDGameplayOptionUI.OnNormalSensitivityChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826CD0>
	void OnMouseSmoothingChanged(bool Value); // Function ProjectD.PDGameplayOptionUI.OnMouseSmoothingChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826C40>
	void OnMouseSensitivityYChanged(float Value); // Function ProjectD.PDGameplayOptionUI.OnMouseSensitivityYChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826BC0>
	void OnMouseSensitivityXChanged(float Value); // Function ProjectD.PDGameplayOptionUI.OnMouseSensitivityXChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826B40>
	void OnMinimapRotationEnabled(); // Function ProjectD.PDGameplayOptionUI.OnMinimapRotationEnabled(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826B20>
	void OnMinimapRotationDisabled(); // Function ProjectD.PDGameplayOptionUI.OnMinimapRotationDisabled(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826B00>
	void OnIronsightSensitivityChanged(float Value); // Function ProjectD.PDGameplayOptionUI.OnIronsightSensitivityChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826A00>
	void OnIngameMapBGAlphaChanged(float Value); // Function ProjectD.PDGameplayOptionUI.OnIngameMapBGAlphaChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826980>
	void OnHUDScaleChanged(float Value); // Function ProjectD.PDGameplayOptionUI.OnHUDScaleChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18268A0>
	void OnHitIndicatorChangedBoth(); // Function ProjectD.PDGameplayOptionUI.OnHitIndicatorChangedBoth(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826960>
	void OnHitIndicatorChanged3D(); // Function ProjectD.PDGameplayOptionUI.OnHitIndicatorChanged3D(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826940>
	void OnHitIndicatorChanged2D(); // Function ProjectD.PDGameplayOptionUI.OnHitIndicatorChanged2D(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826920>
	void OnDamageSumView(); // Function ProjectD.PDGameplayOptionUI.OnDamageSumView(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826880>
	void OnDamageIndividualView(); // Function ProjectD.PDGameplayOptionUI.OnDamageIndividualView(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826860>
	void OnCrossHairColorChanged(struct FString sItem, enum class ESelectInfo SelType); // Function ProjectD.PDGameplayOptionUI.OnCrossHairColorChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826730>
	void OnClickUISettingButton(); // Function ProjectD.PDGameplayOptionUI.OnClickUISettingButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826710>
	void OnClickMouseSettingButton(); // Function ProjectD.PDGameplayOptionUI.OnClickMouseSettingButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1826690>
	void OnAimingSensitivityChanged(float Value); // Function ProjectD.PDGameplayOptionUI.OnAimingSensitivityChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18265B0>
};

// Class ProjectD.PDGameResultUI
class UPDGameResultUI : public UPDSceneBaseUI {

public:

	struct UPDTabButtonGroup MenuCategoryGroup; // 0x288 (8)
	struct UPDTabButton TBtn_TabMenu_01; // 0x290 (8)
	struct UPDTabButton TBtn_TabMenu_02; // 0x298 (8)
	struct UPDTabButton TBtn_TabMenu_03; // 0x2A0 (8)
	struct UCanvasPanel CP_Match; // 0x2A8 (8)
	struct UPDTextBlock TB_MatchMessage; // 0x2B0 (8)
	struct UPDTextBlock TB_MatchMessage_Fx_01; // 0x2B8 (8)
	struct UPDTextBlock TB_MatchMessage_Team; // 0x2C0 (8)
	struct UPDTextBlock TB_MatchMessage_Result; // 0x2C8 (8)
	struct UHorizontalBox HB_MatchRoundRoot; // 0x2D0 (8)
	struct UCanvasPanel CP_MatchTeam; // 0x2D8 (8)
	struct UCanvasPanel CP_MatchSolo; // 0x2E0 (8)
	struct UPDTextBlock TB_MatchScore_Rank; // 0x2E8 (8)
	float MatchRoundPadding; // 0x2F0 (4)
	float UserExpDetailPadding; // 0x2F4 (4)
	struct UWidgetSwitcher WS_ExpCase; // 0x2F8 (8)
	struct UWidgetSwitcher WS_StepType; // 0x300 (8)
	struct URichTextBlock RTB_GuideMessage; // 0x308 (8)
	struct UPDKeyButton KBtn_Close; // 0x310 (8)
	struct UPDKeyButton KBtn_Next; // 0x318 (8)
	struct UProgressBar PB_PrevExp; // 0x320 (8)
	struct UProgressBar PB_CurrentExp; // 0x328 (8)
	struct UPDTextBlock T_Level; // 0x330 (8)
	struct UPDTextBlock T_LevelUp; // 0x338 (8)
	struct UPDTextBlock T_Personal_CurrentLevel; // 0x340 (8)
	struct UPDTextBlock T_Personal_NextLevel; // 0x348 (8)
	struct UCanvasPanel CP_CurrentExp; // 0x350 (8)
	struct UCanvasPanel CP_PrevExp; // 0x358 (8)
	struct UPDTextBlock T_CurrentExp; // 0x360 (8)
	struct UPDTextBlock T_MaxExp; // 0x368 (8)
	struct UPDTextBlock T_CurrentExp1; // 0x370 (8)
	struct UHorizontalBox HB_Exp; // 0x378 (8)
	struct UPDResultTitleItem TitleItem0; // 0x380 (8)
	struct UPDResultTitleItem TitleItem1; // 0x388 (8)
	struct UPDResultTitleItem TitleItem2; // 0x390 (8)
	struct UPDResultTitleItem TitleItem3; // 0x398 (8)
	struct UPDResultTitleItem TitleItem4; // 0x3A0 (8)
	struct UPDResultRoundMenuItem RMI_MenuAll; // 0x3A8 (8)
	struct UPDResultRoundMenuItem RMI_Menu1; // 0x3B0 (8)
	struct UPDResultRoundMenuItem RMI_Menu2; // 0x3B8 (8)
	struct UPDResultRoundMenuItem RMI_Menu3; // 0x3C0 (8)
	struct UPDResultRoundMenuItem RMI_Menu4; // 0x3C8 (8)
	struct UPDResultRoundMenuItem RMI_Menu5; // 0x3D0 (8)
	struct UPDResultRoundMenuItem RMI_Menu6; // 0x3D8 (8)
	struct UPDResultRoundMenuItem RMI_Menu7; // 0x3E0 (8)
	struct UPDResultRoundMenuItem RMI_Menu8; // 0x3E8 (8)
	struct UPDResultRoundMenuItem RMI_Menu9; // 0x3F0 (8)
	struct UPDResultTeamScore RTS_List1; // 0x3F8 (8)
	struct UPDResultTeamScore RTS_List2; // 0x400 (8)
	struct UPDResultRankScore RankScore; // 0x408 (8)
	struct UPDRoundReplayer RoundReplayer; // 0x410 (8)
	struct UWidgetSwitcher WS_Summary_ResultCase; // 0x418 (8)
	struct UImage IMG_ScoreBoard_MatchResult; // 0x420 (8)
	struct UPDTextBlock T_MatchInfo_Mode; // 0x428 (8)
	struct UPDTextBlock T_MatchInfo_Match; // 0x430 (8)
	struct UPDTextBlock T_MatchInfo_Level; // 0x438 (8)
	struct UPDTextBlock T_MatchInfo_Time; // 0x440 (8)
	struct UCanvasPanel CP_ScoreBoard_MatchTeam; // 0x448 (8)
	struct UPDTextBlock T_ScoreBoard_MatchScore_Ally; // 0x450 (8)
	struct UPDTextBlock T_ScoreBoard_MatchScore_Enemy; // 0x458 (8)
	struct UCanvasPanel CP_ScoreBoard_MatchSolo; // 0x460 (8)
	struct UPDTextBlock T_ScoreBoard_MatchScore_Rank; // 0x468 (8)
	struct UCanvasPanel CP_ScoreList; // 0x470 (8)
	struct UPDResultRoundPlayerList RRP_List1; // 0x478 (8)
	struct UPDResultRoundPlayerList RRP_List2; // 0x480 (8)
	struct UPDResultRewardItem RRI_Lepton1; // 0x488 (8)
	struct UPDResultRewardItem RRI_Lepton2; // 0x490 (8)
	struct TArray<struct UPDResultRoundMenuItem> RoundMenuItems; // 0x498 (16)
	struct TArray<struct UPDResultTitleItem> TitleItems; // 0x4A8 (16)
	struct UImage IMG_FX_TitleBg_Wings; // 0x4B8 (8)
	struct UImage IMG_FX_TitleBg_LWing_01; // 0x4C0 (8)
	struct UImage IMG_FX_TitleBg_LWing_02; // 0x4C8 (8)
	struct UImage IMG_FX_TitleBg_RWing_01; // 0x4D0 (8)
	struct UImage IMG_FX_TitleBg_RWing_02; // 0x4D8 (8)
	struct UPDTextBlock TB_MatchScore_Ally; // 0x4E0 (8)
	struct UPDTextBlock TB_MatchScore_Enemy; // 0x4E8 (8)
	struct UWidgetSwitcher WS_ScoreBoard_MatchResult; // 0x4F0 (8)
	struct UCanvasPanel CP_ToolTip; // 0x4F8 (8)
	struct UPDTextBlock TB_DataName; // 0x500 (8)
	struct UPDTextBlock TB_DataValue; // 0x508 (8)

	void OnMenuItemClicked(int32_t InMenuIndex); // Function ProjectD.PDGameResultUI.OnMenuItemClicked(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1826A80>
	void OnClickTitle(); // Function ProjectD.PDGameResultUI.OnClickTitle(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18266F0>
	void OnClickScoreBoard(); // Function ProjectD.PDGameResultUI.OnClickScoreBoard(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18266D0>
	void OnClickProgress(); // Function ProjectD.PDGameResultUI.OnClickProgress(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18266B0>
	void OnClickEsc(); // Function ProjectD.PDGameResultUI.OnClickEsc(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1826670>
	void OnChangeNextStep(); // Function ProjectD.PDGameResultUI.OnChangeNextStep(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1826630>
};

// Class ProjectD.PDGameTimeUI
class UPDGameTimeUI : public UPDIngameModeWidget {

public:

	struct UCanvasPanel CP_PlayTime; // 0x290 (8)
	struct UPanelWidget PW_PlayTimeNum; // 0x298 (8)
	struct UPDTextBlock TB_PlayTimeMin; // 0x2A0 (8)
	struct UPDTextBlock TB_PlayTimeSec; // 0x2A8 (8)
	struct UPDTextBlock TB_PlayTimeComma; // 0x2B0 (8)
	struct FLinearColor NormalTimeColor; // 0x2B8 (16)
	struct FLinearColor WarningTimeColor1; // 0x2C8 (16)
	struct FLinearColor WarningTimeColor2; // 0x2D8 (16)
	int32_t WarningPlayTime; // 0x2E8 (4)
	int32_t EmergencyPlayTime; // 0x2EC (4)
};

// Class ProjectD.PDGBOChildActorComponent
class UPDGBOChildActorComponent : public UChildActorComponent {

public:

	bool RootNode; // 0x220 (1)
};

// Class ProjectD.PDGrenadeIndicatorUI
class UPDGrenadeIndicatorUI : public UPDHUDIconBaseUI {

public:

	struct UBorder BD_OutArrow; // 0x2A0 (8)
};

// Class ProjectD.PDGroupBreakableObject
class APDGroupBreakableObject : public UActor {

public:

	struct TArray<struct UPDGBOChildActorComponent> ChildActorList; // 0x230 (16)
	struct TArray<struct UStaticMeshComponent> StepMeshList; // 0x240 (16)
	enum class GBOStep EditStep; // 0x250 (1)
};

// Class ProjectD.PDHideWeaponAnimNotify
class UPDHideWeaponAnimNotify : public UPDBaseAnimNotify {

public:

	enum class EInventorySlot TargetSlot; // 0x48 (1)
	bool Hidden; // 0x49 (1)
};

// Class ProjectD.PDHitFeedBackUI
class UPDHitFeedBackUI : public UPDUserWidget {

public:

	struct USizeBox SB_FeedBackIcon; // 0x288 (8)
	struct UImage IMG_FeedBackIcon; // 0x290 (8)
	struct TMap<enum class EPDHitFeedBackType, struct FHitFeedbackIcon> IconMap; // 0x298 (80)
};

// Class ProjectD.PDHitReactionAnimInstance
class UPDHitReactionAnimInstance : public UPDAnimInstance {

public:

	enum class EPDAimingState AimingState; // 0x280 (1)
	enum class EPDStanceState StanceState; // 0x281 (1)
	enum class EPDLocoType LocoType; // 0x282 (1)
	bool bOverrideUpper; // 0x283 (1)
	enum class EPDHitReactionAnimType HitReactionAnimType; // 0x284 (1)
	struct FRotator HitReactionRotation; // 0x288 (12)
	struct UAnimMontage CurrentPlayingHitMontage; // 0x298 (8)
};

// Class ProjectD.PDHitReactionNotifyState
class UPDHitReactionNotifyState : public UAnimNotifyState {

public:

	struct FName BeginEventName; // 0x30 (8)
	struct FName EndEventName; // 0x38 (8)
};

// Class ProjectD.PDIKAnimInstance
class UPDIKAnimInstance : public UPDAnimInstance {

public:

	struct FPDPWUsingInABPAnimDatas PWAnimDatas; // 0x288 (296)
	bool WStanceIsValid; // 0x3B0 (1)
	bool SWStanceIsValid; // 0x3B1 (1)
	struct FPDPerSpecificWeaponAnimDatas PSpecificWeaponAnimDatas; // 0x3B8 (200)
	bool MirrorFinalPose; // 0x480 (1)
	float AimInterpTime; // 0x484 (4)
	bool bAimingIdleState; // 0x488 (1)
	float IKInterpSpeed; // 0x48C (4)
	float MaxLookAtDistance; // 0x490 (4)
	float MinLookAtDistance; // 0x494 (4)
	enum class ECollisionChannel LookAtTraceChannel; // 0x498 (1)
	struct UMeshComponent WeaponMeshComponent; // 0x4B0 (8)
	struct FPDIKAnimInstanceProxy Proxy; // 0x4C0 (2976)
};

// Class ProjectD.PDImage
class UPDImage : public UImage {

public:

	bool bPixelSnapping; // 0x210 (1)

	void SetPixelSnapping(bool bInPixelSnapping); // Function ProjectD.PDImage.SetPixelSnapping(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x182B100>
};

// Class ProjectD.PDImageButton
class UPDImageButton : public UPDUserWidget {

public:

	struct UImage IMG_Button; // 0x288 (8)
};

// Class ProjectD.PDIngameLaptonPresetTab
class UPDIngameLaptonPresetTab : public UPDUserWidget {

public:

	struct UPDTabButton Tab_Preset; // 0x298 (8)

	void OnSelectPreset(); // Function ProjectD.PDIngameLaptonPresetTab.OnSelectPreset(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x182B030>
};

// Class ProjectD.PDIngameMapModule
class UPDIngameMapModule : public UPDGameMapModule {

public:

	struct UCanvasPanel CP_Area; // 0x3C0 (8)
	struct UCanvasPanel PaintZone; // 0x3C8 (8)
	struct UBorder BD_BackColor; // 0x3D0 (8)
	struct UImage IMG_Sight; // 0x3D8 (8)
	float ZoomStepScale; // 0x3E0 (4)
	int32_t ZoomStepCount; // 0x3E4 (4)
	float ZoomInterval; // 0x3E8 (4)
	float ZoomRate; // 0x3EC (4)
	float PlayerIconSightRadius; // 0x3F0 (4)
};

// Class ProjectD.PDIngameMapUI
class UPDIngameMapUI : public UPDIngameModeWidget {

public:

	struct UPDIngameMapModule GameMap; // 0x290 (8)
	struct UCanvasPanel CP_MapBox; // 0x298 (8)
	struct UCanvasPanel CP_Map; // 0x2A0 (8)
	struct UCanvasPanel CP_GameMap; // 0x2A8 (8)
	struct UPDTextBlock TB_Time; // 0x2B0 (8)
	struct UPDTextBlock TB_Coordinates; // 0x2B8 (8)
	struct UImage IMG_Weather; // 0x2C0 (8)
	struct UHorizontalBox HB_Weather; // 0x2C8 (8)
	struct UWidgetSwitcher WS_Menu; // 0x2D0 (8)
	struct UCanvasPanel CP_Guide; // 0x2D8 (8)
	struct UBorder BD_Menu; // 0x2E0 (8)
	struct UImage IMG_MapShadow; // 0x2E8 (8)
	struct UCanvasPanel CP_NewBadge; // 0x2F0 (8)
	struct UCanvasPanel CP_MouseGuideLine; // 0x2F8 (8)
	struct UImage IMG_MouseX; // 0x300 (8)
	struct UImage IMG_MouseY; // 0x308 (8)
	struct UCheckBox CB_ToggleBoard; // 0x310 (8)
	struct UPDButton Btn_DeleteAllLine; // 0x318 (8)
	struct UPDTextBlock TB_Key_Scale; // 0x320 (8)
	struct UPDTextBlock TB_Key_DeletePing; // 0x328 (8)
	bool DefaultLarge; // 0x330 (1)
	float LargeMapOffset; // 0x334 (4)
	struct FVector2D NormalMapSize; // 0x338 (8)
	struct FVector2D NormalGameMapSize; // 0x340 (8)
	struct FVector2D NormalMapBoxPos; // 0x348 (8)
	struct FVector2D NormalMenuPos; // 0x350 (8)
	struct FVector2D NormalMenuSize; // 0x358 (8)
	struct FVector2D NormalShadowPos; // 0x360 (8)
	struct FVector2D NormalShadowSize; // 0x368 (8)
	struct FVector2D MediumMapSize; // 0x370 (8)
	struct FVector2D MediumGameMapSize; // 0x378 (8)
	struct FVector2D MediumMapBoxPos; // 0x380 (8)
	struct FVector2D MediumMenuPos; // 0x388 (8)
	struct FVector2D MediumMenuSize; // 0x390 (8)
	struct FVector2D MediumShadowPos; // 0x398 (8)
	struct FVector2D MediumShadowSize; // 0x3A0 (8)
	struct FVector2D LargeMapSize; // 0x3A8 (8)
	struct FVector2D LargeGameMapSize; // 0x3B0 (8)
	struct FVector2D LargeMapBoxPos; // 0x3B8 (8)
	struct FVector2D LargeMenuPos; // 0x3C0 (8)
	struct FVector2D LargeMenuSize; // 0x3C8 (8)
	struct FVector2D LargeShadowPos; // 0x3D0 (8)
	struct FVector2D LargeShadowSize; // 0x3D8 (8)
	struct FPDIngameMapPos StatusBoardPos; // 0x3E0 (40)
	struct FPDIngameMapPos BasePos; // 0x408 (40)

	void OnToggleBoardCheckBoxChanged(bool Val); // Function ProjectD.PDIngameMapUI.OnToggleBoardCheckBoxChanged(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x182B070>
	void OnClickDeleteAllLines(); // Function ProjectD.PDIngameMapUI.OnClickDeleteAllLines(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x182AE50>
};

// Class ProjectD.PDIngameMyCharListItem
class UPDIngameMyCharListItem : public UPDUserWidget {

public:

	struct UPDTabButton Btn_Select; // 0x2A0 (8)
	struct UWidgetSwitcher WS_State; // 0x2A8 (8)
	struct UImage IMG_Face; // 0x2B0 (8)
	struct UImage IMG_NotOwnedFace; // 0x2B8 (8)

	void OnSelectChar(); // Function ProjectD.PDIngameMyCharListItem.OnSelectChar(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x182B010>
};

// Class ProjectD.PDIngamePlayerController
class APDIngamePlayerController : public APDPlayerController {

public:

	bool bUseViewTargetWithBlend; // 0x5A0 (1)
	struct UPDInputBuffer InputBuffer; // 0x628 (8)
};

// Class ProjectD.PDIngameStatusBoardUI
class UPDIngameStatusBoardUI : public UPDIngameModeWidget {

public:

	struct UPDKeyButton KBtn_Close; // 0x290 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_2; // 0x298 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_3; // 0x2A0 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_4; // 0x2A8 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_5; // 0x2B0 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_6; // 0x2B8 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_7; // 0x2C0 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_8; // 0x2C8 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_9; // 0x2D0 (8)
	struct UPDStatusBoardRoundResultItem RoundResultItem_10; // 0x2D8 (8)
	struct TArray<struct UPDStatusBoardRoundResultItem> RoundResultList; // 0x2E0 (16)
	struct UPDTextBlock TB_TeamName_Ally; // 0x2F0 (8)
	struct UPDTextBlock TB_TeamName_Enemy; // 0x2F8 (8)
	struct UImage IMG_InfoBoardBg_Ally; // 0x300 (8)
	struct UImage IMG_InfoBoardTLine_Ally; // 0x308 (8)
	struct UImage IMG_InfoBoardBLine_Ally; // 0x310 (8)
	struct UImage IMG_InfoBoardBg_Enemy; // 0x318 (8)
	struct UImage IMG_InfoBoardTLine_Enemy; // 0x320 (8)
	struct UImage IMG_InfoBoardBLine_Enemy; // 0x328 (8)
	struct UPDStatusBoardPlayerInfo_Ally PlayerInfo_Ally_01; // 0x330 (8)
	struct UPDStatusBoardPlayerInfo_Ally PlayerInfo_Ally_02; // 0x338 (8)
	struct UPDStatusBoardPlayerInfo_Ally PlayerInfo_Ally_03; // 0x340 (8)
	struct UPDStatusBoardPlayerInfo_Ally PlayerInfo_Ally_04; // 0x348 (8)
	struct UPDStatusBoardPlayerInfo_Ally PlayerInfo_Ally_05; // 0x350 (8)
	struct TArray<struct UPDStatusBoardPlayerInfo_Ally> MyTeamPlayerInfoList; // 0x358 (16)
	struct UPDStatusBoardPlayerInfo_Enemy PlayerInfo_Enemy_01; // 0x368 (8)
	struct UPDStatusBoardPlayerInfo_Enemy PlayerInfo_Enemy_02; // 0x370 (8)
	struct UPDStatusBoardPlayerInfo_Enemy PlayerInfo_Enemy_03; // 0x378 (8)
	struct UPDStatusBoardPlayerInfo_Enemy PlayerInfo_Enemy_04; // 0x380 (8)
	struct UPDStatusBoardPlayerInfo_Enemy PlayerInfo_Enemy_05; // 0x388 (8)
	struct TArray<struct UPDStatusBoardPlayerInfo_Enemy> EnemyTeamPlayerInfoList; // 0x390 (16)
	struct UPDTextBlock T_AllyTeamCoin; // 0x3A0 (8)
	struct UPDTextBlock T_EnemyTeamCoin; // 0x3A8 (8)
	struct UPDUnKnownMarketUpgradeSlot Upgrade_Armory_Ally; // 0x3B0 (8)
	struct UPDUnKnownMarketUpgradeSlot Upgrade_Ordnance_Ally; // 0x3B8 (8)
	struct UPDUnKnownMarketUpgradeSlot Upgrade_Tactical_Ally; // 0x3C0 (8)
	struct UPDUnKnownMarketUpgradeSlot Upgrade_Armory_Enemy; // 0x418 (8)
	struct UPDUnKnownMarketUpgradeSlot Upgrade_Ordnance_Enemy; // 0x420 (8)
	struct UPDUnKnownMarketUpgradeSlot Upgrade_Tactical_Enemy; // 0x428 (8)
	struct UPDUnKnownMarketUpgradeTooltip StatusBoardUpgradeTooltip; // 0x480 (8)
	struct UPDButton Btn_Replay; // 0x488 (8)
	struct UPDButton Btn_Replay_Close; // 0x490 (8)
	struct FVector2D AllyUpgradeTooltipPos; // 0x498 (8)
	struct FVector2D AllyUpgradeTooltipAlignment; // 0x4A0 (8)
	struct FVector2D EnemyUpgradeTooltipPos; // 0x4A8 (8)
	struct FVector2D EnemyUpgradeTooltipAlignment; // 0x4B0 (8)

	void OnClickReplayClose(); // Function ProjectD.PDIngameStatusBoardUI.OnClickReplayClose(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x182AE90>
	void OnClickReplay(); // Function ProjectD.PDIngameStatusBoardUI.OnClickReplay(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x182AE70>
	void OnClickCloseBtn(); // Function ProjectD.PDIngameStatusBoardUI.OnClickCloseBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
};

// Class ProjectD.PDIngameUI
class UPDIngameUI : public UPDSceneBaseUI {

public:

	struct UCanvasPanel CP_GameMode; // 0x288 (8)
	struct UPDBaseModeUI ModeUI; // 0x290 (8)
	struct UScaleBox IngameUIScale; // 0x2C8 (8)
	struct TArray<struct UPDTextBlock> KeyTextBlockList; // 0x2D8 (16)
	struct TArray<struct UPDKeyButton> KeyButtonList; // 0x2E8 (16)
	struct TArray<struct UScaleBox> NoneScaleUIList; // 0x2F8 (16)

	void OnTimerRingCommand(); // Function ProjectD.PDIngameUI.OnTimerRingCommand(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x182B050>
};

// Class ProjectD.PDIngameVideoUI
class UPDIngameVideoUI : public UPDUserWidget {

public:

	struct UMediaPlayer MediaPlayer; // 0x288 (8)
	struct UMediaPlayer MediaPlayerDestroy; // 0x290 (8)
	struct UPDTextBlock TB_IntroTitle; // 0x298 (8)
	struct UPDTextBlock TB_IntroDesc01; // 0x2A0 (8)
	struct UPDTextBlock TB_IntroDesc02; // 0x2A8 (8)
	struct UProgressBar PB_Skip; // 0x2B0 (8)
	struct UCanvasPanel CP_MovieInfo; // 0x2B8 (8)
	struct UCanvasPanel CP_Skip; // 0x2C0 (8)
	struct UImage IMG_MovieInfo_Divider_01; // 0x2C8 (8)
	struct UImage IMG_Movie; // 0x2D0 (8)
	struct UImage IMG_Blind; // 0x2D8 (8)
	float FirstDelay; // 0x2E0 (4)
	float CharInterval; // 0x2E4 (4)
	float LineInterval; // 0x2E8 (4)

	void OnMovieOpened(); // Function ProjectD.PDIngameVideoUI.OnMovieOpened(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x182AFF0>
	void OnInitMediaPlayer(); // Function ProjectD.PDIngameVideoUI.OnInitMediaPlayer(Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
};

// Class ProjectD.PDInputKeySelector
class UPDInputKeySelector : public UPDUserWidget {

public:

	struct UInputKeySelector IKS_Control; // 0x288 (8)
	char IsPressed : 1; // 0x290 (1)

	void OnInputSelectingKeyChanged(); // Function ProjectD.PDInputKeySelector.OnInputSelectingKeyChanged(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x182AFD0>
	void OnInputKeySelected(struct FInputChord InInputChord); // Function ProjectD.PDInputKeySelector.OnInputKeySelected(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x182AEB0>
};

// Class ProjectD.PDInteractionInfoUI
class UPDInteractionInfoUI : public UPDIngameModeWidget {

public:

	struct UCanvasPanel CP_Progress; // 0x290 (8)
	struct UImage IMG_Icon; // 0x298 (8)
	struct UPDCircleProgressModule CPM_Progress; // 0x2A0 (8)
	struct UCanvasPanel CP_SeedProgress; // 0x2A8 (8)
	struct UPDSeedProgressModule SSM_Progress; // 0x2B0 (8)
	struct UHorizontalBox HB_Info; // 0x2B8 (8)
	struct UPDTextBlock TB_Key; // 0x2C0 (8)
	struct UPDTextBlock TB_Desc; // 0x2C8 (8)
	struct USizeBox SB_ItemInfo; // 0x2D0 (8)
	struct UPDTextBlock TB_Key_3; // 0x2D8 (8)
	struct UPDTextBlock TB_Desc_3; // 0x2E0 (8)
	struct UImage IMG_ItemIcon; // 0x2E8 (8)
	struct USizeBox SB_ItemCount; // 0x2F0 (8)
	struct UPDTextBlock TB_ItemCount; // 0x2F8 (8)
	struct UPDTextBlock TB_ItemName; // 0x300 (8)
	struct UPDTextBlock TB_ItemType; // 0x308 (8)
	struct UImage IMG_BulletType; // 0x310 (8)
	struct UHorizontalBox HB_KeyGuide; // 0x318 (8)
	struct UPDTextBlock TB_Guide_Key; // 0x320 (8)
	struct UPDTextBlock TB_Guide_Desc; // 0x328 (8)
	struct USizeBox SB_KeyGuide; // 0x330 (8)
	struct UImage IMG_GuideMouseLeft; // 0x338 (8)
	struct UHorizontalBox HB_Mode_Info; // 0x348 (8)
	struct UPDTextBlock TB_Mode_Key; // 0x350 (8)
	struct UPDTextBlock TB_Mode_Desc; // 0x358 (8)
	struct UHorizontalBox HB_Info_2; // 0x360 (8)
	struct UPDTextBlock TB_Key_2; // 0x368 (8)
	struct UPDTextBlock TB_Desc_2; // 0x370 (8)
	struct UHorizontalBox HB_Tip; // 0x378 (8)
	struct UPDTextBlock TB_Desc_Tip; // 0x380 (8)
};

// Class ProjectD.PDIntroUI
class UPDIntroUI : public UPDSceneBaseUI {

public:

	struct UBorder B_MovieBG; // 0x288 (8)
	struct UWidget IMG_Movie; // 0x290 (8)
	struct UProgressBar PB_Skip; // 0x298 (8)
	struct UCanvasPanel CP_Skip; // 0x2A0 (8)
	struct UMediaPlayer LoginMediaPlayer; // 0x2A8 (8)
	bool DoorMoviePlay; // 0x2B0 (1)
	float DelayTime; // 0x2B4 (4)
	struct FKey HoldKey; // 0x2B8 (24)

	void OnMovieOpened(); // Function ProjectD.PDIntroUI.OnMovieOpened(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x182E630>
	void OnMovieClosed(); // Function ProjectD.PDIntroUI.OnMovieClosed(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x182E610>
	void OnInitMediaPlayer(); // Function ProjectD.PDIntroUI.OnInitMediaPlayer(Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
};

// Class ProjectD.PDInvenDivide
class UPDInvenDivide : public UPDUserWidget {

public:

	struct UPDTextBlock TB_Title; // 0x288 (8)
	struct UImage IMG_BeforeItem; // 0x290 (8)
	struct UPDTextBlock TB_BeforeCount; // 0x298 (8)
	struct UImage IMG_AfterItem; // 0x2A0 (8)
	struct UEditableText ETxt_DividCnt; // 0x2A8 (8)
	struct USlider SD_Count; // 0x2B0 (8)
	struct UPDButton PDBTN_Split; // 0x2B8 (8)
	struct UPDButton PDBTN_Cancel; // 0x2C0 (8)

	void OnDividTextInput(struct FText& InText); // Function ProjectD.PDInvenDivide.OnDividTextInput(Final|Native|Private|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x182E510>
	void OnDividTextChanged(struct FText& InText, enum class ETextCommit CommitMethod); // Function ProjectD.PDInvenDivide.OnDividTextChanged(Final|Native|Private|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x182E3E0>
	void OnClickSplitBtn(); // Function ProjectD.PDInvenDivide.OnClickSplitBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x182E360>
	void OnClickCancelBtn(); // Function ProjectD.PDInvenDivide.OnClickCancelBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x182E2E0>
	void ChangeVolume(float InVolume); // Function ProjectD.PDInvenDivide.ChangeVolume(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x182E070>
};

// Class ProjectD.PDInvenDrag
class UPDInvenDrag : public UPDUserWidget {

public:

	struct UImage IMG_ItemImg; // 0x288 (8)
	struct UBorder BD_DivideDesc; // 0x290 (8)
	struct UTextBlock TB_DivideDesc; // 0x298 (8)
	struct UBorder BD_ItemBg; // 0x2A0 (8)
	struct UVerticalBox VB_DragItem; // 0x2A8 (8)
};

// Class ProjectD.PDInvenListItem
class UPDInvenListItem : public UPDUserWidget {

public:

	struct UDragDropOperation DragDropOperation; // 0x290 (8)
	struct UWidgetSwitcher WS_ListItem; // 0x298 (8)
	struct UImage IMG_ItemImg; // 0x2A0 (8)
	struct UPDTextBlock TB_ItemName; // 0x2A8 (8)
	struct UPDTextBlock TB_ItemNum; // 0x2B0 (8)
	struct UPDTextBlock TB_Title; // 0x2B8 (8)
	struct UPDTextBlock TB_Property; // 0x2C0 (8)
	struct UCanvasPanel CP_Progress; // 0x2C8 (8)
	struct UProgressBar PB_ItemProgress; // 0x2D0 (8)
	struct UBorder BD_ProgressTXT; // 0x2D8 (8)
	struct UImage IMG_Unusable; // 0x2E0 (8)
	struct UImage IMG_Equipped; // 0x2E8 (8)
	struct UBorder BD_Item_Bg; // 0x2F0 (8)
	struct UCanvasPanel CP_Dragable; // 0x2F8 (8)
	struct UCanvasPanel CP_Refund; // 0x300 (8)
	struct UPDButton Btn_Refund; // 0x308 (8)
	struct UImage IMG_Highlight_Tutorial; // 0x310 (8)
	struct UBorder BD_TitleBg; // 0x328 (8)
	struct FLinearColor BasicBGColor; // 0x330 (16)
	struct FLinearColor HoverBGColor; // 0x340 (16)
	struct FLinearColor NormalBunchColor; // 0x350 (16)
	struct FLinearColor MaxBunchColor; // 0x360 (16)

	void RefundItem(); // Function ProjectD.PDInvenListItem.RefundItem(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x182E6B0>
};

// Class ProjectD.PDInvenToolTipModule
class UPDInvenToolTipModule : public UPDUserWidget {

public:

	struct UWidgetSwitcher WS_ToolTip; // 0x288 (8)
	struct UTextBlock TB_ItemName; // 0x290 (8)
	struct UTextBlock TB_Type; // 0x298 (8)
	struct UImage IMG_Type; // 0x2A0 (8)
	struct UTextBlock TB_ItemDesc; // 0x2A8 (8)
	struct UProgressBar PB_Damage; // 0x2B0 (8)
	struct UProgressBar PB_Range; // 0x2B8 (8)
	struct UProgressBar PB_Precision; // 0x2C0 (8)
	struct UProgressBar PB_Recoil; // 0x2C8 (8)
	struct UProgressBar PB_Firearms; // 0x2D0 (8)
	struct UProgressBar PB_AimingSpeed; // 0x2D8 (8)
	struct UTextBlock TB_Ammo; // 0x2E0 (8)
	struct UTextBlock TB_Magazine; // 0x2E8 (8)
};

// Class ProjectD.PDOKCancelPopupUI
class UPDOKCancelPopupUI : public UPDPopupBaseUI {

public:

	struct UPDTextBlock Desc; // 0x2B8 (8)
	struct UPDTextBlock Desc2; // 0x2C0 (8)
	struct UPDButton OKBtn; // 0x2C8 (8)
	struct UPDButton CancelBtn; // 0x2D0 (8)
};

// Class ProjectD.PDItemModel
class APDItemModel : public UActor {

public:

	struct TArray<struct UMaterialInstanceDynamic> ItemBaseMaterials; // 0x220 (16)
	struct USceneComponent EmptySceneComp; // 0x280 (8)
	struct UStaticMeshComponent StaticMeshComp; // 0x288 (8)
	struct UPDSkeletalMeshComponent SkeletalMeshComp; // 0x290 (8)

	void OnBeginOverlapAssistant(struct UPrimitiveComponent OverlappedComponent, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function ProjectD.PDItemModel.OnBeginOverlapAssistant(Final|Native|Public|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x182E0F0>
};

// Class ProjectD.PDKeyButton
class UPDKeyButton : public UPDButton {

public:

	struct UPDTextBlock T_SubText; // 0xC50 (8)
	struct USizeBox SB_Btn; // 0xC58 (8)
	struct FText ControlName; // 0xC60 (24)
	struct FText InSubText; // 0xC78 (24)
	struct FSlateFontInfo SubTextFont; // 0xC90 (80)
	struct FSlateColor NormalSubTextColor; // 0xCE0 (40)
	struct FSlateColor HoverSubTextColor; // 0xD08 (40)
	struct FSlateColor PressSubTextColor; // 0xD30 (40)
	struct FSlateColor DisableSubTextColor; // 0xD58 (40)
	struct FMargin SubTextMargin; // 0xD80 (16)
	char bOverride_WidthOverride : 1; // 0xD90 (1)
	char bOverride_HeightOverride : 1; // 0xD90 (1)
	char bOverride_MinDesiredWidth : 1; // 0xD90 (1)
	char bOverride_MinDesiredHeight : 1; // 0xD90 (1)
	char bOverride_MaxDesiredWidth : 1; // 0xD90 (1)
	char bOverride_MaxDesiredHeight : 1; // 0xD90 (1)
	char bOverride_MinAspectRatio : 1; // 0xD90 (1)
	char bOverride_MaxAspectRatio : 1; // 0xD90 (1)
	float WidthOverride; // 0xD94 (4)
	float HeightOverride; // 0xD98 (4)
	float MinDesiredWidth; // 0xD9C (4)
	float MinDesiredHeight; // 0xDA0 (4)
	float MaxDesiredWidth; // 0xDA4 (4)
	float MaxDesiredHeight; // 0xDA8 (4)
	float MinAspectRatio; // 0xDAC (4)
	float MaxAspectRatio; // 0xDB0 (4)
};

// Class ProjectD.PDKillLogModule
class UPDKillLogModule : public UPDUserWidget {

public:

	struct UPDTextBlock TB_Attacker; // 0x290 (8)
	struct UPDTextBlock TB_Victim; // 0x298 (8)
	struct UBorder BD_Attacker; // 0x2A0 (8)
	struct UImage IMG_Attacker; // 0x2A8 (8)
	struct UImage IMG_Victim; // 0x2B0 (8)
	struct UBorder BD_Victim; // 0x2B8 (8)
	struct UPDTextBlock T_Dist; // 0x2C0 (8)
	struct UImage IMG_Cause; // 0x2C8 (8)
	struct USizeBox SB_Cause; // 0x2D0 (8)
	struct UImage IMG_HeadShot; // 0x2D8 (8)
	struct UImage IMG_Groggy; // 0x2E0 (8)
	struct UImage IMG_Death; // 0x2E8 (8)
	struct UImage IMG_Assist; // 0x2F0 (8)
	struct UBorder BD_Background; // 0x2F8 (8)
	struct UBorder BD_PlayerLine; // 0x300 (8)
	struct UImage IMG_MainPlayerBG; // 0x308 (8)

	void AdjustCauseRatio(); // Function ProjectD.PDKillLogModule.AdjustCauseRatio(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x182E050>
};

// Class ProjectD.PDKillLogUI
class UPDKillLogUI : public UPDIngameModeWidget {

public:

	struct UVerticalBox VB_LogList; // 0x290 (8)
	int32_t MaxLogCount; // 0x298 (4)
	float LogDuration; // 0x29C (4)
};

// Class ProjectD.PDKillMessage
class UPDKillMessage : public UPDIngameModeWidget {

public:

	struct UPDTextBlock TB_KillType; // 0x298 (8)
	struct UPDTextBlock TB_UserName; // 0x2A0 (8)
	struct UImage IMG_Portrait; // 0x2A8 (8)
	struct UBorder BD_TeamColor; // 0x2B0 (8)
	struct UImage IMG_Light_BackTop; // 0x2B8 (8)
	struct UImage IMG_Light_BackUnder; // 0x2C0 (8)
	struct UImage IMG_Light_Front; // 0x2C8 (8)
	struct UGridPanel GP_DoubleKill; // 0x2D0 (8)
	struct UGridPanel GP_TripleKill; // 0x2D8 (8)
	struct UGridPanel GP_QuadraKill; // 0x2E0 (8)
	struct UGridPanel GP_PentaKill; // 0x2E8 (8)
	float KillDefaultDuration; // 0x2F0 (4)
};

// Class ProjectD.PDLevelStreamingVolume
class APDLevelStreamingVolume : public AVolume {

public:

	struct TArray<struct FString> HiddenLevelNames; // 0x258 (16)
	struct TArray<struct FString> BeginOverlapConsoleCommands; // 0x268 (16)
	struct TArray<struct FString> EndOverlapConsoleCommands; // 0x278 (16)
};

// Class ProjectD.PDLineItemModel
class APDLineItemModel : public APDItemModel {

public:

	struct USplineComponent Spline; // 0x2E0 (8)
};

// Class ProjectD.PDLoadingUI
class UPDLoadingUI : public UPDSceneBaseUI {

public:

	struct UPDTextBlock Loading_Text; // 0x288 (8)
};

// Class ProjectD.PDLobbyAnimInstance
class UPDLobbyAnimInstance : public UPDAnimInstance {

public:

	struct FPDLobbyAnimData LobbyAnimData; // 0x280 (208)
	enum class EPDLobbyAnimStatus LobbyAnimStatus; // 0x350 (1)
	int32_t LobbyAnimPlayIndex; // 0x354 (4)
	int32_t LobbyIdleAnimIndex; // 0x358 (4)
	enum class EPDLobbyAnimStatus ReserveLobbyAnimStatus; // 0x35C (1)
};

// Class ProjectD.PDLobbyAnimNotify
class UPDLobbyAnimNotify : public UPDBaseAnimNotify {

public:

	enum class EPDLobbyAnimStatus LobbyAnimStatus; // 0x48 (1)
	bool Hair; // 0x49 (1)
	bool ChangeIdleAnim; // 0x4A (1)
};

// Class ProjectD.PDLobbySceneEventActor
class APDLobbySceneEventActor : public UActor {

public:

	enum class ESceneName TargetSceneName; // 0x220 (1)
	int32_t TargetAgentIndex; // 0x224 (4)
	struct TArray<struct FLobbySceneEventData> EventDataArray; // 0x228 (16)
};

// Class ProjectD.PDLobbyTimelineActor
class APDLobbyTimelineActor : public UActor {

public:

	struct UPDSplineCameraTimelineComponent SplineCameraTimeline; // 0x220 (8)
	int32_t TargetCamSplineID; // 0x228 (4)
	int32_t TargetAgentIndex; // 0x22C (4)
	enum class ESceneName TargetSceneName; // 0x230 (1)
	enum class EPDLobbyAnimStatus TargetAnimStatus; // 0x231 (1)
	bool TestMode; // 0x232 (1)
};

// Class ProjectD.PDLobbyUI
class UPDLobbyUI : public UPDSceneBaseUI {

public:

	struct UPDButton Btn_DebugLog; // 0x288 (8)
	struct UPDTabButton Btn_StartPlay; // 0x290 (8)
	struct UPDTextBlock T_NickName; // 0x298 (8)
	struct UCanvasPanel CP_MainMenu; // 0x2A0 (8)
	struct UPDMatchListUI MatchIDList; // 0x2A8 (8)
	struct UBorder BD_MouseEventCover; // 0x2B0 (8)
	struct UWidgetSwitcher WS_PlayMatching; // 0x2B8 (8)
	struct UWidgetSwitcher WS_PlayBtn; // 0x2C0 (8)
	struct UPDButton Btn_Matching_ForceStart; // 0x2C8 (8)
	struct UPDButton Btn_Matching_Cancel; // 0x2D0 (8)
	struct UCanvasPanel CP_MatchForceStart; // 0x2D8 (8)
	struct UPDEquipPerkList EquipPerkList; // 0x2E0 (8)
	struct UCanvasPanel CP_PerkList; // 0x2E8 (8)
	struct UBorder BD_PerkEventCover; // 0x2F0 (8)
	struct UCanvasPanel CP_AddItemMsg; // 0x2F8 (8)
	struct UPDTextBlock TB_AddItem; // 0x300 (8)
	struct UCanvasPanel CP_Disabled_Reason; // 0x308 (8)
	struct UPDTextBlock TB_PlayDisabled; // 0x310 (8)
	struct UPDButton Btn_News; // 0x318 (8)
	struct UPDButton Btn_Event; // 0x320 (8)
	struct UPDTextBlock T_Desc_Cancel; // 0x328 (8)
	struct UCanvasPanel CP_MatchIDList; // 0x330 (8)
	struct UPDMatchModeList MatchModeList; // 0x338 (8)
	struct UPDButton Btn_Training; // 0x340 (8)
	struct UPDButton Btn_GameGuide; // 0x348 (8)
	struct UWidgetSwitcher WS_QR; // 0x350 (8)
	struct UPDButton Btn_Voice; // 0x358 (8)
	struct UWidgetSwitcher WS_VoiceState; // 0x360 (8)

	void PlayOpenSurvey(); // Function ProjectD.PDLobbyUI.PlayOpenSurvey(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x182E690>
	void OnUnHoveredStartPlayBtn(); // Function ProjectD.PDLobbyUI.OnUnHoveredStartPlayBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x182E670>
	void OnPlayerStatsClosed(); // Function ProjectD.PDLobbyUI.OnPlayerStatsClosed(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x182E650>
	void OnHoveredStartPlayBtn(); // Function ProjectD.PDLobbyUI.OnHoveredStartPlayBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x182E5F0>
	void OnClickVoiceBtn(); // Function ProjectD.PDLobbyUI.OnClickVoiceBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x182E3C0>
	void OnClickTrainingBtn(); // Function ProjectD.PDLobbyUI.OnClickTrainingBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x182E3A0>
	void OnClickStartPlayBtn(); // Function ProjectD.PDLobbyUI.OnClickStartPlayBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x182E380>
	void OnClickPlayerStats(); // Function ProjectD.PDLobbyUI.OnClickPlayerStats(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnClickMachingCancel(); // Function ProjectD.PDLobbyUI.OnClickMachingCancel(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x182E340>
	void OnClickForcePlay(); // Function ProjectD.PDLobbyUI.OnClickForcePlay(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x182E300>
	void OnClickDebugLogBtn(); // Function ProjectD.PDLobbyUI.OnClickDebugLogBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
};

// Class ProjectD.PDLocoDefaultAnimInstance
class UPDLocoDefaultAnimInstance : public UPDPlayerAnimInstance {

public:

	enum class EPDStartingType StartingType; // 0x5E8 (1)
	enum class EPDStoppingType StoppingType; // 0x5E9 (1)
};

// Class ProjectD.PDLoginUI
class UPDLoginUI : public UPDSceneBaseUI {

public:

	struct UWidget IMG_Movie; // 0x2A0 (8)
	struct UCanvasPanel CP_LoginUI; // 0x2A8 (8)
	struct UPDButton Btn_Login; // 0x2B0 (8)
	struct UEditableTextBox ET_ID; // 0x2B8 (8)
	struct UEditableTextBox ET_PW; // 0x2C0 (8)
	struct UPDCheckBox Check_SaveID; // 0x2C8 (8)
	struct UImage IMG_SaveID_Bg; // 0x2D0 (8)
	struct UBorder BD_Alert; // 0x2D8 (8)
	struct UPDTextBlock TB_Alert; // 0x2E0 (8)
	struct UWidget WB_PatchNote; // 0x2E8 (8)
	struct UImage IMG_BtnDeco; // 0x2F0 (8)
	struct UCanvasPanel CP_SaveID; // 0x2F8 (8)
	struct UMediaPlayer LoginMediaPlayer; // 0x300 (8)
	struct FString BgFilePath; // 0x308 (16)
	float MediaStartDelay; // 0x318 (4)

	void OnSplashMovieClosed(); // Function ProjectD.PDLoginUI.OnSplashMovieClosed(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnInitMediaPlayer(); // Function ProjectD.PDLoginUI.OnInitMediaPlayer(Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnClickGameLoginBtn(); // Function ProjectD.PDLoginUI.OnClickGameLoginBtn(Final|Native|Public) // <VeiledExperts-Win64-Shipping.exe+0x182E320>
};

// Class ProjectD.PDMailBoxListItemUI
class UPDMailBoxListItemUI : public UPDUserWidget {

public:

	struct UPDTextBlock TB_MailTitle; // 0x290 (8)
	struct UPDTextBlock TB_MailContent; // 0x298 (8)
	struct UPDTextBlock TB_ReceivedDate; // 0x2A0 (8)
	struct UImage IMG_MailIcon; // 0x2A8 (8)
};

// Class ProjectD.PDMailItemListSlotUI
class UPDMailItemListSlotUI : public UPDUserWidget {

public:

	struct UPDTextBlock TB_Name; // 0x288 (8)
	struct UImage IMG_Item; // 0x290 (8)
	struct UPDButton Btn_ItemSlot; // 0x298 (8)

	void OnUnhoveredItemSlot(); // Function ProjectD.PDMailItemListSlotUI.OnUnhoveredItemSlot(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1831990>
	void OnHoveredItemSlot(); // Function ProjectD.PDMailItemListSlotUI.OnHoveredItemSlot(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18317F0>
};

// Class ProjectD.PDMailNotificationSlotUI
class UPDMailNotificationSlotUI : public UPDUserWidget {

public:

	struct UPDTextBlock TB_MailContent; // 0x288 (8)
	struct UPDButton Btn_NotificationSlot; // 0x290 (8)

	void OnClickNotificationSlot(); // Function ProjectD.PDMailNotificationSlotUI.OnClickNotificationSlot(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1831730>
};

// Class ProjectD.PDMailNotificationUI
class UPDMailNotificationUI : public UPDUserWidget {

public:

	struct UVerticalBox VB_MailNotificationList; // 0x288 (8)
	int32_t MaxNotiCount; // 0x290 (4)
	float NotiDuration; // 0x294 (4)
};

// Class ProjectD.PDMailPopupUI
class UPDMailPopupUI : public UPDPopupBaseUI {

public:

	struct UCanvasPanel CP_MailBox; // 0x2B8 (8)
	struct UPDButton Btn_MailBoxClose; // 0x2C0 (8)
	struct UListView LV_MailList; // 0x2C8 (8)
	struct UPDImageButton IMG_Btn_Bg; // 0x2D0 (8)
	struct UPDMailUI MailUI; // 0x2D8 (8)

	void OnSelectedMailListItem(struct UPDMailBoxListItemData InListDataData); // Function ProjectD.PDMailPopupUI.OnSelectedMailListItem(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18318F0>
	void OnScrolledMailListItem(float ItemOffset, float DistanceRemaining); // Function ProjectD.PDMailPopupUI.OnScrolledMailListItem(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1831830>
	void OnClickMailBoxCloseBtn(); // Function ProjectD.PDMailPopupUI.OnClickMailBoxCloseBtn(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1831690>
};

// Class ProjectD.PDMailUI
class UPDMailUI : public UPDUserWidget {

public:

	struct UCanvasPanel CP_Popup; // 0x288 (8)
	struct UPDTextBlock TB_MailTitle; // 0x290 (8)
	struct UPDTextBlock TB_MailContent; // 0x298 (8)
	struct UPDButton Btn_MailClose; // 0x2A0 (8)
	struct UPDButton Btn_ReceiveItem; // 0x2A8 (8)
	struct UPDButton Btn_DeleteMail; // 0x2B0 (8)
	struct UImage IMG_MailIcon; // 0x2B8 (8)
	struct UHorizontalBox HB_MailItemList; // 0x2C0 (8)
	struct UPDTextBlock TB_ReceivedDate; // 0x2C8 (8)
	struct UPDTextBlock TB_ExpireDate; // 0x2D0 (8)
	struct UScrollBox SB_MsgScroll; // 0x2D8 (8)

	void OnClickReceiveItemBtn(); // Function ProjectD.PDMailUI.OnClickReceiveItemBtn(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1831750>
	void OnClickMailCloseBtn(); // Function ProjectD.PDMailUI.OnClickMailCloseBtn(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18316B0>
	void OnClickDeleteMailBtn(); // Function ProjectD.PDMailUI.OnClickDeleteMailBtn(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1831670>
	void DeleteMail(int64_t MailSN); // Function ProjectD.PDMailUI.DeleteMail(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1831390>
};

// Class ProjectD.PDPlayerCharacter
class APDPlayerCharacter : public APDCharacterEntity {

public:

	struct FPDPlayerAnimDatas PlayerAnimDatas; // 0x8B8 (20504)
	struct FPDLobbyCharacterAnimData LobbyCharacterAnimData; // 0x58D0 (216)
	struct FPDPlayerAnimDatas JuggernautAnimDatas; // 0x59A8 (20504)
	struct FPDFacialAnimData FacialAnimData; // 0xA9C0 (944)
	struct UStaticMeshComponent CullCheckerComponent; // 0xAD70 (8)
	struct UPDActionComponent PDActionComponent; // 0xAD78 (8)
	struct UPDStateComponent PDStateComponent; // 0xAD80 (8)
	struct UPDWeaponControlComponent PDWeaponCtrlComponent; // 0xAD88 (8)
	struct UPhysicalAnimationComponent PhysicalAnimation; // 0xAD90 (8)
	struct UStaticMeshComponent AttachedPropComponent; // 0xAD98 (8)
	enum class EPDLobbyAnimStatus LobbyAnimStatus; // 0xADA0 (1)
	int32_t LobbyIdleAnimIndex; // 0xADA4 (4)
	struct UPDPlayerAnimInstance BaseAnimInstance; // 0xAE28 (8)
	struct UPDLocoClimbAnimInstance LocoClimbSubAnimInstance; // 0xAE30 (8)
	struct UCapsuleComponent Bodyfence; // 0xAE38 (8)
	float AFKChangeTime; // 0xAE40 (4)
	struct UPDPlayerSpringArmComponent PDPlayerSpringArmComponent; // 0xAE68 (8)
	struct UCameraComponent DefaultCamera; // 0xAE70 (8)
	bool TEST_NoDeathPhysicalAnimation; // 0xAE78 (1)
	bool TEST_NoGroggy; // 0xAE7A (1)
	struct TArray<struct FPDFootstepInfo> Footsteps; // 0xAE80 (16)
	struct TArray<struct UPDDroneSpringArmComponent> DroneSpringArmList; // 0xAFB8 (16)

	void ToggleRagdoll(); // Function ProjectD.PDPlayerCharacter.ToggleRagdoll(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void PlayHitAnim(); // Function ProjectD.PDPlayerCharacter.PlayHitAnim(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x183AF20>
	enum class EPDSpecificWeaponAnimset GetCurrentSpecificWeaponAnimset(); // Function ProjectD.PDPlayerCharacter.GetCurrentSpecificWeaponAnimset(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x183ADF0>
	enum class EPDAnimset GetCurrentAnimset(); // Function ProjectD.PDPlayerCharacter.GetCurrentAnimset(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x183ADC0>
};

// Class ProjectD.PDMainPlayerCharacter
class APDMainPlayerCharacter : public APDPlayerCharacter {

public:

	struct UPDMainPlayerMovementComponent PlayerMovementComponent; // 0xAFE8 (8)
	struct UPDMainPlayerSpringArmComponent PDMainPlayerSpringArmComponent; // 0xAFF0 (8)
	struct USpringArmComponent SpringArmComp; // 0xAFF8 (8)
	struct UCapsuleComponent SpringArmCapsule; // 0xB000 (8)
	struct UPDStoppingPowerComponent StoppingPowerComponent; // 0xB008 (8)
	struct USphereComponent UpsideSphereComponent; // 0xB010 (8)
	char SuppressionLevel; // 0xB181 (1)
	float RemainingSuppressionTime; // 0xB184 (4)
	float LastSuppressionTime; // 0xB188 (4)
	float SuppressionKeepTime; // 0xB18C (4)
	float SuppressionDownTime; // 0xB190 (4)
	float CamBlendExp; // 0xB194 (4)
	float DeathCamBlendTime; // 0xB198 (4)
	float aimPosXOffsetLength; // 0xB19C (4)
	float aimPosYOffsetLength; // 0xB1A0 (4)
	float aimPosZOffsetLength; // 0xB1A4 (4)
	bool bAccurateAimPitch; // 0xB1A8 (1)
	struct TArray<struct UClass*> CameraShakeClasses; // 0xB1B0 (16)
	struct APDMainPlayerCharacterFP FPCharacter; // 0xB248 (8)

	void OnUpsideSphereEndOverlap(struct UPrimitiveComponent OverlappedComponent, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex); // Function ProjectD.PDMainPlayerCharacter.OnUpsideSphereEndOverlap(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1831BA0>
	void OnUpsideSphereBeginOverlap(struct UPrimitiveComponent OverlappedComponent, struct UActor OtherActor, struct UPrimitiveComponent OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function ProjectD.PDMainPlayerCharacter.OnUpsideSphereBeginOverlap(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x18319B0>
	void HandMeshLoadingComplete(struct TArray<struct TSoftObjectPtr<Object>>& Data, int32_t Index); // Function ProjectD.PDMainPlayerCharacter.HandMeshLoadingComplete(Final|Native|Public|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1831490>
};

// Class ProjectD.PDMainPlayerCharacterFP
class APDMainPlayerCharacterFP : public ACharacter {

public:

	struct UAnimMontage CurrentPlayingDrawMontage; // 0x4B8 (8)
	struct UPDPlayerAnimInstanceFPDummy FPAnimInstance; // 0x4D0 (8)
	struct APDMainPlayerCharacter MainPlayerCharacter; // 0x4D8 (8)
	struct UPDMainPlayerStateComponent MainPlayerStateComponent; // 0x4E0 (8)
	struct APDFPWeapon FPWeapon; // 0x4E8 (8)
	struct UCurveFloat FPZoomInCameraLocationCurve; // 0x518 (8)
	struct UCurveFloat FPZoomInCameraRotationCurve; // 0x520 (8)
	struct ACameraActor ToggleUsingAimChangeActor; // 0x538 (8)
	struct UCameraComponent BeginCamera; // 0x540 (8)
	struct UCameraComponent EndCamera; // 0x548 (8)
	float ToggleChangeMaxTime; // 0x550 (4)
	struct FTransform WeaponTransform; // 0x560 (48)
	enum class EPDAimingState CurrentAimingState; // 0x590 (1)
};

// Class ProjectD.PDMainPlayerMovementComponent
class UPDMainPlayerMovementComponent : public UCharacterMovementComponent {

public:

	float MaxRunSpeedCrouched; // 0x628 (4)
	float MaxSprintSpeedCrouched; // 0x62C (4)
	float MaxRunSpeed; // 0x630 (4)
	float MaxSprintSpeed; // 0x634 (4)
	float SprintAllowAngle; // 0x638 (4)
	float SprintClampAngle; // 0x63C (4)
	struct UPDMainPlayerStateComponent OwnerPDStateComponent; // 0x770 (8)
};

// Class ProjectD.PDPlayerSpringArmComponent
class UPDPlayerSpringArmComponent : public USpringArmComponent {

public:

	float CameraHitBlendXY; // 0x280 (4)
	struct APDPlayerCharacter pOwnerCharacter; // 0x290 (8)
	struct UPDStateComponent pOwnerStateComponent; // 0x298 (8)
};

// Class ProjectD.PDMainPlayerSpringArmComponent
class UPDMainPlayerSpringArmComponent : public UPDPlayerSpringArmComponent {

public:

	float CrouchTargetOffsetLagSpeed; // 0x680 (4)
	float TargetStartOffset; // 0x684 (4)
	float TraceDistance; // 0x688 (4)
	float TraceRadius; // 0x68C (4)
	float TraceHeight; // 0x690 (4)
};

// Class ProjectD.PDStateComponent
class UPDStateComponent : public UActorComponent {

public:

	struct UPDMainPlayerMovementComponent OwnerPDMainPlayMovementComponent; // 0xB8 (8)
	struct APDPlayerCharacter OwnerPlayer; // 0xC0 (8)
	struct UPDPlayerAnimInstance BaseAnimInstance; // 0xC8 (8)
	enum class EPDLocoType LocoType; // 0xEC (1)
	enum class EPDLocoState LocoState; // 0xED (1)
	enum class EPDMovementState MovementState; // 0xEE (1)
	enum class EPDStanceState StanceState; // 0xEF (1)
	enum class EPDAimingState AimingState; // 0xF0 (1)
	enum class EPDGaitsState GaitState; // 0xF1 (1)
	float GaitValue; // 0xF4 (4)
	float Direction; // 0xF8 (4)
	float AimPitch; // 0xFC (4)
	float AimYaw; // 0x100 (4)
	float FreeLookYaw; // 0x104 (4)
	float LeanFB; // 0x108 (4)
	float LeanLR; // 0x10C (4)
	bool bLeftHandedPose; // 0x110 (1)
	enum class EPDClimbStanceState ClimbStanceState; // 0x120 (1)
	enum class EPDThrowStanceState ThrowStanceState; // 0x121 (1)
	enum class EPDSlideStanceState SlideStanceState; // 0x122 (1)
	enum class EPDLeanState LeanState; // 0x127 (1)
	struct TArray<struct UClass*> StateClassList; // 0x128 (16)
	struct UPDStateBase CurrentState; // 0x140 (8)
	struct TArray<struct UPDStateBase> StateList; // 0x148 (16)
};

// Class ProjectD.PDMainPlayerStateComponent
class UPDMainPlayerStateComponent : public UPDStateComponent {

public:

	struct FVector MoveInputAxis; // 0x3F8 (12)
	bool bMoveInputPressed; // 0x404 (1)
	enum class EPDInputMoveType InputState; // 0x405 (1)
	float CurSpeed; // 0x438 (4)
	float PreviousSpeed; // 0x43C (4)
	float LastInputMoveSpeed; // 0x440 (4)
	struct APDCharacterEntity TargetCharacter; // 0x510 (8)
	float StartingFowardAcceleration; // 0x534 (4)
	float StartingSideAcceleration; // 0x538 (4)
	float StartingBackAcceleration; // 0x53C (4)
	float StartingFowardAcceleration_Crouch; // 0x540 (4)
	float StartingSideAcceleration_Crouch; // 0x544 (4)
	float StartingBackAcceleration_Crouch; // 0x548 (4)
	float StoppingMaxBrakingDeceleration; // 0x54C (4)
	float StoppingMinBrakingDeceleration; // 0x550 (4)
	float StoppingMaxBrakingDeceleration_Crouch; // 0x554 (4)
	float StoppingMinBrakingDeceleration_Crouch; // 0x558 (4)
	float RestoreAccelerationDuration; // 0x55C (4)
	float RestoreAccelerationDuration_Crouch; // 0x560 (4)
	float RestoreBrakingDecelerationDuration; // 0x564 (4)
	float RestoreBrakingDecelerationDuration_Crouch; // 0x568 (4)
	float CurrentRestoreBrakingDecelerationDuration; // 0x56C (4)
	float AimingIdleTime; // 0x5B8 (4)
	float AimingIdleLimitPitchAngle; // 0x5BC (4)
	float AimingIdleLimitYawAngle; // 0x5C0 (4)
	struct UCurveBase AimingIdleMoveCurve; // 0x5C8 (8)
	float AimingIdleHoldingMaxTime; // 0x5D4 (4)
	struct UCurveFloat AimingIdleHoldingCurve; // 0x5D8 (8)
	float AimingIdleDelay; // 0x5E0 (4)
};

// Class ProjectD.PDMarkerGuide
class UPDMarkerGuide : public UPDIngameModeWidget {

public:

	struct UCanvasPanel CP_Guide; // 0x290 (8)
	struct UImage IMG_Line; // 0x298 (8)
	struct UCanvasPanel CP_Info; // 0x2A0 (8)
	struct UHorizontalBox HB_Key; // 0x2A8 (8)
	struct UWidgetSwitcher WS_Key; // 0x2B0 (8)
	struct UPDTextBlock TB_Key; // 0x2B8 (8)
	struct UPDTextBlock TB_Desc; // 0x2C0 (8)
	struct UHorizontalBox HB_Type; // 0x2C8 (8)
	struct UPDTextBlock TB_Type; // 0x2D0 (8)
	struct UPDTextBlock TB_Distance; // 0x2D8 (8)
	struct USizeBox SB_User; // 0x2E0 (8)
	struct UImage IMG_UserCode; // 0x2E8 (8)
	struct UPDTextBlock TB_UserNum; // 0x2F0 (8)
	struct UPDTextBlock TB_UserName; // 0x2F8 (8)
	struct USizeBox SB_User_Item; // 0x300 (8)
	struct UImage IMG_UserCode_Item; // 0x308 (8)
	struct UPDTextBlock TB_UserNum_Item; // 0x310 (8)
	struct UPDTextBlock TB_UserName_Item; // 0x318 (8)
};

// Class ProjectD.PDMaskedText
class UPDMaskedText : public UPDUserWidget {

public:

	struct UCanvasPanel CP_Left; // 0x288 (8)
	struct UPDTextBlock TB_Left; // 0x290 (8)
	struct UCanvasPanel CP_Right; // 0x298 (8)
	struct UPDTextBlock TB_Right; // 0x2A0 (8)
	float Width; // 0x2A8 (4)
	float Percent; // 0x2AC (4)
};

// Class ProjectD.PDMatchingUI
class UPDMatchingUI : public UPDUserWidget {

public:

	struct UPDTextBlock TB_Matching; // 0x288 (8)
	struct UPDTextBlock TB_Time; // 0x290 (8)
	struct UPDTextBlock TB_Desc; // 0x298 (8)
};

// Class ProjectD.PDMatchListItem
class UPDMatchListItem : public UPDUserWidget {

public:

	struct UPDButton Btn_MatchListItem; // 0x288 (8)

	void OnClickMatch(); // Function ProjectD.PDMatchListItem.OnClickMatch(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18316D0>
};

// Class ProjectD.PDMatchListUI
class UPDMatchListUI : public UPDUserWidget {

public:

	struct UScrollBox SB_MatchIDList; // 0x288 (8)
};

// Class ProjectD.PDMatchModeList
class UPDMatchModeList : public UPDUserWidget {

public:

	struct UPDButton Btn_Matching; // 0x288 (8)
	struct UHorizontalBox HB_ModeList_3; // 0x290 (8)
	struct UPDButton Btn_Matching_FFA; // 0x298 (8)
	struct UPDButton Btn_Trainning_01; // 0x2A0 (8)
	struct UPDButton Btn_Trainning_02; // 0x2A8 (8)
	struct UPDButton Btn_Trainning_03; // 0x2B0 (8)
	struct UPDButton Btn_Trainning_04; // 0x2B8 (8)
	struct UPDButton Btn_CreateCustom; // 0x2C0 (8)
	struct UPDButton Btn_JoinCustom; // 0x2C8 (8)
	struct UCanvasPanel CP_Disabled; // 0x2D0 (8)
	struct UImage IMG_CreateCustom; // 0x2D8 (8)
	struct UImage IMG_JoinCustom; // 0x2E0 (8)
	struct UWidgetSwitcher WS_Matching_Case; // 0x2E8 (8)
	struct UCanvasPanel CP_MissionScore; // 0x2F0 (8)

	void OnUnHoveredMatchBtn(); // Function ProjectD.PDMatchModeList.OnUnHoveredMatchBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1831970>
	void OnHoveredMatchBtn(); // Function ProjectD.PDMatchModeList.OnHoveredMatchBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1831810>
	void OnClickTrainningWindfarm(); // Function ProjectD.PDMatchModeList.OnClickTrainningWindfarm(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18317D0>
	void OnClickTrainningShipyard(); // Function ProjectD.PDMatchModeList.OnClickTrainningShipyard(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18317B0>
	void OnClickTrainningDerail(); // Function ProjectD.PDMatchModeList.OnClickTrainningDerail(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1831790>
	void OnClickTrainningBridge(); // Function ProjectD.PDMatchModeList.OnClickTrainningBridge(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1831770>
	void OnClickMatchFFABtn(); // Function ProjectD.PDMatchModeList.OnClickMatchFFABtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1831710>
	void OnClickMatchBtn(); // Function ProjectD.PDMatchModeList.OnClickMatchBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18316F0>
	void OnClickCustomMatchJoin(); // Function ProjectD.PDMatchModeList.OnClickCustomMatchJoin(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1831650>
	void OnClickCustomMatchCreate(); // Function ProjectD.PDMatchModeList.OnClickCustomMatchCreate(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1831630>
};

// Class ProjectD.PDMatchUI
class UPDMatchUI : public UPDSceneBaseUI {

public:

	struct UPDTextBlock T_Tip; // 0x288 (8)
	struct UPDTextBlock T_Level; // 0x290 (8)
	struct UCanvasPanel CP_Mode; // 0x298 (8)
	struct UPDTextBlock T_Mode; // 0x2A0 (8)
	struct UPDTextBlock T_Desc_Mode; // 0x2A8 (8)
	struct UPDTextBlock T_Timeout; // 0x2B0 (8)
	struct UWidgetSwitcher WS_AnimIndicator; // 0x2B8 (8)
	struct UWidgetSwitcher WS_SwicherCase; // 0x2C0 (8)
	struct UWidgetSwitcher WS_CharacterCase; // 0x2C8 (8)
	struct UWidgetSwitcher WS_MapCase; // 0x2D0 (8)
};

// Class ProjectD.PDMinimapUI
class UPDMinimapUI : public UPDIngameModeWidget {

public:

	struct UPDGameMapModule GameMap; // 0x290 (8)
	struct URetainerBox RB_Map; // 0x298 (8)
	struct UCanvasPanel CP_Map; // 0x2A0 (8)
	struct UPDTextBlock TB_Time; // 0x2A8 (8)
	struct UPDTextBlock TB_Coordinates; // 0x2B0 (8)
	struct UImage IMG_Weather; // 0x2B8 (8)
	struct UCanvasPanel CP_NewBadge; // 0x2C0 (8)
	float ExpandScale; // 0x2C8 (4)
	float ZoomScaleMax; // 0x2CC (4)
	float ZoomScaleMin; // 0x2D0 (4)
	float ZoomScaleStep; // 0x2D4 (4)
};

// Class ProjectD.PDMissionScoreModeUI
class UPDMissionScoreModeUI : public UPDBaseModeUI {

public:

	struct UPDSkyViewUI SkyView; // 0x4A0 (8)
	struct UPDMissionScoreRoundInfoUI RoundInfo; // 0x4A8 (8)
	struct UPDMissionScoreStatusBoard IngameStatusBoard; // 0x4B0 (8)
	struct UPDMissionScoreRoundResult RoundResult; // 0x4B8 (8)
};

// Class ProjectD.PDMissionScorePlayerEntryItem
class UPDMissionScorePlayerEntryItem : public UPDUserWidget {

public:

	struct UPDTextBlock TB_PlayerName; // 0x288 (8)
	struct UImage IMG_AgentIcon; // 0x290 (8)
	struct UImage IMG_PlayerBack; // 0x298 (8)
	struct UBorder BD_Score; // 0x2A0 (8)
	struct UProgressBar PB_Groggy; // 0x2A8 (8)
	struct UWidgetSwitcher WS_State; // 0x2B0 (8)
	struct UPDTextBlock TB_Score; // 0x2B8 (8)
	struct UPDTextBlock TB_AddScore_2; // 0x2C0 (8)
	struct UPDTextBlock TB_AddScore_3; // 0x2C8 (8)
	struct UPDTextBlock TB_AddScore_4; // 0x2D0 (8)
	struct UPDTextBlock TB_AddScore_5; // 0x2D8 (8)
	struct UPDTextBlock TB_AddScore_6; // 0x2E0 (8)
	struct TArray<struct UPDTextBlock> TB_AddScoreList; // 0x2E8 (16)
	struct UCanvasPanel CP_Item_2; // 0x2F8 (8)
	struct UImage IMG_Item_2; // 0x300 (8)
	struct UCanvasPanel CP_Item_3; // 0x308 (8)
	struct UImage IMG_Item_3; // 0x310 (8)
	struct UCanvasPanel CP_Item_4; // 0x318 (8)
	struct UImage IMG_Item_4; // 0x320 (8)
	struct UCanvasPanel CP_Item_5; // 0x328 (8)
	struct UImage IMG_Item_5; // 0x330 (8)
	struct TArray<struct UCanvasPanel> MissionItemPanelList; // 0x338 (16)
	struct TArray<struct UImage> MissionItemImgList; // 0x348 (16)
};

// Class ProjectD.PDMissionScoreRoundInfoUI
class UPDMissionScoreRoundInfoUI : public UPDIngameModeWidget {

public:

	struct UPDTextBlock TB_Round; // 0x290 (8)
	struct UHorizontalBox HB_PlayerEntry; // 0x298 (8)
};

// Class ProjectD.PDMissionScoreRoundResult
class UPDMissionScoreRoundResult : public UPDIngameModeWidget {

public:

	struct UPDTextBlock TB_RoundTitle; // 0x290 (8)
	struct UHorizontalBox HB_TopRankRoot; // 0x298 (8)
	struct TMap<int32_t, struct UPDMSRoundResultTopRank> TopRankMap; // 0x2A0 (80)
	struct UVerticalBox VB_PlayerInfoRoot; // 0x2F0 (8)
	struct TArray<struct UPDMSRoundResultPlayerInfo> PlayerInfoList; // 0x2F8 (16)
	struct UHorizontalBox HB_RoundRoot; // 0x308 (8)
	struct TArray<struct UPDResultRoundItemUI> RoundItemList; // 0x310 (16)
};

// Class ProjectD.PDMissionScoreStatusBoard
class UPDMissionScoreStatusBoard : public UPDIngameModeWidget {

public:

	struct UVerticalBox VB_PlayerList; // 0x290 (8)
	struct UHorizontalBox HB_Round; // 0x298 (8)
};

// Class ProjectD.PDModelEntity
class APDModelEntity : public UActor {

public:

	struct TArray<struct UStaticMeshComponent> StaticMeshCompList; // 0x348 (16)
	struct USkeletalMeshComponent SkeletalMeshComp; // 0x358 (8)
};

// Class ProjectD.PDWeaponControlComponent
class UPDWeaponControlComponent : public UActorComponent {

public:

	struct APDPlayerCharacter OwnerPlayer; // 0xC0 (8)
	struct APDTutorialNPC OwnerTutorialNPC; // 0xC8 (8)
	struct APDCharacterEntity OwnerEntity; // 0xD0 (8)
	struct UPDStateComponent PlayerStateComponent; // 0xD8 (8)
};

// Class ProjectD.PDMPWeaponControlComponent
class UPDMPWeaponControlComponent : public UPDWeaponControlComponent {

public:

	struct APDMainPlayerCharacter OwnerMainPlayer; // 0x108 (8)
	struct UPDMainPlayerStateComponent MainPlayerStateComponent; // 0x110 (8)
};

// Class ProjectD.PDStatusBoardPlayerInfoBase
class UPDStatusBoardPlayerInfoBase : public UPDUserWidget {

public:

	struct UWidgetSwitcher WS_PlayerState; // 0x288 (8)
	struct UProgressBar PB_Groggy; // 0x290 (8)
	struct UPDTextBlock T_PlayerName; // 0x298 (8)
	struct UPDTextBlock T_KillCount; // 0x2A0 (8)
	struct UPDTextBlock T_AssistCount; // 0x2A8 (8)
	struct UPDTextBlock T_DefenceCount; // 0x2B0 (8)
	struct UPDTextBlock T_AttackCount; // 0x2B8 (8)
	struct UImage IMG_Ping_01; // 0x2C0 (8)
	struct UImage IMG_Ping_02; // 0x2C8 (8)
	struct UImage IMG_Ping_03; // 0x2D0 (8)
	struct UImage IMG_Ping_04; // 0x2D8 (8)
	struct UImage IMG_Ping_05; // 0x2E0 (8)
	struct UPDButton BTN_Report; // 0x2E8 (8)
	struct TArray<struct UImage> PingImgList; // 0x2F0 (16)
	struct UImage IMG_Clan_BG; // 0x300 (8)
	struct UImage IMG_Clan; // 0x308 (8)
	struct UBorder B_ToggleChat_Line; // 0x310 (8)
	struct UCheckBox CB_ChatBlock; // 0x318 (8)
	struct UBorder B_TogglePing_Line; // 0x320 (8)
	struct UCheckBox CB_PingBlock; // 0x328 (8)
	struct FSlateColor NormalTextColor; // 0x330 (40)
	struct FSlateColor DeathTextColor; // 0x358 (40)

	void OnTogglePingBlockChanged(bool Val); // Function ProjectD.PDStatusBoardPlayerInfoBase.OnTogglePingBlockChanged(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1848250>
	void OnToggleChatBlockChanged(bool Val); // Function ProjectD.PDStatusBoardPlayerInfoBase.OnToggleChatBlockChanged(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18481C0>
	void OnClicked_BTN_Report(); // Function ProjectD.PDStatusBoardPlayerInfoBase.OnClicked_BTN_Report(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1848160>
};

// Class ProjectD.PDMSStatusBoardPlayerInfo
class UPDMSStatusBoardPlayerInfo : public UPDStatusBoardPlayerInfoBase {

public:

	struct UImage IMG_SlotBg_Me; // 0x398 (8)
	struct UPDTextBlock T_PlayerRank; // 0x3A0 (8)
	struct UPDTextBlock T_Point; // 0x3A8 (8)
	struct UPDTextBlock T_MissionCount; // 0x3B0 (8)
};

// Class ProjectD.PDMSRoundResultPlayerInfo
class UPDMSRoundResultPlayerInfo : public UPDMSStatusBoardPlayerInfo {

public:

	struct UWidgetSwitcher WS_Rank; // 0x3B8 (8)
	struct UPDTextBlock T_Point_Get; // 0x3C0 (8)
};

// Class ProjectD.PDMSRoundResultTopRank
class UPDMSRoundResultTopRank : public UPDUserWidget {

public:

	struct USizeBox SB_CharacterIcon; // 0x288 (8)
	struct UImage IMG_Portrait; // 0x290 (8)
	struct UImage IMG_MainPlayer; // 0x298 (8)
	struct UImage IMG_Background; // 0x2A0 (8)
	struct UWidgetSwitcher WS_Rank; // 0x2A8 (8)
	struct UPDTextBlock TB_Rank; // 0x2B0 (8)
	struct UCanvasPanel CP_Label; // 0x2B8 (8)
	struct UPDTextBlock TB_Nickname; // 0x2C0 (8)
	struct UImage IMG_ClanMarkBG; // 0x2C8 (8)
	struct UImage IMG_ClanMarkFG; // 0x2D0 (8)
	int32_t RankNumber; // 0x2D8 (4)
};

// Class ProjectD.PDMSStatusBoardRoundItem
class UPDMSStatusBoardRoundItem : public UPDUserWidget {

public:

	struct UPDTextBlock T_RoundInfo; // 0x288 (8)
	struct UWidgetSwitcher WS_ResultType; // 0x290 (8)
	struct UImage IMG_SLotBg; // 0x298 (8)
};

// Class ProjectD.PDMultiSplineComponent
class UPDMultiSplineComponent : public USplineComponent {

public:

	struct TArray<float> SpeedRateList; // 0x4F8 (16)
};

// Class ProjectD.PDNameTagUI
class UPDNameTagUI : public UPDHUDIconBaseUI {

public:

	struct FSlateColor MyTeamColor; // 0x2A0 (40)
	struct FSlateColor EnemyTeamColor; // 0x2C8 (40)
	struct UPDTextBlock TB_UserName; // 0x2F0 (8)
	struct UWidgetSwitcher WS_UserState; // 0x2F8 (8)
	struct UProgressBar PB_Health; // 0x300 (8)
	struct UPDAttackDamageIndicatorUI AttackDamageIndicator; // 0x308 (8)
};

// Class ProjectD.PDNameTagAllyUI
class UPDNameTagAllyUI : public UPDNameTagUI {

public:

	struct UCanvasPanel CP_InScreen; // 0x320 (8)
	struct UCanvasPanel CP_OutScreen; // 0x328 (8)
	struct UWidgetSwitcher WS_UserSubState; // 0x330 (8)
	struct UImage IMG_UserCode; // 0x338 (8)
	struct UImage IMG_Height; // 0x340 (8)
	struct UPDTextBlock TB_UserNum; // 0x348 (8)
	struct USizeBox SB_StateItem; // 0x350 (8)
	struct UImage IMG_StateItem; // 0x358 (8)
	struct UImage IMG_StateItem_FX1; // 0x360 (8)
	struct UImage IMG_StateItem_FX2; // 0x368 (8)
	struct UImage IMG_Bomb; // 0x370 (8)
	struct UPDArmorGauge ArmorGauge; // 0x378 (8)
	struct UPDCircleProgressModule CPM_Groggy; // 0x380 (8)
	struct UProgressBar PB_Groggy; // 0x388 (8)
	struct UCanvasPanel CP_SelfRevivalKit; // 0x390 (8)
	struct UPDCheerMarkFx CheerFx; // 0x398 (8)
	struct UBorder BD_OutArrow; // 0x3A0 (8)
	struct UImage IMG_OutArrow; // 0x3A8 (8)
	struct UImage IMG_OutDamage; // 0x3B0 (8)
	struct UPDCircleProgressModule CPM_OutGroggy; // 0x3B8 (8)
	struct UImage IMG_OutGroggy; // 0x3C0 (8)
	struct UImage IMG_OutBomb; // 0x3C8 (8)
	struct UCanvasPanel CP_Medal; // 0x3D0 (8)
	struct UImage IMG_Medal; // 0x3D8 (8)

	void AdjustStateImageRatio(); // Function ProjectD.PDNameTagAllyUI.AdjustStateImageRatio(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1835450>
};

// Class ProjectD.PDNameTagEnemyUI
class UPDNameTagEnemyUI : public UPDNameTagUI {

public:

	struct UCanvasPanel CP_InScreen; // 0x320 (8)
	struct UCanvasPanel CP_OutScreen; // 0x328 (8)
	struct UCanvasPanel CP_MissionLeptonOwner; // 0x330 (8)
	struct UCanvasPanel CP_MissionTarget; // 0x338 (8)
};

// Class ProjectD.PDNeutralObject
class APDNeutralObject : public UActor {

public:

	struct UPDSkeletalMeshComponent Mesh; // 0x230 (8)

	void OnAssetsLoaded(struct TArray<struct TSoftObjectPtr<Object>>& InAssets); // Function ProjectD.PDNeutralObject.OnAssetsLoaded(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1835470>
};

// Class ProjectD.PDNeutralObjectGroup
class APDNeutralObjectGroup : public UActor {

public:

	struct TArray<struct FVector> SpawnPoints; // 0x220 (16)
	struct TMap<uint64_t, char> SpawnNumByIndex; // 0x240 (80)
	float PatrollRadius; // 0x290 (4)
	float EventHeight; // 0x294 (4)
	float LandableRadius; // 0x298 (4)
	bool bAutoActive; // 0x29C (1)
	bool bDisablePatroll; // 0x29D (1)
	bool bShowDebugLines; // 0x29E (1)
};

// Class ProjectD.PDNickNameCreateUI
class UPDNickNameCreateUI : public UPDSceneBaseUI {

public:

	struct UPDButton OKBtn; // 0x290 (8)
	struct UEditableTextBox ET_NickName; // 0x298 (8)
	struct UCanvasPanel CP_Alert; // 0x2A0 (8)
	struct UPDTextBlock TB_Alert; // 0x2A8 (8)

	void OnClickOKBtn(); // Function ProjectD.PDNickNameCreateUI.OnClickOKBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1835610>
	void OnChangeText(struct FText& InText); // Function ProjectD.PDNickNameCreateUI.OnChangeText(Final|Native|Private|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1816600>
};

// Class ProjectD.PDNotificationAlert
class UPDNotificationAlert : public UPDUserWidget {

public:

	struct UCanvasPanel CP_Alert; // 0x290 (8)
	struct UPDTextBlock TB_Text; // 0x298 (8)
	struct UProgressBar PB_Alert; // 0x2A0 (8)
	struct UBorder BD_Desc; // 0x2A8 (8)
	struct UPDTextBlock TB_Desc; // 0x2B0 (8)
};

// Class ProjectD.PDNPCAnimInstance
class UPDNPCAnimInstance : public UAnimInstance {

public:

	struct APDTutorialNPC Owner; // 0x268 (8)
	enum class EPDLocoType LocoType; // 0x270 (1)
	bool bIsRagdoll; // 0x271 (1)
	struct UAnimMontage Groggy_Enter_Random_Hit_Head; // 0x278 (8)
	struct UAnimMontage Groggy_Enter_Random_Hit_Chest; // 0x280 (8)
	struct UAnimMontage Groggy_Enter_Random_Hit_Abdomen; // 0x288 (8)
	struct UAnimMontage Groggy_Enter_Random_Hit_LeftLeg; // 0x290 (8)
	struct UAnimMontage Groggy_Enter_Random_Hit_RightLeg; // 0x298 (8)
	struct UAnimMontage Groggy_Exit; // 0x2A0 (8)
	struct UAnimMontage Death_Random; // 0x2A8 (8)
	struct UAnimMontage Death_GROGGY_Random; // 0x2B0 (8)
	struct UAnimMontage Hit_A; // 0x2B8 (8)
	struct UAnimMontage Hit_B; // 0x2C0 (8)
	struct UAnimMontage Hit_C; // 0x2C8 (8)
};

// Class ProjectD.PDObjectTagSiteUI
class UPDObjectTagSiteUI : public UPDScreenMarkerInteractive {

public:

	struct UImage IMG_ObjectIcon; // 0x2A8 (8)
	struct UPDTextBlock TB_Distance; // 0x2B0 (8)
	struct UCanvasPanel CP_OutArrow; // 0x2B8 (8)
	struct UPDTextBlock TB_Tag; // 0x2C0 (8)
	struct UWidgetSwitcher WS_Type; // 0x2C8 (8)
	struct UCanvasPanel CP_Reply; // 0x2D0 (8)
	struct UPDPingReplyUI Reply01; // 0x2D8 (8)
	struct UPDPingReplyUI Reply02; // 0x2E0 (8)
	struct UPDPingReplyUI Reply03; // 0x2E8 (8)
	struct UPDPingReplyUI Reply04; // 0x2F0 (8)
	struct UPDPingReplyUI Reply05; // 0x2F8 (8)
	struct TArray<struct UPDPingReplyUI> ReplyList; // 0x300 (16)
};

// Class ProjectD.PDObjectTagUI
class UPDObjectTagUI : public UPDScreenMarkerInteractive {

public:

	struct UImage IMG_ObjectIcon; // 0x2A8 (8)
	struct UPDTextBlock TB_Distance; // 0x2B0 (8)
	struct UCanvasPanel CP_OutArrow; // 0x2B8 (8)
};

// Class ProjectD.PDOptionContent
class UPDOptionContent : public UPDUserWidget {

public:

	struct USizeBox SB_OptionContents; // 0x298 (8)
	struct UHorizontalBox HB_Contents; // 0x2A0 (8)
	struct UVerticalBox VB_Image; // 0x2A8 (8)
	struct UCanvasPanel CP_ToolTip; // 0x2B0 (8)
	struct UCanvasPanel CP_Overlap; // 0x2B8 (8)
	struct UPDTextBlock TB_OverlapToolTip; // 0x2C0 (8)
	struct UPDImage IMG_OverlapEnable; // 0x2C8 (8)
	struct UPDImage IMG_OverlapWarning; // 0x2D0 (8)
	struct UPDImage IMG_OverlapWarningToggle; // 0x2D8 (8)
	struct UWidgetSwitcher WS_Contents; // 0x2E0 (8)
	struct UPDComboBox ComboBoxCtrl; // 0x2E8 (8)
	struct UPDSlider SliderCtrl; // 0x2F0 (8)
	struct UPDInputKeySelector NewInputKeySelectorCtrl; // 0x2F8 (8)
	struct UHorizontalBox HB_ToggleTabs; // 0x300 (8)
	struct UPDInputKeySelector NewToggleInputKeySelectorCtrl; // 0x308 (8)
	struct UPDCheckBox CheckBoxCtrl; // 0x310 (8)
	struct UPDTabButton BaseTabBtn; // 0x318 (8)
	struct UPDTextBlock TB_ContentName; // 0x320 (8)
	struct UHorizontalBox HB_Tabs; // 0x328 (8)
	struct UPDButton OneBtn; // 0x330 (8)
	struct UBorder BD_MainImage; // 0x338 (8)
	struct UImage Img_Underline; // 0x340 (8)
	struct UPDTabButtonGroup TabBtnGroup; // 0x358 (8)

	void OnInputKeySelected(struct FInputChord InInputChord); // Function ProjectD.PDOptionContent.OnInputKeySelected(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1835670>
};

// Class ProjectD.PDOptionPopupUI
class UPDOptionPopupUI : public UPDPopupBaseUI {

public:

	struct UPDButton DefaultBtn; // 0x2B8 (8)
	struct UPDButton TabDefaultBtn; // 0x2C0 (8)
	struct UPDButton ConfirmBtn; // 0x2C8 (8)
	struct UPDButton CancelBtn; // 0x2D0 (8)
	struct UPDTabButton DisplaySettingBtn; // 0x2D8 (8)
	struct UPDTabButton SoundSettingBtn; // 0x2E0 (8)
	struct UPDTabButton ControlSettingBtn; // 0x2E8 (8)
	struct UPDTabButton GameplaySettingBtn; // 0x2F0 (8)
	struct UPDTabButtonGroup OptionTabBtnGroup; // 0x2F8 (8)
	struct UWidgetSwitcher OptionPageSwitcher; // 0x300 (8)
	struct UPDDisplayOptionUI DisplayOption; // 0x308 (8)
	struct UPDSoundOptionUI SoundOption; // 0x310 (8)
	struct UPDControlOptionUI ControlOption; // 0x318 (8)
	struct UPDGameplayOptionUI GamePlayOption; // 0x320 (8)
	struct UPDTextBlock TB_DisableTooltip; // 0x328 (8)
	struct UPDImage IMG_DisableConfirm; // 0x330 (8)
	struct UHorizontalBox HB_Ratings; // 0x338 (8)
	struct TMap<enum class EOptionType, struct UPDOptionUIBase> OptionPages; // 0x340 (80)

	void OnClickTabDefaultButton(); // Function ProjectD.PDOptionPopupUI.OnClickTabDefaultButton(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1835650>
	void OnClickSoundButton(); // Function ProjectD.PDOptionPopupUI.OnClickSoundButton(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1835630>
	void OnClickGameplayButton(); // Function ProjectD.PDOptionPopupUI.OnClickGameplayButton(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18355F0>
	void OnClickDisplayButton(); // Function ProjectD.PDOptionPopupUI.OnClickDisplayButton(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18355D0>
	void OnClickDefaultButton(); // Function ProjectD.PDOptionPopupUI.OnClickDefaultButton(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18355B0>
	void OnClickControlsButton(); // Function ProjectD.PDOptionPopupUI.OnClickControlsButton(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1835590>
	void OnClickConfirmButton(); // Function ProjectD.PDOptionPopupUI.OnClickConfirmButton(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1835570>
	void OnClickCancelButton(); // Function ProjectD.PDOptionPopupUI.OnClickCancelButton(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1835550>
};

// Class ProjectD.PDOutGameCameraActor
class APDOutGameCameraActor : public ACameraActor {

public:

	enum class EOutGameCameraType ECameraType; // 0x7B0 (1)
};

// Class ProjectD.PDOutgameCharacterSpawn
class APDOutgameCharacterSpawn : public UActor {

public:

	struct UStaticMeshComponent StaticMeshComp; // 0x220 (8)
	enum class EOutgameCharacterSpawnGroup Grouptype; // 0x228 (1)
	int32_t Index; // 0x22C (4)
};

// Class ProjectD.PDOutGameTopMenu
class UPDOutGameTopMenu : public UPDUserWidget {

public:

	struct UPDButton BTN_GoToFindPartyPage; // 0x288 (8)
	struct UWidgetSwitcher WS_RegisterMercenary; // 0x290 (8)
	struct UImage IMG_NewInvite; // 0x298 (8)
	struct UCanvasPanel CP_TopMenu; // 0x2A0 (8)
	struct UCanvasPanel CP_InfoMenu; // 0x2A8 (8)
	struct UCanvasPanel CP_ContextMenu; // 0x2B0 (8)
	struct UImage IMG_New; // 0x2B8 (8)
	struct UPDButton Btn_Customize; // 0x2C0 (8)
	struct UPDButton Btn_AgentReport; // 0x2C8 (8)
	struct UPDButton Btn_Record; // 0x2D0 (8)
	struct UPDButton Btn_Clan; // 0x2D8 (8)
	struct UImage IMG_BtnActiveBar_Customizing; // 0x2E0 (8)
	struct UImage IMG_BtnActiveBar_Training; // 0x2E8 (8)
	struct UImage IMG_BtnActiveBar_GameGuide; // 0x2F0 (8)
	struct UImage IMG_BtnActiveBar_Clan; // 0x2F8 (8)
	struct UPDButton Btn_Community; // 0x300 (8)
	struct UPDButton Btn_Option; // 0x308 (8)
	struct UPDButton Btn_BattlePass; // 0x310 (8)
	struct UPDButton Btn_Tutorial; // 0x318 (8)
	struct UPDButton Btn_Setting; // 0x320 (8)
	struct UPDButton Btn_Exit; // 0x328 (8)
	struct USizeBox SB_BattlePass; // 0x330 (8)
	struct UImage IMG_SlotDivider_1; // 0x338 (8)
	struct UPDTextBlock TB_Money; // 0x340 (8)
	struct UPDPartySlotListItemUI PartySlot_2; // 0x348 (8)
	struct UPDPartySlotListItemUI PartySlot_3; // 0x350 (8)
	struct UPDPartySlotListItemUI PartySlot_4; // 0x358 (8)
	struct UPDPartySlotListItemUI PartySlot_5; // 0x360 (8)
	struct UPDPartySlotListItemUI PartySlot_6; // 0x368 (8)
	struct UCanvasPanel CP_MainMenu; // 0x370 (8)
	struct UImage IMG_ClanMarkBG; // 0x378 (8)
	struct UImage IMG_ClanMarkFG; // 0x380 (8)
	struct UPDTextBlock TB_Name; // 0x388 (8)
	struct UPDTextBlock TB_ClanName; // 0x390 (8)
	struct UHorizontalBox HB_ClanInfo; // 0x398 (8)
	struct UCanvasPanel CP_ClanImg; // 0x3A0 (8)
	struct UHorizontalBox HB_UserData; // 0x3B0 (8)
	struct UImage IMG_Manner; // 0x3B8 (8)
	struct UImage IMG_Medal1; // 0x3C0 (8)
	struct UImage IMG_Medal2; // 0x3C8 (8)
	struct UImage IMG_Medal3; // 0x3D0 (8)
	struct UCanvasPanel CP_ToolTip; // 0x3D8 (8)
	struct UPDTextBlock TB_DataName; // 0x3E0 (8)
	struct UPDTextBlock TB_DataValue; // 0x3E8 (8)
	struct UPDButton Btn_MailBox; // 0x3F0 (8)
	struct UImage IMG_NewMail; // 0x3F8 (8)
	struct UPDMailNotificationUI MailNotificationUI; // 0x400 (8)
	struct UPDButton Btn_LeaveParty; // 0x408 (8)
	struct UCanvasPanel CP_MannerToolTip; // 0x410 (8)
	struct UPDTextBlock TB_PointLevel; // 0x418 (8)
	struct TArray<struct UPDPartySlotListItemUI> PartySlotArray; // 0x420 (16)

	void SetNewMailLabelVisible(bool bShow); // Function ProjectD.PDOutGameTopMenu.SetNewMailLabelVisible(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838E70>
	void SendPartyInviteInfo(bool bAccept, struct FString PartyID, int64_t USN, struct FString Nickname); // Function ProjectD.PDOutGameTopMenu.SendPartyInviteInfo(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838C60>
	void SendCustomRoomInviteInfo(bool bAccept); // Function ProjectD.PDOutGameTopMenu.SendCustomRoomInviteInfo(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838BD0>
	void QuitGame(); // Function ProjectD.PDOutGameTopMenu.QuitGame(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838BB0>
	void OnUnhoverRecordBtn(); // Function ProjectD.PDOutGameTopMenu.OnUnhoverRecordBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838B90>
	void OnUnhoverClanBtn(); // Function ProjectD.PDOutGameTopMenu.OnUnhoverClanBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838B70>
	void OnUnhoverAgentReportBtn(); // Function ProjectD.PDOutGameTopMenu.OnUnhoverAgentReportBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838B50>
	void OnUnhoverAgentBtn(); // Function ProjectD.PDOutGameTopMenu.OnUnhoverAgentBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838B30>
	void OnHoverRecordBtn(); // Function ProjectD.PDOutGameTopMenu.OnHoverRecordBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838B10>
	void OnHoverClanBtn(); // Function ProjectD.PDOutGameTopMenu.OnHoverClanBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838AF0>
	void OnHoverAgentReportBtn(); // Function ProjectD.PDOutGameTopMenu.OnHoverAgentReportBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838AD0>
	void OnHoverAgentBtn(); // Function ProjectD.PDOutGameTopMenu.OnHoverAgentBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838AB0>
	void OnGuidePageClosed(); // Function ProjectD.PDOutGameTopMenu.OnGuidePageClosed(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838A90>
	void OnClickSettingBtn(); // Function ProjectD.PDOutGameTopMenu.OnClickSettingBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838A70>
	void OnClickRecordBtn(); // Function ProjectD.PDOutGameTopMenu.OnClickRecordBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838A50>
	void OnClickOptionBtn(); // Function ProjectD.PDOutGameTopMenu.OnClickOptionBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838A30>
	void OnClickMailBoxBtn(); // Function ProjectD.PDOutGameTopMenu.OnClickMailBoxBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838A10>
	void OnClickLeavePartyBtn(); // Function ProjectD.PDOutGameTopMenu.OnClickLeavePartyBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18389F0>
	void OnClickGoToFindPartyPageButton(); // Function ProjectD.PDOutGameTopMenu.OnClickGoToFindPartyPageButton(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18389D0>
	void OnClickExitBtn(); // Function ProjectD.PDOutGameTopMenu.OnClickExitBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18389B0>
	void OnClickCommunityBtn(); // Function ProjectD.PDOutGameTopMenu.OnClickCommunityBtn(Final|Native|Public) // <VeiledExperts-Win64-Shipping.exe+0x181A390>
	void OnClickClanBtn(); // Function ProjectD.PDOutGameTopMenu.OnClickClanBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838990>
	void OnClickBattlePassBtn(); // Function ProjectD.PDOutGameTopMenu.OnClickBattlePassBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1838970>
	void OnClickAgentReportBtn(); // Function ProjectD.PDOutGameTopMenu.OnClickAgentReportBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnClickAgentBtn(); // Function ProjectD.PDOutGameTopMenu.OnClickAgentBtn(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1819F20>
	void ExitParty(); // Function ProjectD.PDOutGameTopMenu.ExitParty(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18388B0>
};

// Class ProjectD.PDOwnLeptonListItem
class UPDOwnLeptonListItem : public UPDUserWidget {

public:

	struct UImage IMG_Item; // 0x290 (8)
	struct UImage IMG_Lock; // 0x298 (8)
	struct UImage IMG_New; // 0x2A0 (8)
	struct UImage IMG_PermanentIcon; // 0x2A8 (8)
	struct UCanvasPanel CP_Unlock; // 0x2B0 (8)
	struct UPDTextBlock TB_Name; // 0x2B8 (8)
	struct UPDTextBlock TB_Cost; // 0x2C0 (8)
	struct UBorder BD_Outline; // 0x2C8 (8)
	struct UBorder BD_EquipOutline; // 0x2D0 (8)
	struct UDragDropOperation DragDropOperation; // 0x2D8 (8)
};

// Class ProjectD.PDParticleModule_Collision
class UPDParticleModule_Collision : public UParticleModuleCollision {

public:

	float BounceOffsetWhenStuck; // 0x190 (4)
};

// Class ProjectD.PDPartySlotListItemUI
class UPDPartySlotListItemUI : public UPDUserWidget {

public:

	struct UWidgetSwitcher WS_Leader; // 0x2C0 (8)
	struct UWidgetSwitcher WS_SlotState; // 0x2C8 (8)
	struct UWidgetSwitcher WS_Voice; // 0x2D0 (8)
	struct UImage IMG_Face; // 0x2D8 (8)
	struct UPDTextBlock T_Name; // 0x2E0 (8)
	struct UPDButton SlotButton; // 0x2E8 (8)
	struct UImage IMG_Hover; // 0x2F0 (8)
	struct UPDTextBlock T_InviteName; // 0x2F8 (8)

	void OnClickSlot(); // Function ProjectD.PDPartySlotListItemUI.OnClickSlot(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x180DB20>
	void KickPartyMember(int64_t InPartyUSN); // Function ProjectD.PDPartySlotListItemUI.KickPartyMember(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x18388D0>
};

// Class ProjectD.PDPerkEntryItem
class UPDPerkEntryItem : public UPDUserWidget {

public:

	struct UImage IMG_Icon; // 0x288 (8)
	struct UPDTextBlock TB_Name; // 0x290 (8)
	struct UPDCircleProgress PDCP_ActiveTime; // 0x298 (8)
	struct UPDCircleProgress PDCP_Cooltime; // 0x2A0 (8)
	struct UBorder BD_Ready; // 0x2A8 (8)
	struct UBorder BD_Stack; // 0x2B0 (8)
	struct UPDTextBlock TB_Num; // 0x2B8 (8)
	struct UBorder BD_PerkKey; // 0x2C0 (8)
	struct UPDTextBlock TB_Key; // 0x2C8 (8)
	struct UPDTextBlock TB_CoolTime; // 0x2D0 (8)
};

// Class ProjectD.PDPerkNotifySlot
class UPDPerkNotifySlot : public UPDUserWidget {

public:

	struct UPDTextBlock TB_Message; // 0x288 (8)
};

// Class ProjectD.PDPerkNotifyUI
class UPDPerkNotifyUI : public UPDIngameModeWidget {

public:

	struct UVerticalBox HB_PerkNotifyContainer; // 0x290 (8)
	struct UImage IMG_Icon; // 0x298 (8)
	struct FMargin SlotPadding; // 0x2A0 (16)
	int32_t MaxSlotCount; // 0x2B0 (4)
	float DefaultDuration; // 0x2B4 (4)
};

// Class ProjectD.PDPerkTooltipItem
class UPDPerkTooltipItem : public UPDUserWidget {

public:

	struct UImage IMG_DescIcon; // 0x290 (8)
	struct UPDTextBlock T_PerkName; // 0x298 (8)
	struct UPDTextBlock T_PerkDesc; // 0x2A0 (8)
	struct UCanvasPanel CP_Empty; // 0x2A8 (8)
	struct UCanvasPanel CP_Normal; // 0x2B0 (8)
};

// Class ProjectD.PDPerkUI
class UPDPerkUI : public UPDIngameModeWidget {

public:

	struct UImage IMG_Icon; // 0x290 (8)
	struct UPDTextBlock TB_PerkAlert; // 0x298 (8)
	struct UPDTextBlock TB_PerkDesc; // 0x2A0 (8)
	struct UHorizontalBox HB_PerkAlert; // 0x2A8 (8)
	struct UHorizontalBox HB_PerkContainer; // 0x2B0 (8)
	float PerkDetailPadding; // 0x2B8 (4)
	struct UHorizontalBox HB_Signature; // 0x2C0 (8)
	struct UPDTextBlock TB_SignatureDesc; // 0x2C8 (8)
	struct UCanvasPanel CP_SIG_Key; // 0x2D0 (8)
	struct UPDTextBlock TB_SIG_KeyName; // 0x2D8 (8)
	struct USizeBox SB_Mouse; // 0x2E0 (8)
	struct UWidgetSwitcher WS_Mouse; // 0x2E8 (8)
	struct UCanvasPanel CP_Buff01; // 0x2F0 (8)
	struct UCanvasPanel CP_Buff02; // 0x2F8 (8)
	struct UCanvasPanel CP_Buff03; // 0x300 (8)
	struct UCanvasPanel CP_Buff04; // 0x308 (8)
	struct UCanvasPanel CP_Buff05; // 0x310 (8)
	struct UCanvasPanel CP_Buff06; // 0x318 (8)
	struct UImage IMG_BIcon01; // 0x330 (8)
	struct UImage IMG_BIcon02; // 0x338 (8)
	struct UImage IMG_BIcon03; // 0x340 (8)
	struct UImage IMG_BIcon04; // 0x348 (8)
	struct UImage IMG_BIcon05; // 0x350 (8)
	struct UImage IMG_BIcon06; // 0x358 (8)
	struct TArray<struct UImage> CP_BuffIMGList; // 0x360 (16)
	struct TArray<struct UPDPerkEntryItem> PerkEntryItems; // 0x3C0 (16)
};

// Class ProjectD.PDPersonalMissionModule
class UPDPersonalMissionModule : public UPDUserWidget {

public:

	struct FSlateColor MissionClearColor; // 0x290 (40)
	struct FSlateColor MissionFailColor; // 0x2B8 (40)
	struct FSlateColor MissionErrorColor; // 0x2E0 (40)
	struct UProgressBar PB_MissionTimer; // 0x308 (8)
	struct UCanvasPanel CP_MissionInfo; // 0x310 (8)
	struct UPDTextBlock TB_StateTitle; // 0x318 (8)
	struct UPDTextBlock TB_StateDesc; // 0x320 (8)
	struct UCanvasPanel CP_StateInfo; // 0x328 (8)
	struct UPDTextBlock TB_MissionCount; // 0x330 (8)
	struct UPDTextBlock TB_MissionDesc; // 0x338 (8)
	struct UPDTextBlock TB_MissionTime; // 0x340 (8)
	struct UHorizontalBox HB_RewardItem; // 0x348 (8)
};

// Class ProjectD.PDPersonalMissionRewardModule
class UPDPersonalMissionRewardModule : public UPDUserWidget {

public:

	struct UCanvasPanel CP_RewardCoin; // 0x288 (8)
	struct UCanvasPanel CP_RewardScore; // 0x290 (8)
	struct UImage IMG_RewardItem; // 0x298 (8)
	struct UPDTextBlock TB_RewardText; // 0x2A0 (8)
};

// Class ProjectD.PDPersonalMissionUI
class UPDPersonalMissionUI : public UPDIngameModeWidget {

public:

	struct UVerticalBox VB_MissionList; // 0x290 (8)
	enum class EHorizontalAlignment MissionHAlign; // 0x298 (1)
	struct FMargin MissionPadding; // 0x29C (16)
};

// Class ProjectD.PDPingIndicatorUI
class UPDPingIndicatorUI : public UPDScreenMarkerInteractive {

public:

	struct UCanvasPanel CP_Normal; // 0x2A8 (8)
	struct UImage IMG_Icon; // 0x2B0 (8)
	struct UImage IMG_IconFx; // 0x2B8 (8)
	struct UImage IMG_Pole; // 0x2C0 (8)
	struct UImage IMG_Point; // 0x2C8 (8)
	struct UCanvasPanel CP_Info; // 0x2D0 (8)
	struct UCanvasPanel CP_Item; // 0x2D8 (8)
	struct UImage IMG_Item; // 0x2E0 (8)
	struct UScaleBox SB_Weapon; // 0x2E8 (8)
	struct UImage IMG_Weapon; // 0x2F0 (8)
	struct USizeBox SB_ItemFx; // 0x2F8 (8)
	struct UScaleBox SB_WeaponFx; // 0x300 (8)
	struct UImage IMG_ItemFx; // 0x308 (8)
	struct UCanvasPanel CP_OutArrow; // 0x310 (8)
	struct UBorder BD_Distance; // 0x318 (8)
	struct UPDTextBlock TB_Distance; // 0x320 (8)
	struct UBorder BD_UserColor; // 0x328 (8)
	struct UPDTextBlock TB_UserNum; // 0x330 (8)
};

// Class ProjectD.PDPingLog
class UPDPingLog : public UPDIngameModeWidget {

public:

	struct UVerticalBox VB_LogList; // 0x298 (8)
	enum class EHorizontalAlignment LogHAlign; // 0x2A0 (1)
	struct FMargin LogPadding; // 0x2A4 (16)
	bool InvertToAdd; // 0x2B4 (1)
	int32_t MaxLogCount; // 0x2B8 (4)
	float DefaultDuration; // 0x2BC (4)
	bool AutoRemove; // 0x2C0 (1)
};

// Class ProjectD.PDPingLogItem
class UPDPingLogItem : public UPDUserWidget {

public:

	struct URichTextBlock RTB_Content; // 0x288 (8)
	struct UBorder BD_Background; // 0x290 (8)
};

// Class ProjectD.PDPingReplyUI
class UPDPingReplyUI : public UPDUserWidget {

public:

	struct UImage IMG_Mark; // 0x288 (8)
	struct UImage IMG_Mark_FX; // 0x290 (8)
	struct UCanvasPanel CP_Fx; // 0x298 (8)
};

// Class ProjectD.PDPlayerAnimInstanceFPDummy
class UPDPlayerAnimInstanceFPDummy : public UAnimInstance {

public:

	struct FPDPWUsingInABPAnimDatas PWAnimDatas; // 0x268 (296)
	struct FPDPCUsingInABPAnimDatas PCAnimDatas; // 0x390 (96)
	enum class EPDAnimset AnimSet; // 0x3F0 (1)
	enum class EPDLocoState LocoState; // 0x3F1 (1)
	enum class EPDMovementState MovementState; // 0x3F2 (1)
	enum class EPDStanceState StanceState; // 0x3F3 (1)
	float GaitValue; // 0x3F4 (4)
	float Direction; // 0x3F8 (4)
	struct FRotator ControllRotation; // 0x3FC (12)
	struct FVector ControllLocation; // 0x408 (12)
	struct FRotator WeaponRotation; // 0x414 (12)
	struct FVector WeaponAddOffset; // 0x420 (12)
	struct FRotator LeanRotationOffset; // 0x42C (12)
	struct FRotator CameraLeanRotationOffset; // 0x438 (12)
	struct FVector R_Translate; // 0x444 (12)
	float DefaultRBoneYOffset; // 0x450 (4)
	bool bAimingIdleHolding; // 0x454 (1)
	struct APDPlayerCharacter OwnerPlayerCharacter; // 0x458 (8)
	struct UPDStateComponent OwnerStateComponent; // 0x460 (8)
	bool bDrawWeaponMontagePlayed; // 0x468 (1)
	struct UBlendSpace FireAnim; // 0x470 (8)
	struct UPDFireRecoilLevel FireRecoilLevel; // 0x478 (8)
	struct UPDFireRecoilLevelData RecoilData; // 0x480 (8)
	float LeanBlendMaxTime; // 0x490 (4)
	struct FVector LeanOffset; // 0x494 (12)
	float LeanWeaponAngle; // 0x4A0 (4)
	float LeanCameraAngle; // 0x4A4 (4)
	struct UCurveBase LeanOffsetCurve; // 0x4A8 (8)
	struct UCurveFloat LeanWeaponCurve; // 0x4B0 (8)
	struct UCurveFloat LeanCameraCurve; // 0x4B8 (8)
	float WeaponRollAtMove_Angle; // 0x508 (4)
	struct UCurveFloat WeaponRollAtMove_InCurve; // 0x510 (8)
	struct UCurveFloat WeaponRollAtMove_OutCurve; // 0x518 (8)
	float WeaponRollAtMove_InTime; // 0x520 (4)
	float WeaponRollAtMove_OutTime; // 0x524 (4)
	struct UCurveFloat WeaponRollAtMove_CurrCurve; // 0x528 (8)
	struct FVector StoppingPowerLocation; // 0x548 (12)
	struct FRotator StoppingPowerRotation; // 0x554 (12)
	struct FRotator StoppingPowerRotationWeapon; // 0x560 (12)
};

// Class ProjectD.PDPlayerCheer
class UPDPlayerCheer : public UPDUserWidget {

public:

	struct UCanvasPanel CP_Cheer1; // 0x288 (8)
	struct UCanvasPanel CP_Cheer2; // 0x290 (8)
	struct UCanvasPanel CP_Cheer3; // 0x298 (8)
	struct UPDTextBlock TB_CheerCount1; // 0x2A0 (8)
	struct UPDTextBlock TB_CheerCount2; // 0x2A8 (8)
	struct UPDTextBlock TB_CheerCount3; // 0x2B0 (8)
	struct UPDTextBlock TB_CheerCount1_2; // 0x2B8 (8)
	struct UPDTextBlock TB_CheerCount2_2; // 0x2C0 (8)
	struct UPDTextBlock TB_CheerCount3_2; // 0x2C8 (8)
};

// Class ProjectD.PDPlayerEntryItemBaseUI
class UPDPlayerEntryItemBaseUI : public UPDUserWidget {

public:

	struct UPDTextBlock TB_PlayerName; // 0x288 (8)
	struct UImage IMG_AgentIcon; // 0x290 (8)
	struct UImage IMG_PlayerBack; // 0x298 (8)
	struct UProgressBar PB_Groggy; // 0x2A0 (8)
	struct UWidgetSwitcher WS_State; // 0x2A8 (8)
};

// Class ProjectD.PDPlayerEntryItemAllyUI
class UPDPlayerEntryItemAllyUI : public UPDPlayerEntryItemBaseUI {

public:

	struct UPDTextBlock TB_UserNum; // 0x2C8 (8)
	struct UProgressBar PB_Health; // 0x2D0 (8)
	struct UImage IMG_State; // 0x2D8 (8)
	struct UWidgetSwitcher WS_Voice; // 0x2E0 (8)
	struct UPDPingIndicatorUI PingState; // 0x2E8 (8)
};

// Class ProjectD.PDPlayerEquipmentDetail
class UPDPlayerEquipmentDetail : public UPDUserWidget {

public:

	struct UPDTextBlock TB_Num_Active; // 0x288 (8)
	struct UPDTextBlock TB_ItemName; // 0x290 (8)
	struct UImage IMG_Logo; // 0x298 (8)
	struct UImage IMG_Icon_ActiveWp; // 0x2A0 (8)
	struct UImage IMG_Icon_ActiveMelee; // 0x2A8 (8)
	struct UImage IMG_Icon_ActiveSub; // 0x2B0 (8)
	struct USizeBox SB_ActiveMain; // 0x2B8 (8)
	struct USizeBox SB_ActiveSub; // 0x2C0 (8)
	struct UPDTextBlock TB_CurrentCount; // 0x2C8 (8)
	struct UPDTextBlock TB_TotalCount; // 0x2D0 (8)
	struct UPDTextBlock TB_FireMode; // 0x2D8 (8)
	struct UHorizontalBox HB_Count; // 0x2E0 (8)
	struct UHorizontalBox HB_FireMode; // 0x2E8 (8)
	struct UHorizontalBox HB_Juggernaut; // 0x2F0 (8)
	struct UPDTextBlock TB_Num_Active_2; // 0x2F8 (8)
	struct URetainerBox RB_Progress; // 0x300 (8)
	struct UImage IMG_Progress; // 0x308 (8)
};

// Class ProjectD.PDPlayerEquipmentSlotBase
class UPDPlayerEquipmentSlotBase : public UPDUserWidget {

public:

	struct UWidgetSwitcher WS_State; // 0x288 (8)
	struct UBorder BD_Interaction; // 0x290 (8)
	struct UImage IMG_BasicBack; // 0x298 (8)
	struct UPDTextBlock TB_Num_Empty; // 0x2A0 (8)
	struct UPDTextBlock TB_Num; // 0x2A8 (8)
	struct UImage IMG_Icon_Wp; // 0x2B0 (8)
	struct UImage IMG_Icon_Sub; // 0x2B8 (8)
	struct UHorizontalBox HB_Count; // 0x2C0 (8)
	struct UPDTextBlock TB_Current; // 0x2C8 (8)
	struct UPDTextBlock TB_Total; // 0x2D0 (8)
	struct UPDTextBlock TB_ItemName; // 0x2D8 (8)
};

// Class ProjectD.PDPlayerEquipmentSlot
class UPDPlayerEquipmentSlot : public UPDPlayerEquipmentSlotBase {

public:

	struct UPDTextBlock TB_Num_Active; // 0x2F0 (8)
	struct UImage IMG_Logo; // 0x2F8 (8)
	struct UImage IMG_Icon_ActiveWp; // 0x300 (8)
	struct UImage IMG_Icon_ActiveMelee; // 0x308 (8)
	struct UImage IMG_Icon_ActiveSub; // 0x310 (8)
	struct USizeBox SB_ActiveMain; // 0x318 (8)
	struct USizeBox SB_ActiveSub; // 0x320 (8)
	struct UPDTextBlock TB_CurrentRounds; // 0x328 (8)
	struct UPDTextBlock TB_TotalRounds; // 0x330 (8)
	struct UPDTextBlock TB_FireMode; // 0x338 (8)
	struct UPDTextBlock TB_StackCount; // 0x340 (8)
	struct UHorizontalBox HB_FireMode; // 0x348 (8)
	struct UHorizontalBox HB_AimMode; // 0x350 (8)
	struct UProgressBar PB_Progress_Wp; // 0x358 (8)
	struct UProgressBar PB_Progress_Sub; // 0x360 (8)
};

// Class ProjectD.PDPlayerEquipmentSlotMulti
class UPDPlayerEquipmentSlotMulti : public UPDPlayerEquipmentSlotBase {

public:

	struct UImage IMG_Icon_Sub2; // 0x2F0 (8)
	struct UHorizontalBox HB_Count2; // 0x2F8 (8)
	struct UPDTextBlock TB_Current2; // 0x300 (8)
	struct UPDTextBlock TB_Total2; // 0x308 (8)
	struct UCanvasPanel CP_Equip1; // 0x310 (8)
	struct UCanvasPanel CP_Equip2; // 0x318 (8)
	struct UUniformGridPanel UGP_Selected1; // 0x320 (8)
	struct UUniformGridPanel UGP_Selected2; // 0x328 (8)
};

// Class ProjectD.PDPlayerInfoUI
class UPDPlayerInfoUI : public UPDIngameModeWidget {

public:

	struct UCanvasPanel HPBox; // 0x290 (8)
	struct UProgressBar PB_Health; // 0x298 (8)
	struct UProgressBar PB_Health_Expect; // 0x2A0 (8)
	struct UProgressBar PB_Health_Inc; // 0x2A8 (8)
	struct UProgressBar PB_Health_Dec; // 0x2B0 (8)
	struct UPDTextBlock TB_Health; // 0x2B8 (8)
	struct UPDTextBlock TB_TotalHealth; // 0x2C0 (8)
	struct UPDTextBlock TB_Health_w; // 0x2C8 (8)
	struct UPDTextBlock TB_TotalHealth_w; // 0x2D0 (8)
	struct UCanvasPanel CP_BlackMask; // 0x2D8 (8)
	struct UCanvasPanel CP_WhiteMask; // 0x2E0 (8)
	struct FVector2D HealthSize; // 0x2E8 (8)
	struct UPDPlayerCheer PlayerCheer; // 0x308 (8)
	struct USizeBox SB_DM; // 0x310 (8)
	struct UImage IMG_BombIcon; // 0x318 (8)
	struct UCanvasPanel CP_Juggernaut; // 0x320 (8)
	struct UCanvasPanel CP_ActiveJuggernaut; // 0x328 (8)
	struct UCanvasPanel CP_InactiveJuggernaut; // 0x330 (8)
	struct UImage IM_Juggernaut; // 0x338 (8)
	struct UImage IM_Exosuit; // 0x340 (8)
	struct UPDTextBlock TB_ActiveJuggernaut; // 0x348 (8)
	struct UPDTextBlock TB_InactiveJuggernaut; // 0x350 (8)
	struct UPDPlayerEquipmentDetail EquipmentDetail; // 0x358 (8)
	struct UPDPlayerEquipmentSlotBase ES_Slot01; // 0x360 (8)
	struct UPDPlayerEquipmentSlotBase ES_Slot02; // 0x368 (8)
	struct UPDPlayerEquipmentSlotBase ES_Slot03; // 0x370 (8)
	struct UPDPlayerEquipmentSlotBase ES_Slot04; // 0x378 (8)
	struct UPDPlayerEquipmentSlotBase ES_Slot05; // 0x380 (8)
	struct UPDPlayerEquipmentSlotBase ES_Slot06; // 0x388 (8)
	struct UPDPlayerEquipmentSlotBase ES_Slot07; // 0x390 (8)
	struct UPDPlayerEquipmentSlotBase ES_Slot08; // 0x398 (8)
	struct UPDPlayerEquipmentSlotBase ES_SlotMelee; // 0x3A0 (8)
	struct UPDPlayerEquipmentSlotBase ES_SlotThrowable; // 0x3A8 (8)
	struct UCanvasPanel CP_EquipmentSlide; // 0x3B0 (8)
	struct USpacer SP_EquipLeft; // 0x3B8 (8)
	struct USpacer SP_EquipRight; // 0x3C0 (8)
	struct UPDArmorGaugeDetail ArmorGauge; // 0x420 (8)
	struct UCanvasPanel CP_ItemSkillGaugeDurationTime; // 0x428 (8)
	struct UImage IMG_ItemSkillIcon; // 0x430 (8)
	struct UProgressBar PB_SpeedIncreaseTime; // 0x438 (8)
	struct UCanvasPanel CP_BowCharge; // 0x448 (8)
	struct UCanvasPanel CP_ChargeEf; // 0x450 (8)
	struct UProgressBar PB_BowCharge; // 0x458 (8)
	struct UImage IMG_ChargeFx; // 0x460 (8)
};

// Class ProjectD.PDPlayerSettingUI
class UPDPlayerSettingUI : public UPDIngameModeWidget {

public:

	struct UPDTextBlock T_Desc_Mode; // 0x290 (8)
	struct UPDTextBlock T_Map; // 0x298 (8)
	struct UCanvasPanel CP_TeamMode; // 0x2A0 (8)
	struct UImage IMG_TeamMode; // 0x2A8 (8)
	struct UPDTextBlock T_TeamMode; // 0x2B0 (8)
	struct UPaperSprite AttackImg; // 0x2B8 (8)
	struct UPaperSprite DefenceImg; // 0x2C0 (8)
	struct UCanvasPanel CP_LoadingChar; // 0x2C8 (8)
	struct UPDTextBlock TB_MissionScoreTitle; // 0x2D0 (8)
	struct UCanvasPanel CP_TeamChar; // 0x2D8 (8)
	struct UHorizontalBox HP_TeamCharList; // 0x2E0 (8)
	struct UCanvasPanel CP_Char; // 0x2E8 (8)
	struct UCanvasPanel CP_Lepton; // 0x2F0 (8)
	struct UCanvasPanel CP_UniqueLeptonInfo; // 0x2F8 (8)
	struct UImage IMG_UniqueLepton1; // 0x300 (8)
	struct UImage IMG_UniqueLepton2; // 0x308 (8)
	struct TArray<struct UImage> IMG_UniqueLepton_List; // 0x310 (16)
	struct UPDTextBlock T_UniqueLepton1; // 0x320 (8)
	struct UPDTextBlock T_UniqueLepton2; // 0x328 (8)
	struct TArray<struct UPDTextBlock> T_UniqueLepton_List; // 0x330 (16)
	struct UImage IMG_SelectChar; // 0x340 (8)
	struct UPDTextBlock T_Name; // 0x348 (8)
	struct UImage IMG_Signature; // 0x350 (8)
	struct UPDTextBlock T_Signature; // 0x358 (8)
	struct UTileView TV_CharList; // 0x360 (8)
	struct UPDTabButtonGroup CharTabBtnGroup; // 0x368 (8)
	struct UVerticalBox VB_PresetTabs; // 0x370 (8)
	struct UPDTextBlock T_LeptonInfo_Title; // 0x378 (8)
	struct UWidgetSwitcher WS_EquipSlot1; // 0x380 (8)
	struct UImage IMG_EquipSlot_Perk1; // 0x388 (8)
	struct UPDTextBlock T_EquipSlot_PerkName1; // 0x390 (8)
	struct UWidgetSwitcher WS_EquipSlot2; // 0x398 (8)
	struct UImage IMG_EquipSlot_Perk2; // 0x3A0 (8)
	struct UPDTextBlock T_EquipSlot_PerkName2; // 0x3A8 (8)
	struct UWidgetSwitcher WS_EquipSlot3; // 0x3B0 (8)
	struct UImage IMG_EquipSlot_Perk3; // 0x3B8 (8)
	struct UPDTextBlock T_EquipSlot_PerkName3; // 0x3C0 (8)
	struct UPDTabButtonGroup PresetTabBtnGroup; // 0x3C8 (8)
	struct TArray<struct UWidgetSwitcher> WS_LeptonList; // 0x3D0 (16)
	struct TArray<struct UImage> IMG_LeptonIconList; // 0x3E0 (16)
	struct TArray<struct UPDTextBlock> TB_LeptonNameList; // 0x3F0 (16)

	void OnSelectLaptonPreset(int32_t SelectIndex); // Function ProjectD.PDPlayerSettingUI.OnSelectLaptonPreset(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x183AEA0>
	void OnSelectChar(int32_t SelectAgentIndex); // Function ProjectD.PDPlayerSettingUI.OnSelectChar(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x183AE20>
};

// Class ProjectD.PDPlayLogListItem
class UPDPlayLogListItem : public UPDUserWidget {

public:

	struct UPDTextBlock TB_FileName; // 0x290 (8)
	struct UPDTextBlock TB_FileDate; // 0x298 (8)
	struct UPDTextBlock TB_Round; // 0x2A0 (8)
	struct UWidgetSwitcher WS_PlayLog; // 0x2A8 (8)
	struct UBorder BD_Bg; // 0x2B0 (8)
	struct UAkAudioEvent HoverSound; // 0x2B8 (8)
	struct UAkAudioEvent ClickSound; // 0x2C0 (8)
};

// Class ProjectD.PDPlayLogMapIconPlayerModule
class UPDPlayLogMapIconPlayerModule : public UPDGameMapIconModule {

public:

	struct UCanvasPanel CP_Normal; // 0x2A0 (8)
	struct UImage IMG_State_Groggy; // 0x2A8 (8)
	struct UImage IMG_State_Death; // 0x2B0 (8)
	struct UPDPlayLogTrackLine TrackLine; // 0x2B8 (8)
	struct UBorder BD_Direction; // 0x2C0 (8)
	struct UImage IMG_TeamColor; // 0x2C8 (8)
	struct UImage IMG_UserDirection; // 0x2D0 (8)
	struct UPDTextBlock TB_PlayerName; // 0x2D8 (8)
	struct UWidgetSwitcher WS_PlayerBack; // 0x2E0 (8)
	struct UImage IMG_MVPColor; // 0x2E8 (8)
};

// Class ProjectD.PDPlayLogMapIconSafeZoneDrawer
class UPDPlayLogMapIconSafeZoneDrawer : public UPDUserWidget {

public:

	enum class ESafeZoneDrawType DrawType; // 0x288 (1)
	struct TArray<struct FSafeZoneDrawing> Drawings; // 0x290 (16)
	bool DrawLineAntialias; // 0x2A0 (1)
	float DrawLineTickness; // 0x2A4 (4)
	bool bEdgeRounding; // 0x2A8 (1)
	float EdgeRoundingLen; // 0x2AC (4)
	int32_t EdgeRoundingSegment; // 0x2B0 (4)
};

// Class ProjectD.PDPlayLogMapIconSafeZoneModule
class UPDPlayLogMapIconSafeZoneModule : public UPDGameMapIconModule {

public:

	struct URetainerBox RB_Mask; // 0x2A0 (8)
	struct UCanvasPanel CP_Mask; // 0x2A8 (8)
	struct UImage IMG_Area; // 0x2B0 (8)
	struct UPDPlayLogMapIconSafeZoneDrawer DrawerCurrent; // 0x2B8 (8)
	struct UPDPlayLogMapIconSafeZoneDrawer DrawerNext; // 0x2C0 (8)
	bool RenewalVersion; // 0x2DC (1)
};

// Class ProjectD.PDPlayLogMapIconThrownModule
class UPDPlayLogMapIconThrownModule : public UPDGameMapIconModule {

public:

	struct UImage IMG_Area; // 0x2A0 (8)
	struct UCanvasPanel CP_Replay_Thrown; // 0x2A8 (8)
	struct USizeBox SB_Area; // 0x2B0 (8)
};

// Class ProjectD.PDPlayLogPlayerInfo
class UPDPlayLogPlayerInfo : public UPDUserWidget {

public:

	struct UPDPlayLogMapIconPlayerModule PLMI_Icon; // 0x288 (8)
	struct UPDTextBlock TB_Name; // 0x290 (8)
	struct UImage IMG_CharacterIcon; // 0x298 (8)
	struct UBorder BD_Bg; // 0x2A0 (8)
	struct UPDTextBlock TB_Kill; // 0x2A8 (8)
	struct UPDTextBlock TB_Death; // 0x2B0 (8)
	struct UBorder BD_Outline; // 0x2B8 (8)
	struct UPDCheckBox CB_PlayerView; // 0x2C0 (8)

	void OnChangedCheckBox(bool InValue); // Function ProjectD.PDPlayLogPlayerInfo.OnChangedCheckBox(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x183EB20>
};

// Class ProjectD.PDPlayLogTrackLine
class UPDPlayLogTrackLine : public UPDUserWidget {

public:

	struct UImage IMG_DeathArrow; // 0x288 (8)
};

// Class ProjectD.PDPlayLogUI
class UPDPlayLogUI : public UPDSceneBaseUI {

public:

	struct UPDButton Btn_GotoLobby; // 0x288 (8)
	struct UPDButton Btn_DeleteAll; // 0x290 (8)
	struct UCanvasPanel CP_Map; // 0x298 (8)
	struct UPDPlayLogMapModule PlayLogMap; // 0x2A0 (8)
	struct UPDSlider PDSlider; // 0x2A8 (8)
	struct UPDTextBlock TB_CurMin; // 0x2B0 (8)
	struct UPDTextBlock TB_CurSec; // 0x2B8 (8)
	struct UPDTextBlock TB_MaxMin; // 0x2C0 (8)
	struct UPDTextBlock TB_MaxSec; // 0x2C8 (8)
	struct UListView LV_PlayList; // 0x2D0 (8)
	struct UListView LV_RoundList; // 0x2D8 (8)
	struct UVerticalBox VB_AllyPlayInfo; // 0x2E0 (8)
	struct UVerticalBox VB_EnemyPlayInfo; // 0x2E8 (8)
	struct UPDTabButton TBTN_Normal; // 0x2F0 (8)
	struct UPDTabButton TBTN_Double; // 0x2F8 (8)
	struct UPDTabButton TBTN_Quadruple; // 0x300 (8)
	struct UPDTabButton TBTN_Play; // 0x308 (8)
	struct UPDTabButton TBTN_Stop; // 0x310 (8)
	struct UPDTabButton TBTN_Pause; // 0x318 (8)
	struct UPDTextBlock TB_AtWinType; // 0x320 (8)
	struct UPDTextBlock TB_DeWinType; // 0x328 (8)
	struct UBorder BD_AtWinTypeBg; // 0x330 (8)
	struct UBorder BD_DeWinTypeBg; // 0x338 (8)
	struct UCanvasPanel CP_Loading; // 0x340 (8)
	struct UPDTabButtonGroup SpeedCategoryGroup; // 0x348 (8)
	struct UPDTabButtonGroup PlayCategoryGroup; // 0x350 (8)
	struct UPDKillLogUI KillLog; // 0x358 (8)
	struct UPDTextBlock TB_MapName; // 0x360 (8)
	struct UPDCheckBox CB_VisibleTrack; // 0x368 (8)
	struct UProgressBar PB_PlayerBar; // 0x370 (8)
	float ZoomScaleDefault; // 0x378 (4)
	struct UVerticalBox VB_LogList; // 0x380 (8)
	enum class EHorizontalAlignment LogHAlign; // 0x388 (1)
	struct FMargin LogPadding; // 0x38C (16)
	int32_t MaxLogCount; // 0x39C (4)
	float DefaultDuration; // 0x3A0 (4)
	bool AutoRemove; // 0x3A4 (1)

	void PlayLogStop(); // Function ProjectD.PDPlayLogUI.PlayLogStop(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183EEC0>
	void PlayLogStart(); // Function ProjectD.PDPlayLogUI.PlayLogStart(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183EEA0>
	void PlayLogPause(); // Function ProjectD.PDPlayLogUI.PlayLogPause(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183EE80>
	void OnVisibleTrackChanged(bool Value); // Function ProjectD.PDPlayLogUI.OnVisibleTrackChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183EDF0>
	void OnValueChanged(float InValue); // Function ProjectD.PDPlayLogUI.OnValueChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183ED70>
	void OnSelectedRoundListItem(struct UPDPlayLogListItemData InListItemData); // Function ProjectD.PDPlayLogUI.OnSelectedRoundListItem(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183ECF0>
	void OnSelectedListItem(struct UPDPlayLogListItemData InListItemData); // Function ProjectD.PDPlayLogUI.OnSelectedListItem(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183EC70>
	void OnQuadrupleSpeed(); // Function ProjectD.PDPlayLogUI.OnQuadrupleSpeed(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183EC50>
	void OnNormalSpeed(); // Function ProjectD.PDPlayLogUI.OnNormalSpeed(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183EC10>
	void OnMouseCaptureBegin(); // Function ProjectD.PDPlayLogUI.OnMouseCaptureBegin(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183EBF0>
	void OnDoubleSpeed(); // Function ProjectD.PDPlayLogUI.OnDoubleSpeed(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183EBD0>
	void OnDeleteAllFile(); // Function ProjectD.PDPlayLogUI.OnDeleteAllFile(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183EBB0>
	void MouseCaptureEnd(); // Function ProjectD.PDPlayLogUI.MouseCaptureEnd(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183EAE0>
	void GotoLobby(); // Function ProjectD.PDPlayLogUI.GotoLobby(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183EAC0>
	void DeleteAllFile(); // Function ProjectD.PDPlayLogUI.DeleteAllFile(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183EAA0>
};

// Class ProjectD.PDPostAkEventAnimNotify
class UPDPostAkEventAnimNotify : public UPDBaseAnimNotify {

public:

	struct UAkAudioEvent EventToPost; // 0x48 (8)
};

// Class ProjectD.PDFootstepAkAnimNotify
class UPDFootstepAkAnimNotify : public UPDPostAkEventAnimNotify {

public:

	enum class EHandsAndFeetBone Bone; // 0x50 (1)
	enum class EPDTraceChannel TraceType; // 0x54 (4)
	enum class EPDFootStepNotifyType FootStepNotifyType; // 0x58 (1)
};

// Class ProjectD.PDProgress
class UPDProgress : public UPDUserWidget {

public:

	struct UImage IMG_Progress; // 0x288 (8)
	struct FSlateBrush ProgressMaterial; // 0x290 (136)
	float Percent; // 0x318 (4)
};

// Class ProjectD.PDProgressLeptonListItem
class UPDProgressLeptonListItem : public UPDUserWidget {

public:

	struct UImage IMG_Item; // 0x290 (8)
	struct UPDTextBlock TB_Name; // 0x298 (8)
	struct UPDTextBlock TB_Desc; // 0x2A0 (8)
	struct UPDTextBlock TB_Count; // 0x2A8 (8)
	struct UProgressBar PB_Per; // 0x2B0 (8)
	struct UBorder BD_ItemOutline; // 0x2B8 (8)
};

// Class ProjectD.PDPropActor
class APDPropActor : public UActor {

public:

	struct TArray<struct FName> TargetNameList; // 0x220 (16)
	struct UMaterialParameterCollection Collection; // 0x230 (8)
	bool UseSineGraph; // 0x238 (1)
	float SignGraphRange; // 0x23C (4)
	float SignGraphPeriod; // 0x240 (4)
	float RotatorRoll; // 0x244 (4)
	float RotatorPitch; // 0x248 (4)
	float RotatorYaw; // 0x24C (4)
	float RotationFactor; // 0x250 (4)
	bool IsLamp; // 0x254 (1)
	struct TArray<struct FName> TargetNameList2; // 0x258 (16)
	float RotatorRoll2; // 0x268 (4)
	float RotatorPitch2; // 0x26C (4)
	float RotatorYaw2; // 0x270 (4)
};

// Class ProjectD.PDPulseLight
class APDPulseLight : public UActor {

public:

	struct UPointLightComponent PointLight; // 0x220 (8)
};

// Class ProjectD.PDPurchaseMsg
class UPDPurchaseMsg : public UPDUserWidget {

public:

	struct UBorder B_MessageBg; // 0x288 (8)
	struct UPDTextBlock T_Message; // 0x290 (8)
	struct FLinearColor SuccessBGColor; // 0x298 (16)
	struct FLinearColor FailBGColor; // 0x2A8 (16)
	struct FSlateColor SuccessTextColor; // 0x2B8 (40)
	struct FSlateColor FailTextColor; // 0x2E0 (40)
};

// Class ProjectD.PDRagdollAnimInstance
class UPDRagdollAnimInstance : public UPDAnimInstance {

public:

	bool bIsRagdoll; // 0x280 (1)
};

// Class ProjectD.PDRecruitListItem
class UPDRecruitListItem : public UPDUserWidget {

public:

	struct UBorder BD_Background; // 0x290 (8)
	struct UWidgetSwitcher WS_State; // 0x298 (8)
	struct UImage IMG_Face; // 0x2A0 (8)
	struct UCanvasPanel CP_ClanMarkInfo; // 0x2A8 (8)
	struct UImage IMG_ClanMarkBG; // 0x2B0 (8)
	struct UImage IMG_ClanMarkFG; // 0x2B8 (8)
	struct UPDTextBlock TB_ClanName; // 0x2C0 (8)
	struct UPDTextBlock TB_Nickname; // 0x2C8 (8)
	struct UPDButton Btn_Ok; // 0x2D0 (8)
	struct UPDButton Btn_Cancel; // 0x2D8 (8)
	struct UBorder BD_Disable; // 0x2E0 (8)

	void OnOKClicked(); // Function ProjectD.PDRecruitListItem.OnOKClicked(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183EC30>
	void OnCancelClicked(); // Function ProjectD.PDRecruitListItem.OnCancelClicked(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183EB00>
};

// Class ProjectD.PDReloadAnimNotifyState
class UPDReloadAnimNotifyState : public UAnimNotifyState {

public:

	struct FName MagazineAttachedBone; // 0x30 (8)
	int32_t NotifyType; // 0x38 (4)
};

// Class ProjectD.PDReportPopupUI
class UPDReportPopupUI : public UPDIngameModeWidget {

public:

	struct UPDTextBlock T_Name; // 0x290 (8)
	struct UPDComboBox CB_Category; // 0x298 (8)
	struct UPDComboBox CB_SubCategory; // 0x2A0 (8)
	struct UMultiLineEditableText MET_Opinion; // 0x2A8 (8)
	struct UPDButton ConfirmBtn; // 0x2B0 (8)
	struct UPDButton CancelBtn; // 0x2B8 (8)

	void OnTextChanged_MET_Opinion(struct FText& Text); // Function ProjectD.PDReportPopupUI.OnTextChanged_MET_Opinion(Final|Native|Protected|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1841530>
	void OnSelectionChanged_CB_SubCategory(struct FString sItem, enum class ESelectInfo SelType); // Function ProjectD.PDReportPopupUI.OnSelectionChanged_CB_SubCategory(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1841400>
	void OnSelectionChanged_CB_Category(struct FString sItem, enum class ESelectInfo SelType); // Function ProjectD.PDReportPopupUI.OnSelectionChanged_CB_Category(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18412D0>
	void OnReportConfirmed(); // Function ProjectD.PDReportPopupUI.OnReportConfirmed(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	void OnClick_ConfirmBtn(); // Function ProjectD.PDReportPopupUI.OnClick_ConfirmBtn(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18412B0>
	void OnClick_CancelBtn(); // Function ProjectD.PDReportPopupUI.OnClick_CancelBtn(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x1841290>
};

// Class ProjectD.PDResultExpItemUI
class UPDResultExpItemUI : public UPDUserWidget {

public:

	struct UPDTextBlock TB_ContentName; // 0x288 (8)
	struct UPDTextBlock TB_ContentName_Fx01; // 0x290 (8)
	struct UPDTextBlock TB_ContentName_Fx02; // 0x298 (8)
	struct UPDTextBlock TB_ExpValue; // 0x2A0 (8)
	struct UPDTextBlock TB_ExpValue_Fx01; // 0x2A8 (8)
	struct UPDTextBlock TB_ExpValue_Fx02; // 0x2B0 (8)
};

// Class ProjectD.PDResultMedalItem
class UPDResultMedalItem : public UPDUserWidget {

public:

	struct UPDTextBlock TB_Title; // 0x288 (8)
	struct UPDTextBlock TB_Score; // 0x290 (8)
	struct URetainerBox RB_Mask; // 0x298 (8)
	struct UImage IMG_Medal; // 0x2A0 (8)
	struct UImage IMG_Fx_Smoke; // 0x2A8 (8)
	struct UImage IMG_Fx; // 0x2B0 (8)
	struct UTexture GoldTexture; // 0x2B8 (8)
	struct UTexture SilverTexture; // 0x2C0 (8)
	struct UTexture BronzeTexture; // 0x2C8 (8)
};

// Class ProjectD.PDResultRankScore
class UPDResultRankScore : public UPDUserWidget {

public:

	struct UImage IMG_ScoreBoard_Line01; // 0x288 (8)
	struct UImage IMG_ScoreBoard_Line02; // 0x290 (8)
	struct UImage IMG_ScoreBoard_TopBg01; // 0x298 (8)
	struct UPDTextBlock TB_TeamName; // 0x2A0 (8)
	struct UCanvasPanel CP_PlayerScoreRoot; // 0x2A8 (8)
};

// Class ProjectD.PDResultRankScoreItem
class UPDResultRankScoreItem : public UPDUserWidget {

public:

	struct UImage IMG_SLotBg; // 0x288 (8)
	struct UImage IMG_Agent; // 0x290 (8)
	struct UImage IMG_Lepton1; // 0x298 (8)
	struct UImage IMG_Lepton2; // 0x2A0 (8)
	struct UImage IMG_Lepton3; // 0x2A8 (8)
	struct UImage IMG_Lepton4; // 0x2B0 (8)
	struct UImage IMG_Lepton5; // 0x2B8 (8)
	struct UPDTextBlock TB_Rank; // 0x2C0 (8)
	struct UPDTextBlock TB_Name; // 0x2C8 (8)
	struct UPDTextBlock TB_Point; // 0x2D0 (8)
	struct UPDTextBlock TB_Mission; // 0x2D8 (8)
	struct UPDTextBlock TB_Kill; // 0x2E0 (8)
	struct UPDTextBlock TB_Death; // 0x2E8 (8)
	struct UPDTextBlock TB_AttackDamage; // 0x2F0 (8)
	struct UPDTextBlock TB_Damage; // 0x2F8 (8)
	struct UPDTextBlock TB_UseCoin; // 0x300 (8)
	struct UPDTextBlock TB_Invest; // 0x308 (8)
	struct UCanvasPanel CP_ClanMark; // 0x310 (8)
	struct UImage IMG_ClanMarkBG; // 0x318 (8)
	struct UImage IMG_ClanMark; // 0x320 (8)
};

// Class ProjectD.PDResultRewardItem
class UPDResultRewardItem : public UPDUserWidget {

public:

	struct UImage IMG_Lepton; // 0x288 (8)
	struct UPDTextBlock T_RewardName; // 0x290 (8)
};

// Class ProjectD.PDResultRoundItemUI
class UPDResultRoundItemUI : public UPDUserWidget {

public:

	struct UPDTextBlock TB_Round; // 0x290 (8)
	struct UPDTextBlock TB_ModeName; // 0x298 (8)
	struct UImage IMG_ModeIcon; // 0x2A0 (8)
	struct UWidgetSwitcher WS_ResultType; // 0x2A8 (8)
	struct UBorder BD_Win; // 0x2B0 (8)
	struct UBorder BD_OWin; // 0x2B8 (8)
	struct UBorder BD_Rank; // 0x2C0 (8)
	struct UPDTextBlock TB_Rank; // 0x2C8 (8)
};

// Class ProjectD.PDResultRoundMenuItem
class UPDResultRoundMenuItem : public UPDUserWidget {

public:

	struct UWidgetSwitcher WS_ResultType; // 0x298 (8)
	struct UImage IMG_ModeIcon; // 0x2A0 (8)
	struct UImage IMG_SLotBg; // 0x2A8 (8)
	struct UImage IMG_SLotBg_Solo; // 0x2B0 (8)
	struct UImage IMG_SLotBg_BM; // 0x2B8 (8)
	struct UCanvasPanel CP_Result_Selected; // 0x2C0 (8)
	struct UImage IMG_Result_SelectedFx_Blue; // 0x2C8 (8)
	struct UImage IMG_Result_SelectedFx_Orange; // 0x2D0 (8)
	struct UImage IMG_Result_SelectedBar; // 0x2D8 (8)
	struct UPDTextBlock T_RoundInfo; // 0x2E0 (8)
	struct UPDTextBlock T_Win; // 0x2E8 (8)
	struct UPDTextBlock T_Draw; // 0x2F0 (8)
	struct UPDTextBlock T_Lose; // 0x2F8 (8)
	struct UPDTextBlock T_Rank; // 0x300 (8)
	struct UBorder B_Scheduled; // 0x308 (8)
	struct UBorder B_ResultCause; // 0x310 (8)
	struct UImage IMG_CauseIcon; // 0x318 (8)
	struct UBorder B_All; // 0x320 (8)
	struct UPDButton BTN_Area; // 0x328 (8)
	struct UPaperSprite AttackImg; // 0x330 (8)
	struct UPaperSprite DefenceImg; // 0x338 (8)
	struct UPaperSprite InstallImg; // 0x340 (8)
	struct UPaperSprite DeactiveImg; // 0x348 (8)
	struct UPaperSprite KilledImg; // 0x350 (8)
	struct UPaperSprite TimeOutImg; // 0x358 (8)

	void OnClickMenu(); // Function ProjectD.PDResultRoundMenuItem.OnClickMenu(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1841270>
};

// Class ProjectD.PDResultRoundPlayerItem
class UPDResultRoundPlayerItem : public UPDUserWidget {

public:

	struct UImage IMG_SLotBg; // 0x288 (8)
	struct UImage IMG_AgnetPic; // 0x290 (8)
	struct UImage IMG_ClanMark; // 0x298 (8)
	struct UImage IMG_ClanMark_Bg; // 0x2A0 (8)
	struct UPDTextBlock TB_Name; // 0x2A8 (8)
	struct UPDTextBlock T_PlayerNum; // 0x2B0 (8)
	struct UPDTextBlock TB_Kill; // 0x2B8 (8)
	struct UPDTextBlock TB_Death; // 0x2C0 (8)
	struct UPDCheckBox CB_PlayerView; // 0x2C8 (8)
	struct UCanvasPanel CP_ClanMark; // 0x2D0 (8)

	void OnChangedCheckBox(bool InValue); // Function ProjectD.PDResultRoundPlayerItem.OnChangedCheckBox(Final|Native|Protected) // <VeiledExperts-Win64-Shipping.exe+0x18411E0>
};

// Class ProjectD.PDResultRoundPlayerList
class UPDResultRoundPlayerList : public UPDUserWidget {

public:

	struct UImage IMG_Attack; // 0x288 (8)
	struct UImage IMG_Defense; // 0x290 (8)
	struct UBorder BD_ResultBg; // 0x298 (8)
	struct UPDTextBlock TB_TeamName; // 0x2A0 (8)
	struct UPDTextBlock TB_Result; // 0x2A8 (8)
	struct UPDResultRoundPlayerItem RRP_Item1; // 0x2B0 (8)
	struct UPDResultRoundPlayerItem RRP_Item2; // 0x2B8 (8)
	struct UPDResultRoundPlayerItem RRP_Item3; // 0x2C0 (8)
	struct UPDResultRoundPlayerItem RRP_Item4; // 0x2C8 (8)
	struct UPDResultRoundPlayerItem RRP_Item5; // 0x2D0 (8)
	struct TArray<struct UPDResultRoundPlayerItem> RoundPlayerItems; // 0x2D8 (16)
};

// Class ProjectD.PDResultScoreItem
class UPDResultScoreItem : public UPDUserWidget {

public:

	struct UPDTextBlock T_ScoreName; // 0x288 (8)
	struct UPDTextBlock T_Score; // 0x290 (8)
};

// Class ProjectD.PDResultTeamMemberUI
class UPDResultTeamMemberUI : public UPDUserWidget {

public:

	struct UPDTextBlock TB_Nickname; // 0x288 (8)
	struct UImage IMG_Icon; // 0x290 (8)
	struct UPDTextBlock TB_Status; // 0x298 (8)
	struct UPDTextBlock TB_Record; // 0x2A0 (8)
	struct UPDTextBlock TB_Postfix; // 0x2A8 (8)
	struct UCanvasPanel CP_MVP; // 0x2B0 (8)
	struct UImage IMG_MVP_FxBg; // 0x2B8 (8)
};

// Class ProjectD.PDResultTeamScore
class UPDResultTeamScore : public UPDUserWidget {

public:

	struct UImage IMG_ScoreBoard_Line01; // 0x288 (8)
	struct UImage IMG_ScoreBoard_Line02; // 0x290 (8)
	struct UImage IMG_ScoreBoard_TopBg01; // 0x298 (8)
	struct UPDTextBlock TB_TeamName; // 0x2A0 (8)
	struct UPDTextBlock TB_TotalMVP; // 0x2A8 (8)
	struct UPDTextBlock TB_TotalKill; // 0x2B0 (8)
	struct UPDTextBlock TB_TotalDeath; // 0x2B8 (8)
	struct UPDTextBlock TB_TotalAssist; // 0x2C0 (8)
	struct UPDTextBlock TB_TotalRescue; // 0x2C8 (8)
	struct UPDTextBlock TB_TotalMission; // 0x2D0 (8)
	struct UPDTextBlock TB_TotalAlive; // 0x2D8 (8)
	struct UPDTextBlock TB_TotalAttackDamage; // 0x2E0 (8)
	struct UPDTextBlock TB_TotalDamage; // 0x2E8 (8)
	struct UPDTextBlock TB_TotalUseCoin; // 0x2F0 (8)
	struct UPDTextBlock TB_TotalInvest; // 0x2F8 (8)
	struct UPDResultTeamScoreItem RTSI_List1; // 0x300 (8)
	struct UPDResultTeamScoreItem RTSI_List2; // 0x308 (8)
	struct UPDResultTeamScoreItem RTSI_List3; // 0x310 (8)
	struct UPDResultTeamScoreItem RTSI_List4; // 0x318 (8)
	struct UPDResultTeamScoreItem RTSI_List5; // 0x320 (8)
	struct TArray<struct UPDResultTeamScoreItem> PlayerScoreItems; // 0x328 (16)
};

// Class ProjectD.PDResultTeamScoreItem
class UPDResultTeamScoreItem : public UPDUserWidget {

public:

	struct UImage IMG_SLotBg; // 0x288 (8)
	struct UImage IMG_Agent; // 0x290 (8)
	struct UImage IMG_Lepton1; // 0x298 (8)
	struct UImage IMG_Lepton2; // 0x2A0 (8)
	struct UImage IMG_Lepton3; // 0x2A8 (8)
	struct UImage IMG_Lepton4; // 0x2B0 (8)
	struct UImage IMG_Lepton5; // 0x2B8 (8)
	struct UPDTextBlock TB_Name; // 0x2C0 (8)
	struct UPDTextBlock TB_MVP; // 0x2C8 (8)
	struct UPDTextBlock TB_Kill; // 0x2D0 (8)
	struct UPDTextBlock TB_Death; // 0x2D8 (8)
	struct UPDTextBlock TB_Assist; // 0x2E0 (8)
	struct UPDTextBlock TB_Rescue; // 0x2E8 (8)
	struct UPDTextBlock TB_Mission; // 0x2F0 (8)
	struct UPDTextBlock TB_Alive; // 0x2F8 (8)
	struct UPDTextBlock TB_AttackDamage; // 0x300 (8)
	struct UPDTextBlock TB_Damage; // 0x308 (8)
	struct UPDTextBlock TB_UseCoin; // 0x310 (8)
	struct UPDTextBlock TB_Invest; // 0x318 (8)
	struct UCanvasPanel CP_ClanMark; // 0x320 (8)
	struct UImage IMG_ClanMarkBG; // 0x328 (8)
	struct UImage IMG_ClanMark; // 0x330 (8)
};

// Class ProjectD.PDResultTitleAchieveItem
class UPDResultTitleAchieveItem : public UPDUserWidget {

public:

	struct UPDTextBlock T_Achieve_Title; // 0x288 (8)
	struct UPDTextBlock T_Achieve_Desc; // 0x290 (8)
	struct UPDTextBlock T_Achieve_DescInfo; // 0x298 (8)
	struct UPDTextBlock T_Achieve_RecordName; // 0x2A0 (8)
	struct UPDTextBlock T_Achieve_Record; // 0x2A8 (8)
	struct UImage IMG_TopBg; // 0x2B0 (8)
	struct UImage IMG_BottomBg; // 0x2B8 (8)
};

// Class ProjectD.PDResultTitleAgentNameItem
class UPDResultTitleAgentNameItem : public UPDUserWidget {

public:

	struct UPDTextBlock T_UserName; // 0x288 (8)
	struct UPDTextBlock T_ClanName; // 0x290 (8)
	struct UImage IMG_Medal_01; // 0x298 (8)
	struct UImage IMG_Medal_02; // 0x2A0 (8)
	struct UImage IMG_Medal_03; // 0x2A8 (8)
	struct UImage IMG_Medal_04; // 0x2B0 (8)
	struct UImage IMG_Medal_05; // 0x2B8 (8)
	struct UBorder B_ClanMark_Bg; // 0x2C0 (8)
	struct UImage IMG_ClanMark; // 0x2C8 (8)
};

// Class ProjectD.PDResultTitleItem
class UPDResultTitleItem : public UPDUserWidget {

public:

	struct UPDResultTitleAgentNameItem RTANI_Agent; // 0x288 (8)
	struct UPDResultTitleAchieveItem RTAI_Title; // 0x290 (8)
	struct UCanvasPanel CP_RankNumber; // 0x298 (8)
	struct UCanvasPanel CP_RankRecord; // 0x2A0 (8)
	struct UImage IMG_RankRecordBg; // 0x2A8 (8)
	struct UPDTextBlock TB_RankRecordPoint; // 0x2B0 (8)
	struct UWidgetSwitcher WS_Rank; // 0x2B8 (8)
	struct UHorizontalBox HB_UserData; // 0x2C0 (8)
	struct UImage IMG_Medal1; // 0x2C8 (8)
	struct UImage IMG_Medal2; // 0x2D0 (8)
	struct UImage IMG_Medal3; // 0x2D8 (8)
};

// Class ProjectD.PDRingCommandUI
class UPDRingCommandUI : public UPDIngameModeWidget {

public:

	struct UCanvasPanel CP_Category; // 0x290 (8)
	struct UCanvasPanel CP_Menu; // 0x298 (8)
	struct URetainerBox RB_Menu; // 0x2A0 (8)
	struct UCanvasPanel CP_Inner; // 0x2A8 (8)
	struct UBorder W_DirectionRing; // 0x2B0 (8)
	struct UCanvasPanel CP_Ring1; // 0x2B8 (8)
	struct UCanvasPanel CP_Ring2; // 0x2C0 (8)
	struct UCanvasPanel CP_Ring3; // 0x2C8 (8)
	struct UCanvasPanel CP_Ring6; // 0x2D0 (8)
	struct UImage IMG_Hovered1; // 0x2D8 (8)
	struct UImage IMG_Hovered2_1; // 0x2E0 (8)
	struct UImage IMG_Hovered2_2; // 0x2E8 (8)
	struct UImage IMG_Hovered3_1; // 0x2F0 (8)
	struct UImage IMG_Hovered3_2; // 0x2F8 (8)
	struct UImage IMG_Hovered3_3; // 0x300 (8)
	struct UImage IMG_Hovered6_1; // 0x308 (8)
	struct UImage IMG_Hovered6_2; // 0x310 (8)
	struct UImage IMG_Hovered6_3; // 0x318 (8)
	struct UImage IMG_Hovered6_4; // 0x320 (8)
	struct UImage IMG_Hovered6_5; // 0x328 (8)
	struct UImage IMG_Hovered6_6; // 0x330 (8)
	struct UImage IMG_Icon0; // 0x338 (8)
	struct UImage IMG_Icon1; // 0x340 (8)
	struct UImage IMG_Icon2; // 0x348 (8)
	struct UImage IMG_Icon3; // 0x350 (8)
	struct UImage IMG_Icon4; // 0x358 (8)
	struct UImage IMG_Icon5; // 0x360 (8)
	struct UPDTextBlock TB_Text0; // 0x368 (8)
	struct UPDTextBlock TB_Text1; // 0x370 (8)
	struct UPDTextBlock TB_Text2; // 0x378 (8)
	struct UPDTextBlock TB_Text3; // 0x380 (8)
	struct UPDTextBlock TB_Text4; // 0x388 (8)
	struct UPDTextBlock TB_Text5; // 0x390 (8)
	struct USizeBox SB_Key0; // 0x398 (8)
	struct USizeBox SB_Key1; // 0x3A0 (8)
	struct USizeBox SB_Key2; // 0x3A8 (8)
	struct USizeBox SB_Key3; // 0x3B0 (8)
	struct USizeBox SB_Key4; // 0x3B8 (8)
	struct USizeBox SB_Key5; // 0x3C0 (8)
	struct UPDTextBlock TB_Key0; // 0x3C8 (8)
	struct UPDTextBlock TB_Key1; // 0x3D0 (8)
	struct UPDTextBlock TB_Key2; // 0x3D8 (8)
	struct UPDTextBlock TB_Key3; // 0x3E0 (8)
	struct UPDTextBlock TB_Key4; // 0x3E8 (8)
	struct UPDTextBlock TB_Key5; // 0x3F0 (8)
	struct UBorder BD_Category1; // 0x3F8 (8)
	struct UBorder BD_Category2; // 0x400 (8)
	struct UBorder BD_Category3; // 0x408 (8)
	struct UBorder BD_Category4; // 0x410 (8)
	struct UBorder BD_Category5; // 0x418 (8)
	struct TArray<struct UBorder> CategoryList; // 0x420 (16)
	float GlitchIntensity; // 0x430 (4)
	float GlitchDuration; // 0x434 (4)
};

// Class ProjectD.PDRoadActor
class APDRoadActor : public UActor {

public:

	enum class EGuideType GuideType; // 0x220 (1)
	struct UArrowComponent StartArrow; // 0x228 (8)
	struct UPDSplineComponent MainSpline; // 0x230 (8)
	struct APDRoadActor Parent; // 0x238 (8)
};

// Class ProjectD.PDRoundInfoUI
class UPDRoundInfoUI : public UPDIngameModeWidget {

public:

	struct UCanvasPanel CP_PlayTimeBomb; // 0x290 (8)
	struct UCanvasPanel CP_RoundScore; // 0x298 (8)
	struct UImage IMG_Defuse; // 0x2A0 (8)
	struct UPDTextBlock TB_ShopNoti; // 0x2A8 (8)
	struct UPDTextBlock TB_Round; // 0x2B0 (8)
	struct UPanelWidget PW_ShopGuide; // 0x2B8 (8)
	struct UPDTextBlock T_ShopKey; // 0x2C0 (8)
	struct UHorizontalBox HB_EntryA; // 0x2C8 (8)
	struct UHorizontalBox HB_EntryB; // 0x2D0 (8)
	struct UPDTextBlock TB_ScoreA; // 0x2D8 (8)
	struct UPDTextBlock TB_ScoreB; // 0x2E0 (8)
	struct UImage IMG_TeamStateA; // 0x2E8 (8)
	struct UImage IMG_TeamStateB; // 0x2F0 (8)
	struct UBorder BD_ScoreBackL; // 0x2F8 (8)
	struct UBorder BD_ScoreBackR; // 0x300 (8)
	struct UPDSeedProgressModule SSM_SeedProgress; // 0x308 (8)
	struct UImage IMG_Highlight_Tutorial; // 0x310 (8)
	int32_t WarningShopTime; // 0x318 (4)
	struct FMargin EntryPadding; // 0x31C (16)
};

// Class ProjectD.PDRoundRecord
class UPDRoundRecord : public UPDUserWidget {

public:

	struct UImage IMG_MVPBack; // 0x288 (8)
	struct UImage IMG_MVP; // 0x290 (8)
	struct UImage IMG_GlowFx; // 0x298 (8)
	struct UImage IMG_ClanMarkBG; // 0x2A0 (8)
	struct UImage IMG_ClanMarkFG; // 0x2A8 (8)
	struct UPDTextBlock TB_Character; // 0x2B0 (8)
	struct UPDTextBlock TB_Player; // 0x2B8 (8)
	struct UPDRoundRecordItem MVPRecord01; // 0x2C0 (8)
	struct UPDRoundRecordItem MVPRecord02; // 0x2C8 (8)
	struct UPDRoundRecordItem MVPRecord03; // 0x2D0 (8)
	struct UPDRoundRecordItem MVPRecord04; // 0x2D8 (8)
	struct UPDRoundRecordItem MVPRecord05; // 0x2E0 (8)
	struct TArray<struct UPDRoundRecordItem> MVPRecords; // 0x2E8 (16)
};

// Class ProjectD.PDRoundRecordItem
class UPDRoundRecordItem : public UPDUserWidget {

public:

	struct UPDTextBlock TB_Title; // 0x288 (8)
	struct UPDTextBlock TB_Content; // 0x290 (8)
	struct UImage IMG_Coin; // 0x298 (8)
	bool VisibleCoinIcon; // 0x2A0 (1)
	struct UImage IMG_Glow; // 0x2A8 (8)
};

// Class ProjectD.PDRoundReplayer
class UPDRoundReplayer : public UPDIngameModeWidget {

public:

	struct UPDKillLogUI KillLog; // 0x290 (8)
	struct UPDPlayLogMapModule ReplayGameMap; // 0x298 (8)
	struct UPDTabButton Btn_Play; // 0x2A0 (8)
	struct UPDTabButton Btn_Stop; // 0x2A8 (8)
	struct UPDTabButton Btn_Pause; // 0x2B0 (8)
	struct UPDTextBlock TB_CurMin; // 0x2B8 (8)
	struct UPDTextBlock TB_CurSec; // 0x2C0 (8)
	struct UPDTextBlock TB_MaxMin; // 0x2C8 (8)
	struct UPDTextBlock TB_MaxSec; // 0x2D0 (8)
	struct UPDTextBlock T_Replay; // 0x2D8 (8)
	struct UPDSlider S_TimePicker; // 0x2E0 (8)
	struct UPDTabButton Btn_Normal; // 0x2E8 (8)
	struct UPDTabButton Btn_Double; // 0x2F0 (8)
	struct UPDTabButton Btn_Quadruple; // 0x2F8 (8)
	struct UPDButton Btn_Round; // 0x300 (8)
	struct UBorder BD_PlayerBarCover; // 0x308 (8)
	struct UPDTextBlock T_Dropdown_Round; // 0x310 (8)
	struct UPDTextBlock T_Dropdown_Match; // 0x318 (8)
	struct UPDTextBlock T_Dropdown_Time; // 0x320 (8)
	struct UImage IMG_Dropdown_Arrow; // 0x328 (8)
	struct UPDStatusBoardRoundList StatusBoardRoundList; // 0x330 (8)
	struct UCanvasPanel CP_ReplayerScreen; // 0x338 (8)
	struct UProgressBar PB_PlayerBar; // 0x340 (8)
	struct UCanvasPanel CP_ReplayMenu; // 0x348 (8)
	struct UPDButton Btn_Replay_Close; // 0x350 (8)
	struct UCanvasPanel CP_PlaySpeedView; // 0x358 (8)
	struct UPDTextBlock TB_PlayerSpeed; // 0x360 (8)
	struct UPDTabButtonGroup SpeedCategoryGroup; // 0x368 (8)
	struct UPDTabButtonGroup PlayCategoryGroup; // 0x370 (8)

	void OnValueChanged(float InValue); // Function ProjectD.PDRoundReplayer.OnValueChanged(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1845240>
	void OnMouseCaptureBegin(); // Function ProjectD.PDRoundReplayer.OnMouseCaptureBegin(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x183EBF0>
	void OnClickQuadrupleSpeed(); // Function ProjectD.PDRoundReplayer.OnClickQuadrupleSpeed(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1844AC0>
	void OnClickPlayLogStop(); // Function ProjectD.PDRoundReplayer.OnClickPlayLogStop(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1844AA0>
	void OnClickPlayLogStart(); // Function ProjectD.PDRoundReplayer.OnClickPlayLogStart(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1844A80>
	void OnClickPlayLogPause(); // Function ProjectD.PDRoundReplayer.OnClickPlayLogPause(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1844A60>
	void OnClickNormalSpeed(); // Function ProjectD.PDRoundReplayer.OnClickNormalSpeed(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1844A40>
	void OnClickDoubleSpeed(); // Function ProjectD.PDRoundReplayer.OnClickDoubleSpeed(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1844A20>
	void MouseCaptureEnd(); // Function ProjectD.PDRoundReplayer.MouseCaptureEnd(Final|Native|Private) // <VeiledExperts-Win64-Shipping.exe+0x1844870>
};

// Class ProjectD.PDRoundResult
class UPDRoundResult : public UPDIngameModeWidget {

public:

	struct UBorder BD_ResultContent02; // 0x290 (8)
	struct UImage IMG_RR_TitleColorR_4; // 0x298 (8)
	struct UPDTextBlock TB_ResultText00; // 0x2A0 (8)
	struct UPDTextBlock TB_ResultText01; // 0x2A8 (8)
	struct UPDTextBlock TB_Count; // 0x2B0 (8)
	struct UImage IMG_TitleBack00; // 0x2B8 (8)
	struct UImage IMG_TitleBack01; // 0x2C0 (8)
	struct UImage IMG_TitleBack02; // 0x2C8 (8)
	struct UImage IMG_TitleReusltColor; // 0x2D0 (8)
	struct UImage IMG_Dot01; // 0x2D8 (8)
	struct UPDTextBlock TB_EndRound; // 0x2E0 (8)
	struct UImage IMG_RR_LeftTeamBack; // 0x2E8 (8)
	struct UPDTextBlock TB_LeftTeam; // 0x2F0 (8)
	struct UImage IMG_RightTeamBack; // 0x2F8 (8)
	struct UPDTextBlock TB_FoeName; // 0x300 (8)
	struct UHorizontalBox HB_RoundRoot; // 0x308 (8)
	struct TArray<struct UPDResultRoundItemUI> RoundItems; // 0x310 (16)
	struct UPDRoundReview Review; // 0x320 (8)
};

// Class ProjectD.PDRoundReview
class UPDRoundReview : public UPDUserWidget {

public:

	struct UImage IMG_MVP_Text; // 0x290 (8)
	struct UImage IMG_Fx; // 0x298 (8)
	struct UImage IMG_GlowFx; // 0x2A0 (8)
	struct UImage IMG_KEY; // 0x2A8 (8)
	struct UImage IMG_Rating; // 0x2B0 (8)
	struct UImage IMG_ClanMarkBG_Ally; // 0x2B8 (8)
	struct UImage IMG_ClanMarkFG_Ally; // 0x2C0 (8)
	struct UPDTextBlock TB_UserName; // 0x2C8 (8)
	struct UPDRoundRecordItem AllyRecord01; // 0x2D0 (8)
	struct UPDRoundRecordItem AllyRecord02; // 0x2D8 (8)
	struct UPDRoundRecordItem AllyRecord03; // 0x2E0 (8)
	struct UPDRoundRecordItem AllyRecord04; // 0x2E8 (8)
	struct UPDRoundRecordItem AllyRecord05; // 0x2F0 (8)
	struct UPDRoundRecordItem AllyRecord06; // 0x2F8 (8)
	struct TArray<struct UPDRoundRecordItem> AllyKeyRecords; // 0x300 (16)
	struct UImage IMG_FX_Foe; // 0x310 (8)
	struct UImage IMG_GlowFx_Foe; // 0x318 (8)
	struct UImage IMG_KEY_foe; // 0x320 (8)
	struct UImage IMG_Rating_Foe; // 0x328 (8)
	struct UImage IMG_ClanMarkBG_Enemy; // 0x330 (8)
	struct UImage IMG_ClanMarkFG_Enemy; // 0x338 (8)
	struct UPDTextBlock TB_UserName_Foe; // 0x340 (8)
	struct UPDRoundRecordItem EnemyRecord01; // 0x348 (8)
	struct UPDRoundRecordItem EnemyRecord02; // 0x350 (8)
	struct UPDRoundRecordItem EnemyRecord03; // 0x358 (8)
	struct UPDRoundRecordItem EnemyRecord04; // 0x360 (8)
	struct UPDRoundRecordItem EnemyRecord05; // 0x368 (8)
	struct UPDRoundRecordItem EnemyRecord06; // 0x370 (8)
	struct UPDRoundReplayer RoundReplayer; // 0x378 (8)
	struct TArray<struct UPDRoundRecordItem> EnemyKeyRecords; // 0x380 (16)
};

// Class ProjectD.PDRoundWaitUI
class UPDRoundWaitUI : public UPDIngameModeWidget {

public:

	struct UPDTextBlock TB_Desc; // 0x290 (8)
};

// Class ProjectD.PDScreenMarkerLoot
class UPDScreenMarkerLoot : public UPDHUDIconBaseUI {

public:

	struct UCanvasPanel CP_Root; // 0x2A0 (8)
	struct UPDCircleProgressModule PB_LootTime; // 0x2A8 (8)
};

// Class ProjectD.PDSeedProgressModule
class UPDSeedProgressModule : public UPDUserWidget {

public:

	struct FDelegate GetProgressPerDelegate; // 0x288 (16)
	struct UPDTextBlock TB_SeedDesc; // 0x298 (8)
	struct UPDTextBlock TB_PerText; // 0x2A0 (8)
	struct UProgressBar PRG_SeedSet; // 0x2A8 (8)
	struct UImage IMG_Icon; // 0x2B0 (8)
	struct UImage IMG_GaugeLight; // 0x2B8 (8)
	struct UCanvasPanel CP_Gauge; // 0x2C0 (8)
};

// Class ProjectD.PDShowBowStringNotify
class UPDShowBowStringNotify : public UPDBaseAnimNotify {

public:

	enum class EBowStringAction Action; // 0x48 (1)
};

// Class ProjectD.PDSkeletalMeshComponent
class UPDSkeletalMeshComponent : public USkeletalMeshComponent {

public:

	char bEnableLag : 1; // 0xAC8 (1)
	float LagSpeed; // 0xACC (4)
	float LagMaxTimeStep; // 0xAD0 (4)
	float DistanceThreashold; // 0xAD4 (4)
	char m_bEnableSystemLag : 1; // 0xAD8 (1)
	char m_bEnableLag : 1; // 0xAD8 (1)
	char m_bUpdateLag : 1; // 0xAD8 (1)
	char pad_ADC_4 : 4; // 0xADC (1)
	float m_OrgRelativeLocationZ; // 0xAE4 (4)
	struct FVector PreviousDesiredLoc; // 0xAE8 (12)
	struct FVector CurrentCharacterLoc; // 0xAF4 (12)
	float m_fCurrentRelativeZOffset; // 0xB00 (4)
	struct FVector RelativeSocketLocation; // 0xB04 (12)
	struct ACharacter m_pOwnerCharacter; // 0xB10 (8)
	struct USkeletalMeshComponent m_pTargetSkeletalMesh; // 0xB18 (8)
};

// Class ProjectD.PDSkyViewUI
class UPDSkyViewUI : public UPDUserWidget {

public:

	struct UCanvasPanel CP_Map; // 0x288 (8)
	struct UCanvasPanel CP_DefuseBomb; // 0x290 (8)
	struct UCanvasPanel CP_MissionScore; // 0x298 (8)
	struct UWidgetSwitcher WS_BattleStyle; // 0x2A0 (8)
	struct URichTextBlock RTB_SeedAlert; // 0x2A8 (8)
	struct UPDTextBlock TB_AtkStr; // 0x2B0 (8)
	struct UPDTextBlock TB_DefStr; // 0x2B8 (8)
	struct UPDGameMapModule GameMap; // 0x2C0 (8)
	struct UImage IMG_Agent; // 0x2C8 (8)
	struct UImage IMG_PlayerNum; // 0x2D0 (8)
	struct UTexture PlayerTextureNum01; // 0x2D8 (8)
	struct UTexture PlayerTextureNum02; // 0x2E0 (8)
	struct UTexture PlayerTextureNum03; // 0x2E8 (8)
	struct UTexture PlayerTextureNum04; // 0x2F0 (8)
	struct UTexture PlayerTextureNum05; // 0x2F8 (8)
	struct UCanvasPanel CP_Recently01; // 0x300 (8)
