// WidgetBlueprintGeneratedClass RecruitListItem.RecruitListItem_C
class URecruitListItem_C : public UPDRecruitListItem {

public:

	struct UImage Img_BottomLine; // 0x330 (8)
	struct UImage IMG_Cancel; // 0x338 (8)
	struct UImage IMG_Canceled; // 0x340 (8)
	struct UImage IMG_Face_Outline; // 0x348 (8)
	struct UImage IMG_Invite_Indicator_4; // 0x350 (8)
	struct UImage IMG_Join; // 0x358 (8)
	struct UImage IMG_PictureBg; // 0x360 (8)
	struct UImage IMG_RecuritFalied; // 0x368 (8)
};

