// WidgetBlueprintGeneratedClass ResultRankScore.ResultRankScore_C
class UResultRankScore_C : public UPDResultRankScore {

public:

	struct UWidgetAnimation appear; // 0x2C8 (8)
	struct UImage IMG_ScoreBoard_Line03; // 0x2D0 (8)
	struct UImage IMG_ScoreBoard_TopBg02; // 0x2D8 (8)
	struct UImage IMG_ScoreBoard_TopDeco; // 0x2E0 (8)
	struct UResultRankScoreItem_C RankScoreItem01; // 0x2E8 (8)
	struct UResultRankScoreItem_C RankScoreItem02; // 0x2F0 (8)
	struct UResultRankScoreItem_C RankScoreItem03; // 0x2F8 (8)
	struct UResultRankScoreItem_C RankScoreItem04; // 0x300 (8)
	struct UResultRankScoreItem_C RankScoreItem05; // 0x308 (8)
	struct UResultRankScoreItem_C RankScoreItem06; // 0x310 (8)
	struct UResultRankScoreItem_C RankScoreItem07; // 0x318 (8)
	struct UResultRankScoreItem_C RankScoreItem08; // 0x320 (8)
	struct UResultRankScoreItem_C RankScoreItem09; // 0x328 (8)
	struct UResultRankScoreItem_C RankScoreItem10; // 0x330 (8)
};

