// WidgetBlueprintGeneratedClass RingCommand.RingCommand_C
class URingCommand_C : public UPDRingCommandUI {

public:

	struct UImage Image; // 0x4C0 (8)
	struct UImage Image_2; // 0x4C8 (8)
	struct UImage IMG_ArrowL; // 0x4D0 (8)
	struct UImage IMG_ArrowR; // 0x4D8 (8)
	struct UImage IMG_Back1; // 0x4E0 (8)
	struct UImage IMG_Back2_1; // 0x4E8 (8)
	struct UImage IMG_Back2_2; // 0x4F0 (8)
	struct UImage IMG_MouseR; // 0x4F8 (8)
};

