// WidgetBlueprintGeneratedClass RoundInfo.RoundInfo_C
class URoundInfo_C : public UPDRoundInfoUI {

public:

	struct UWidgetAnimation TimeAlret; // 0x3B8 (8)
	struct UWidgetAnimation BombDefuse; // 0x3C0 (8)
	struct UWidgetAnimation BombCount; // 0x3C8 (8)
	struct UWidgetAnimation BombSet; // 0x3D0 (8)
	struct UImage IMG_InfoBackM; // 0x3D8 (8)
	struct UImage IMG_ShopGuide_Bg; // 0x3E0 (8)
	struct UImage IMG_ShopGuide_Outline; // 0x3E8 (8)
	struct UImage IMG_ShopGuide_TitleBar; // 0x3F0 (8)
	struct UImage IMG_ShopGuide_TitleDecoL; // 0x3F8 (8)
	struct UImage IMG_ShopGuide_TitleDecoR; // 0x400 (8)
	struct UCanvasPanel PW_PlayTimeNum; // 0x408 (8)
	struct UPDTextBlock TB_PlayTimeComma; // 0x410 (8)
	struct UPDTextBlock TB_PlayTimeMin; // 0x418 (8)
	struct UPDTextBlock TB_PlayTimeSec; // 0x420 (8)
};

