// WidgetBlueprintGeneratedClass ServerMaintenanceNotiPopup.ServerMaintenanceNotiPopup_C
class UServerMaintenanceNotiPopup_C : public UPDOKPopupUI {

public:

	struct UWidgetAnimation Anim_SceneOut; // 0x2D0 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x2D8 (8)
	struct UImage IMG_Blinder; // 0x2E0 (8)
	struct UImage IMG_Deco_BL; // 0x2E8 (8)
	struct UImage IMG_Deco_BR; // 0x2F0 (8)
	struct UImage IMG_Deco_TL; // 0x2F8 (8)
	struct UImage IMG_Deco_TR; // 0x300 (8)
	struct UImage IMG_Outline; // 0x308 (8)
	struct UImage IMG_PopupBg; // 0x310 (8)
};

