// BlueprintGeneratedClass Shipyard_Barge_01.Shipyard_Barge_01_C
class AShipyard_Barge_01_C : public UActor {

public:

	struct UStaticMeshComponent SM_Shipyard_Barge_015; // 0x220 (8)
	struct UStaticMeshComponent SM_Shipyard_Barge_014; // 0x228 (8)
	struct UStaticMeshComponent SM_Shipyard_Barge_013; // 0x230 (8)
	struct UStaticMeshComponent SM_Shipyard_Barge_012; // 0x238 (8)
	struct UStaticMeshComponent SM_Shipyard_Barge_011; // 0x240 (8)
	struct UStaticMeshComponent SM_Shipyard_Barge_10; // 0x248 (8)
	struct UStaticMeshComponent SM_Shipyard_Barge_9; // 0x250 (8)
	struct UStaticMeshComponent SM_Shipyard_Barge_010; // 0x258 (8)
	struct UStaticMeshComponent SM_Shipyard_Barge_09; // 0x260 (8)
	struct UStaticMeshComponent SM_Shipyard_Barge_08; // 0x268 (8)
	struct UStaticMeshComponent SM_Shipyard_Barge_07; // 0x270 (8)
	struct UStaticMeshComponent SM_Shipyard_Barge_06; // 0x278 (8)
	struct UStaticMeshComponent SM_Shipyard_Barge_05; // 0x280 (8)
	struct UStaticMeshComponent SM_Shipyard_Barge_03; // 0x288 (8)
	struct UStaticMeshComponent SM_Shipyard_Barge_02; // 0x290 (8)
	struct UStaticMeshComponent SM_Shipyard_Barge_01; // 0x298 (8)
	struct USceneComponent DefaultSceneRoot; // 0x2A0 (8)
};

