// WidgetBlueprintGeneratedClass SkyView.SkyView_C
class USkyView_C : public UPDSkyViewUI {

public:

	struct UWidgetAnimation AlertStart; // 0x358 (8)
	struct UWidgetAnimation AlertEnd; // 0x360 (8)
	struct UWidgetAnimation Anim_Cam; // 0x368 (8)
	struct UWidgetAnimation Anim_Rec; // 0x370 (8)
	struct UWidgetAnimation Anim_FocusBar; // 0x378 (8)
	struct UWidgetAnimation Anim_Equalizer; // 0x380 (8)
	struct UPDImage IMG_AlertBack; // 0x388 (8)
	struct UImage IMG_AtkIcon; // 0x390 (8)
	struct UPDImage IMG_Deco; // 0x398 (8)
	struct UImage IMG_DefIcon; // 0x3A0 (8)
	struct UImage IMG_MapBg; // 0x3A8 (8)
	struct UImage IMG_MapShadow; // 0x3B0 (8)
	struct UImage IMG_MissionIcon; // 0x3B8 (8)
	struct UPDImage IMG_Recently01Back; // 0x3C0 (8)
	struct UPDImage IMG_Recently02Back; // 0x3C8 (8)
	struct UPDTextBlock TB_ATkCaption; // 0x3D0 (8)
	struct UPDTextBlock TB_DefCaption; // 0x3D8 (8)
	struct UPDTextBlock TB_MissionScoreSubTitle; // 0x3E0 (8)
	struct UPDTextBlock TB_MissionScoreTitle; // 0x3E8 (8)
};

