// WidgetBlueprintGeneratedClass Spectator.Spectator_C
class USpectator_C : public UPDSpectatorUI {

public:

	struct UWidgetAnimation Ani_PressF3; // 0x320 (8)
	struct UWidgetAnimation Ani_PressF2; // 0x328 (8)
	struct UWidgetAnimation Ani_PressF1; // 0x330 (8)
	struct UImage IMG_CheerIcon01; // 0x338 (8)
	struct UImage IMG_CheerIcon02; // 0x340 (8)
	struct UImage IMG_CheerIcon03; // 0x348 (8)
	struct UImage IMG_GradeNone; // 0x350 (8)
	struct UImage IMG_Mouse_L; // 0x358 (8)
	struct UImage IMG_Mouse_R; // 0x360 (8)
	struct UImage IMG_Next; // 0x368 (8)
	struct UImage IMG_Prev; // 0x370 (8)
	struct USpectatorPlayerAlly_C PlayerAlly_1; // 0x378 (8)
	struct USpectatorPlayerAlly_C PlayerAlly_2; // 0x380 (8)
	struct USpectatorPlayerAlly_C PlayerAlly_3; // 0x388 (8)
	struct USpectatorPlayerAlly_C PlayerAlly_4; // 0x390 (8)
	struct USpectatorPlayerAlly_C PlayerAlly_5; // 0x398 (8)
	struct USpectatorPlayerEnemy_C PlayerEnemy_1; // 0x3A0 (8)
	struct USpectatorPlayerEnemy_C PlayerEnemy_2; // 0x3A8 (8)
	struct USpectatorPlayerEnemy_C PlayerEnemy_3; // 0x3B0 (8)
	struct USpectatorPlayerEnemy_C PlayerEnemy_4; // 0x3B8 (8)
	struct USpectatorPlayerEnemy_C PlayerEnemy_5; // 0x3C0 (8)
	struct USpectator_Cheer_C SC1; // 0x3C8 (8)
	struct USpectator_Cheer_C SC1_2; // 0x3D0 (8)
	struct USpectator_Cheer_C SC1_3; // 0x3D8 (8)
	struct USpectator_Cheer_C SC1_4; // 0x3E0 (8)
	struct USpectator_Cheer_C SC1_5; // 0x3E8 (8)
};

