// WidgetBlueprintGeneratedClass StatusBoardMap.StatusBoardMap_C
class UStatusBoardMap_C : public UPDStatusBoardGameMap {

public:

	struct UImage IMG_Coordinate_H01; // 0x450 (8)
	struct UImage IMG_Coordinate_H02; // 0x458 (8)
	struct UImage IMG_Coordinate_H03; // 0x460 (8)
	struct UImage IMG_Coordinate_H04; // 0x468 (8)
	struct UImage IMG_Coordinate_H05; // 0x470 (8)
	struct UImage IMG_Coordinate_H06; // 0x478 (8)
	struct UImage IMG_Coordinate_H07; // 0x480 (8)
	struct UImage IMG_Coordinate_H08; // 0x488 (8)
	struct UImage IMG_Coordinate_H09; // 0x490 (8)
	struct UImage IMG_Coordinate_V01; // 0x498 (8)
	struct UImage IMG_Coordinate_V02; // 0x4A0 (8)
	struct UImage IMG_Coordinate_V03; // 0x4A8 (8)
	struct UImage IMG_Coordinate_V04; // 0x4B0 (8)
	struct UImage IMG_Coordinate_V05; // 0x4B8 (8)
	struct UImage IMG_Coordinate_V06; // 0x4C0 (8)
	struct UImage IMG_Coordinate_V07; // 0x4C8 (8)
	struct UImage IMG_Coordinate_V08; // 0x4D0 (8)
	struct UImage IMG_Coordinate_V09; // 0x4D8 (8)
};

