// WidgetBlueprintGeneratedClass TutorialPopup.TutorialPopup_C
class UTutorialPopup_C : public UPDTutorialPopupUI {

public:

	struct UWidgetAnimation Anim_SceneOut; // 0x350 (8)
	struct UWidgetAnimation Anim_SceneShowUp; // 0x358 (8)
	struct UImage Img_Bg; // 0x360 (8)
	struct UImage IMG_Blinder; // 0x368 (8)
	struct UImage IMG_Comp_Reward_01; // 0x370 (8)
	struct UImage IMG_Comp_Reward_02; // 0x378 (8)
	struct UImage IMG_CompDeco_Reward_01; // 0x380 (8)
	struct UImage IMG_CompDeco_Reward_02; // 0x388 (8)
	struct UImage IMG_Deco_BL; // 0x390 (8)
	struct UImage IMG_Deco_BR; // 0x398 (8)
	struct UImage IMG_Deco_line_01; // 0x3A0 (8)
	struct UImage IMG_Deco_line_02; // 0x3A8 (8)
	struct UImage IMG_Deco_line_03; // 0x3B0 (8)
	struct UImage IMG_Deco_TL; // 0x3B8 (8)
	struct UImage IMG_Deco_TR; // 0x3C0 (8)
	struct UImage IMG_Desc_Reward_01; // 0x3C8 (8)
	struct UImage IMG_Desc_Reward_02; // 0x3D0 (8)
};

