// Enum UMG.ESlateAccessibleBehavior
enum class ESlateAccessibleBehavior : uint8_t {
	NotAccessible = 0,
	Auto = 1,
	Summary = 2,
	Custom = 3,
	ToolTip = 4,
	ESlateAccessibleBehavior_MAX = 5,
};

// Enum UMG.ESlateVisibility
enum class ESlateVisibility : uint8_t {
	Visible = 0,
	Collapsed = 1,
	Hidden = 2,
	HitTestInvisible = 3,
	SelfHitTestInvisible = 4,
	ESlateVisibility_MAX = 5,
};

// Enum UMG.EVirtualKeyboardType
enum class EVirtualKeyboardType : uint8_t {
	Default = 0,
	Number = 1,
	Web = 2,
	Email = 3,
	Password = 4,
	AlphaNumeric = 5,
	EVirtualKeyboardType_MAX = 6,
};

// Enum UMG.EDragPivot
enum class EDragPivot : uint8_t {
	MouseDown = 0,
	TopLeft = 1,
	TopCenter = 2,
	TopRight = 3,
	CenterLeft = 4,
	CenterCenter = 5,
	CenterRight = 6,
	BottomLeft = 7,
	BottomCenter = 8,
	BottomRight = 9,
	EDragPivot_MAX = 10,
};

// Enum UMG.EDynamicBoxType
enum class EDynamicBoxType : uint8_t {
	Horizontal = 0,
	Vertical = 1,
	Wrap = 2,
	Overlay = 3,
	EDynamicBoxType_MAX = 4,
};

// Enum UMG.ESlateSizeRule
enum class ESlateSizeRule : uint8_t {
	Automatic = 0,
	Fill = 1,
	ESlateSizeRule_MAX = 2,
};

// Enum UMG.EUMGSequencePlayMode
enum class EUMGSequencePlayMode : uint8_t {
	Forward = 0,
	Reverse = 1,
	PingPong = 2,
	EUMGSequencePlayMode_MAX = 3,
};

// Enum UMG.EWidgetAnimationEvent
enum class EWidgetAnimationEvent : uint8_t {
	Started = 0,
	Finished = 1,
	EWidgetAnimationEvent_MAX = 2,
};

// Enum UMG.EWidgetTickFrequency
enum class EWidgetTickFrequency : uint8_t {
	Never = 0,
	Auto = 1,
	EWidgetTickFrequency_MAX = 2,
};

// Enum UMG.EWidgetDesignFlags
enum class EWidgetDesignFlags : uint8_t {
	None = 0,
	Designing = 1,
	ShowOutline = 2,
	ExecutePreConstruct = 4,
	EWidgetDesignFlags_MAX = 5,
};

// Enum UMG.EBindingKind
enum class EBindingKind : uint8_t {
	Function = 0,
	Property = 1,
	EBindingKind_MAX = 2,
};

// Enum UMG.EWindowVisibility
enum class EWindowVisibility : uint8_t {
	Visible = 0,
	SelfHitTestInvisible = 1,
	EWindowVisibility_MAX = 2,
};

// Enum UMG.EWidgetGeometryMode
enum class EWidgetGeometryMode : uint8_t {
	Plane = 0,
	Cylinder = 1,
	EWidgetGeometryMode_MAX = 2,
};

// Enum UMG.EWidgetBlendMode
enum class EWidgetBlendMode : uint8_t {
	Opaque = 0,
	Masked = 1,
	Transparent = 2,
	EWidgetBlendMode_MAX = 3,
};

// Enum UMG.EWidgetTimingPolicy
enum class EWidgetTimingPolicy : uint8_t {
	RealTime = 0,
	GameTime = 1,
	EWidgetTimingPolicy_MAX = 2,
};

// Enum UMG.EWidgetSpace
enum class EWidgetSpace : uint8_t {
	World = 0,
	Screen = 1,
	EWidgetSpace_MAX = 2,
};

// Enum UMG.EWidgetInteractionSource
enum class EWidgetInteractionSource : uint8_t {
	World = 0,
	Mouse = 1,
	CenterScreen = 2,
	Custom = 3,
	EWidgetInteractionSource_MAX = 4,
};

// Class UMG.Widget
class UWidget : public UVisual {

public:

	struct UPanelSlot Slot; // 0x28 (8)
	struct FDelegate bIsEnabledDelegate; // 0x30 (16)
	struct FText ToolTipText; // 0x40 (24)
	struct FDelegate ToolTipTextDelegate; // 0x58 (16)
	struct UWidget ToolTipWidget; // 0x68 (8)
	struct FDelegate ToolTipWidgetDelegate; // 0x70 (16)
	struct FDelegate VisibilityDelegate; // 0x80 (16)
	struct FWidgetTransform RenderTransform; // 0x90 (28)
	struct FVector2D RenderTransformPivot; // 0xAC (8)
	char bIsVariable : 1; // 0xB4 (1)
	char bCreatedByConstructionScript : 1; // 0xB4 (1)
	char bIsEnabled : 1; // 0xB4 (1)
	char bOverride_Cursor : 1; // 0xB4 (1)
	char pad_B4_4 : 4; // 0xB4 (1)
	struct USlateAccessibleWidgetData AccessibleWidgetData; // 0xB8 (8)
	char bIsVolatile : 1; // 0xC0 (1)
	char pad_BD_1 : 7; // 0xBD (1)
	enum class EMouseCursor Cursor; // 0xC1 (1)
	enum class EWidgetClipping Clipping; // 0xC2 (1)
	enum class ESlateVisibility Visibility; // 0xC3 (1)
	float RenderOpacity; // 0xC4 (4)
	struct UWidgetNavigation Navigation; // 0xC8 (8)
	enum class EFlowDirectionPreference FlowDirectionPreference; // 0xD0 (1)
	struct TArray<struct UPropertyBinding> NativeBindings; // 0xF8 (16)

	void SetVisibility(enum class ESlateVisibility InVisibility); // Function UMG.Widget.SetVisibility(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A14290>
	void SetUserFocus(struct APlayerController PlayerController); // Function UMG.Widget.SetUserFocus(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A14070>
	void SetToolTipText(struct FText& InToolTipText); // Function UMG.Widget.SetToolTipText(Final|Native|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13FA0>
	void SetToolTip(struct UWidget Widget); // Function UMG.Widget.SetToolTip(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13F20>
	void SetRenderTranslation(struct FVector2D Translation); // Function UMG.Widget.SetRenderTranslation(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13E10>
	void SetRenderTransformPivot(struct FVector2D Pivot); // Function UMG.Widget.SetRenderTransformPivot(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13D90>
	void SetRenderTransformAngle(float Angle); // Function UMG.Widget.SetRenderTransformAngle(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13D10>
	void SetRenderTransform(struct FWidgetTransform InTransform); // Function UMG.Widget.SetRenderTransform(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13C30>
	void SetRenderShear(struct FVector2D Shear); // Function UMG.Widget.SetRenderShear(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13BB0>
	void SetRenderScale(struct FVector2D Scale); // Function UMG.Widget.SetRenderScale(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13B30>
	void SetRenderOpacity(float InOpacity); // Function UMG.Widget.SetRenderOpacity(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13AB0>
	void SetNavigationRuleExplicit(enum class EUINavigation Direction, struct UWidget InWidget); // Function UMG.Widget.SetNavigationRuleExplicit(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13960>
	void SetNavigationRuleCustomBoundary(enum class EUINavigation Direction, struct FDelegate InCustomDelegate); // Function UMG.Widget.SetNavigationRuleCustomBoundary(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13880>
	void SetNavigationRuleCustom(enum class EUINavigation Direction, struct FDelegate InCustomDelegate); // Function UMG.Widget.SetNavigationRuleCustom(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A137A0>
	void SetNavigationRuleBase(enum class EUINavigation Direction, enum class EUINavigationRule Rule); // Function UMG.Widget.SetNavigationRuleBase(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A136E0>
	void SetNavigationRule(enum class EUINavigation Direction, enum class EUINavigationRule Rule, struct FName WidgetToFocus); // Function UMG.Widget.SetNavigationRule(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A135D0>
	void SetKeyboardFocus(); // Function UMG.Widget.SetKeyboardFocus(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A135B0>
	void SetIsEnabled(bool bInIsEnabled); // Function UMG.Widget.SetIsEnabled(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13520>
	void SetFocus(); // Function UMG.Widget.SetFocus(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13480>
	void SetCursor(enum class EMouseCursor InCursor); // Function UMG.Widget.SetCursor(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13400>
	void SetClipping(enum class EWidgetClipping InClipping); // Function UMG.Widget.SetClipping(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13380>
	void SetAllNavigationRules(enum class EUINavigationRule Rule, struct FName WidgetToFocus); // Function UMG.Widget.SetAllNavigationRules(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A132C0>
	void ResetCursor(); // Function UMG.Widget.ResetCursor(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A132A0>
	void RemoveFromParent(); // Function UMG.Widget.RemoveFromParent(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13280>
	struct FEventReply OnReply__DelegateSignature(); // DelegateFunction UMG.Widget.OnReply__DelegateSignature(Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnPointerEvent__DelegateSignature(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // DelegateFunction UMG.Widget.OnPointerEvent__DelegateSignature(Public|Delegate|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	bool IsVisible(); // Function UMG.Widget.IsVisible(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A13250>
	bool IsHovered(); // Function UMG.Widget.IsHovered(Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x25D73C0>
	void InvalidateLayoutAndVolatility(); // Function UMG.Widget.InvalidateLayoutAndVolatility(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13230>
	bool HasUserFocusedDescendants(struct APlayerController PlayerController); // Function UMG.Widget.HasUserFocusedDescendants(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A131A0>
	bool HasUserFocus(struct APlayerController PlayerController); // Function UMG.Widget.HasUserFocus(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A13110>
	bool HasMouseCaptureByUser(int32_t UserIndex, int32_t PointerIndex); // Function UMG.Widget.HasMouseCaptureByUser(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A13050>
	bool HasMouseCapture(); // Function UMG.Widget.HasMouseCapture(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A13020>
	bool HasKeyboardFocus(); // Function UMG.Widget.HasKeyboardFocus(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12FF0>
	bool HasFocusedDescendants(); // Function UMG.Widget.HasFocusedDescendants(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12FC0>
	bool HasAnyUserFocus(); // Function UMG.Widget.HasAnyUserFocus(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12F90>
	struct UWidget GetWidget__DelegateSignature(); // DelegateFunction UMG.Widget.GetWidget__DelegateSignature(Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	enum class ESlateVisibility GetVisibility(); // Function UMG.Widget.GetVisibility(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12F60>
	struct FGeometry GetTickSpaceGeometry(); // Function UMG.Widget.GetTickSpaceGeometry(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12E40>
	struct FText GetText__DelegateSignature(); // DelegateFunction UMG.Widget.GetText__DelegateSignature(Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	enum class ESlateVisibility GetSlateVisibility__DelegateSignature(); // DelegateFunction UMG.Widget.GetSlateVisibility__DelegateSignature(Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FSlateColor GetSlateColor__DelegateSignature(); // DelegateFunction UMG.Widget.GetSlateColor__DelegateSignature(Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FSlateBrush GetSlateBrush__DelegateSignature(); // DelegateFunction UMG.Widget.GetSlateBrush__DelegateSignature(Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	float GetRenderTransformAngle(); // Function UMG.Widget.GetRenderTransformAngle(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12DE0>
	float GetRenderOpacity(); // Function UMG.Widget.GetRenderOpacity(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12DB0>
	struct UPanelWidget GetParent(); // Function UMG.Widget.GetParent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12D80>
	struct FGeometry GetPaintSpaceGeometry(); // Function UMG.Widget.GetPaintSpaceGeometry(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12D40>
	struct APlayerController GetOwningPlayer(); // Function UMG.Widget.GetOwningPlayer(BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12D10>
	struct ULocalPlayer GetOwningLocalPlayer(); // Function UMG.Widget.GetOwningLocalPlayer(BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12CE0>
	enum class EMouseCursor GetMouseCursor__DelegateSignature(); // DelegateFunction UMG.Widget.GetMouseCursor__DelegateSignature(Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FLinearColor GetLinearColor__DelegateSignature(); // DelegateFunction UMG.Widget.GetLinearColor__DelegateSignature(Public|Delegate|HasDefaults) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	bool GetIsEnabled(); // Function UMG.Widget.GetIsEnabled(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12CB0>
	int32_t GetInt32__DelegateSignature(); // DelegateFunction UMG.Widget.GetInt32__DelegateSignature(Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct UGameInstance GetGameInstance(); // Function UMG.Widget.GetGameInstance(Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12C80>
	float GetFloat__DelegateSignature(); // DelegateFunction UMG.Widget.GetFloat__DelegateSignature(Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FVector2D GetDesiredSize(); // Function UMG.Widget.GetDesiredSize(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12C10>
	enum class EWidgetClipping GetClipping(); // Function UMG.Widget.GetClipping(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12BE0>
	enum class ECheckBoxState GetCheckBoxState__DelegateSignature(); // DelegateFunction UMG.Widget.GetCheckBoxState__DelegateSignature(Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FGeometry GetCachedGeometry(); // Function UMG.Widget.GetCachedGeometry(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12BA0>
	bool GetBool__DelegateSignature(); // DelegateFunction UMG.Widget.GetBool__DelegateSignature(Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct UWidget GenerateWidgetForString__DelegateSignature(struct FString Item); // DelegateFunction UMG.Widget.GenerateWidgetForString__DelegateSignature(Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct UWidget GenerateWidgetForObject__DelegateSignature(struct Object Item); // DelegateFunction UMG.Widget.GenerateWidgetForObject__DelegateSignature(Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void ForceVolatile(bool bForce); // Function UMG.Widget.ForceVolatile(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A12B10>
	void ForceLayoutPrepass(); // Function UMG.Widget.ForceLayoutPrepass(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A12AF0>
};

// Class UMG.PanelWidget
class UPanelWidget : public UWidget {

public:

	struct TArray<struct UPanelSlot> Slots; // 0x108 (16)

	bool RemoveChildAt(int32_t Index); // Function UMG.PanelWidget.RemoveChildAt(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01110>
	bool RemoveChild(struct UWidget Content); // Function UMG.PanelWidget.RemoveChild(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01080>
	bool HasChild(struct UWidget Content); // Function UMG.PanelWidget.HasChild(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A00FF0>
	bool HasAnyChildren(); // Function UMG.PanelWidget.HasAnyChildren(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A00FC0>
	int32_t GetChildrenCount(); // Function UMG.PanelWidget.GetChildrenCount(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A00B80>
	int32_t GetChildIndex(struct UWidget Content); // Function UMG.PanelWidget.GetChildIndex(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A00AF0>
	struct UWidget GetChildAt(int32_t Index); // Function UMG.PanelWidget.GetChildAt(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A00A60>
	struct TArray<struct UWidget> GetAllChildren(); // Function UMG.PanelWidget.GetAllChildren(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A009E0>
	void ClearChildren(); // Function UMG.PanelWidget.ClearChildren(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A009C0>
	struct UPanelSlot AddChild(struct UWidget Content); // Function UMG.PanelWidget.AddChild(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A00880>
};

// Class UMG.UserWidget
class UUserWidget : public UWidget {

public:

	struct FLinearColor ColorAndOpacity; // 0x110 (16)
	struct FDelegate ColorAndOpacityDelegate; // 0x120 (16)
	struct FSlateColor ForegroundColor; // 0x130 (40)
	struct FDelegate ForegroundColorDelegate; // 0x158 (16)
	struct FMargin Padding; // 0x168 (16)
	struct TArray<struct UUMGSequencePlayer> ActiveSequencePlayers; // 0x178 (16)
	struct TArray<struct UUMGSequencePlayer> StoppedSequencePlayers; // 0x188 (16)
	struct TArray<struct FNamedSlotBinding> NamedSlotBindings; // 0x198 (16)
	struct UWidgetTree WidgetTree; // 0x1A8 (8)
	int32_t Priority; // 0x1B0 (4)
	char bSupportsKeyboardFocus : 1; // 0x1B4 (1)
	char pad_1AC_1 : 7; // 0x1AC (1)
	char pad_1AD_0 : 1; // 0x1AD (1)
	char bIsFocusable : 1; // 0x1B4 (1)
	char pad_1AD_2 : 6; // 0x1AD (1)
	char pad_1AE_0 : 2; // 0x1AE (1)
	char bStopAction : 1; // 0x1B4 (1)
	char pad_1AE_3 : 5; // 0x1AE (1)
	char pad_1AF_0 : 3; // 0x1AF (1)
	char bHasScriptImplementedTick : 1; // 0x1B4 (1)
	char pad_1AF_4 : 4; // 0x1AF (1)
	char pad_1B0_0 : 4; // 0x1B0 (1)
	char bHasScriptImplementedPaint : 1; // 0x1B4 (1)
	char pad_1B0_5 : 3; // 0x1B0 (1)
	char pad_1B1_0 : 7; // 0x1B1 (1)
	char bCookedWidgetTree : 1; // 0x1B4 (1)
	enum class EWidgetTickFrequency TickFrequency; // 0x1C0 (1)
	struct UInputComponent InputComponent; // 0x1C8 (8)
	struct TArray<struct FAnimationEventBinding> AnimationCallbacks; // 0x1D0 (16)

	void UnregisterInputComponent(); // Function UMG.UserWidget.UnregisterInputComponent(Final|Native|Protected|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A10C20>
	void UnbindFromAnimationStarted(struct UWidgetAnimation Animation, struct FDelegate Delegate); // Function UMG.UserWidget.UnbindFromAnimationStarted(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A10B40>
	void UnbindFromAnimationFinished(struct UWidgetAnimation Animation, struct FDelegate Delegate); // Function UMG.UserWidget.UnbindFromAnimationFinished(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A10A60>
	void UnbindAllFromAnimationStarted(struct UWidgetAnimation Animation); // Function UMG.UserWidget.UnbindAllFromAnimationStarted(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A109E0>
	void UnbindAllFromAnimationFinished(struct UWidgetAnimation Animation); // Function UMG.UserWidget.UnbindAllFromAnimationFinished(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A10960>
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function UMG.UserWidget.Tick(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void StopListeningForInputAction(struct FName ActionName, enum class EInputEvent EventType); // Function UMG.UserWidget.StopListeningForInputAction(Final|Native|Protected|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A108A0>
	void StopListeningForAllInputActions(); // Function UMG.UserWidget.StopListeningForAllInputActions(Final|Native|Protected|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A10880>
	void StopAnimationsAndLatentActions(); // Function UMG.UserWidget.StopAnimationsAndLatentActions(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A10860>
	void StopAnimation(struct UWidgetAnimation InAnimation); // Function UMG.UserWidget.StopAnimation(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A107E0>
	void StopAllAnimations(); // Function UMG.UserWidget.StopAllAnimations(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A107C0>
	void SetPositionInViewport(struct FVector2D Position, bool bRemoveDPIScale); // Function UMG.UserWidget.SetPositionInViewport(Final|BlueprintCosmetic|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A104F0>
	void SetPlaybackSpeed(struct UWidgetAnimation InAnimation, float PlaybackSpeed); // Function UMG.UserWidget.SetPlaybackSpeed(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A10420>
	void SetPadding(struct FMargin InPadding); // Function UMG.UserWidget.SetPadding(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A10390>
	void SetOwningPlayer(struct APlayerController LocalPlayerController); // Function UMG.UserWidget.SetOwningPlayer(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A10310>
	void SetNumLoopsToPlay(struct UWidgetAnimation InAnimation, int32_t NumLoopsToPlay); // Function UMG.UserWidget.SetNumLoopsToPlay(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A10250>
	void SetInputActionPriority(int32_t NewPriority); // Function UMG.UserWidget.SetInputActionPriority(Final|Native|Protected|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A100D0>
	void SetInputActionBlocking(bool bShouldBlock); // Function UMG.UserWidget.SetInputActionBlocking(Final|Native|Protected|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A10040>
	void SetForegroundColor(struct FSlateColor InForegroundColor); // Function UMG.UserWidget.SetForegroundColor(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0FED0>
	void SetDesiredSizeInViewport(struct FVector2D Size); // Function UMG.UserWidget.SetDesiredSizeInViewport(Final|BlueprintCosmetic|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0FE50>
	void SetColorAndOpacity(struct FLinearColor InColorAndOpacity); // Function UMG.UserWidget.SetColorAndOpacity(Final|BlueprintCosmetic|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0FD50>
	void SetAnchorsInViewport(struct FAnchors Anchors); // Function UMG.UserWidget.SetAnchorsInViewport(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0FCC0>
	void SetAlignmentInViewport(struct FVector2D Alignment); // Function UMG.UserWidget.SetAlignmentInViewport(Final|BlueprintCosmetic|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0FC40>
	void ReverseAnimation(struct UWidgetAnimation InAnimation); // Function UMG.UserWidget.ReverseAnimation(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0FBC0>
	void RemoveFromViewport(); // Function UMG.UserWidget.RemoveFromViewport(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0FBA0>
	void RegisterInputComponent(); // Function UMG.UserWidget.RegisterInputComponent(Final|Native|Protected|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0FB80>
	void PreConstruct(bool IsDesignTime); // Function UMG.UserWidget.PreConstruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void PlaySound(struct USoundBase SoundToPlay); // Function UMG.UserWidget.PlaySound(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0FB00>
	struct UUMGSequencePlayer PlayAnimationTimeRange(struct UWidgetAnimation InAnimation, float StartAtTime, float EndAtTime, int32_t NumLoopsToPlay, enum class EUMGSequencePlayMode PlayMode, float PlaybackSpeed, bool bRestoreState); // Function UMG.UserWidget.PlayAnimationTimeRange(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0F910>
	struct UUMGSequencePlayer PlayAnimationReverse(struct UWidgetAnimation InAnimation, float PlaybackSpeed, bool bRestoreState); // Function UMG.UserWidget.PlayAnimationReverse(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0F800>
	struct UUMGSequencePlayer PlayAnimationForward(struct UWidgetAnimation InAnimation, float PlaybackSpeed, bool bRestoreState); // Function UMG.UserWidget.PlayAnimationForward(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0F6F0>
	struct UUMGSequencePlayer PlayAnimation(struct UWidgetAnimation InAnimation, float StartAtTime, int32_t NumLoopsToPlay, enum class EUMGSequencePlayMode PlayMode, float PlaybackSpeed, bool bRestoreState); // Function UMG.UserWidget.PlayAnimation(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0F530>
	float PauseAnimation(struct UWidgetAnimation InAnimation); // Function UMG.UserWidget.PauseAnimation(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0F490>
	struct FEventReply OnTouchStarted(struct FGeometry MyGeometry, struct FPointerEvent& InTouchEvent); // Function UMG.UserWidget.OnTouchStarted(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnTouchMoved(struct FGeometry MyGeometry, struct FPointerEvent& InTouchEvent); // Function UMG.UserWidget.OnTouchMoved(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnTouchGesture(struct FGeometry MyGeometry, struct FPointerEvent& GestureEvent); // Function UMG.UserWidget.OnTouchGesture(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnTouchForceChanged(struct FGeometry MyGeometry, struct FPointerEvent& InTouchEvent); // Function UMG.UserWidget.OnTouchForceChanged(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnTouchEnded(struct FGeometry MyGeometry, struct FPointerEvent& InTouchEvent); // Function UMG.UserWidget.OnTouchEnded(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnRemovedFromFocusPath(struct FFocusEvent InFocusEvent); // Function UMG.UserWidget.OnRemovedFromFocusPath(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnPreviewMouseButtonDown(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function UMG.UserWidget.OnPreviewMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnPreviewKeyDown(struct FGeometry MyGeometry, struct FKeyEvent InKeyEvent); // Function UMG.UserWidget.OnPreviewKeyDown(Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnPaint(struct FPaintContext& Context); // Function UMG.UserWidget.OnPaint(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent|Const) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnMouseWheel(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function UMG.UserWidget.OnMouseWheel(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnMouseMove(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function UMG.UserWidget.OnMouseMove(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnMouseLeave(struct FPointerEvent& MouseEvent); // Function UMG.UserWidget.OnMouseLeave(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnMouseEnter(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function UMG.UserWidget.OnMouseEnter(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnMouseCaptureLost(); // Function UMG.UserWidget.OnMouseCaptureLost(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnMouseButtonUp(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function UMG.UserWidget.OnMouseButtonUp(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnMouseButtonDown(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function UMG.UserWidget.OnMouseButtonDown(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnMouseButtonDoubleClick(struct FGeometry InMyGeometry, struct FPointerEvent& InMouseEvent); // Function UMG.UserWidget.OnMouseButtonDoubleClick(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnMotionDetected(struct FGeometry MyGeometry, struct FMotionEvent InMotionEvent); // Function UMG.UserWidget.OnMotionDetected(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnKeyUp(struct FGeometry MyGeometry, struct FKeyEvent InKeyEvent); // Function UMG.UserWidget.OnKeyUp(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnKeyDown(struct FGeometry MyGeometry, struct FKeyEvent InKeyEvent); // Function UMG.UserWidget.OnKeyDown(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnKeyChar(struct FGeometry MyGeometry, struct FCharacterEvent InCharacterEvent); // Function UMG.UserWidget.OnKeyChar(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnInitialized(); // Function UMG.UserWidget.OnInitialized(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FEventReply OnFocusReceived(struct FGeometry MyGeometry, struct FFocusEvent InFocusEvent); // Function UMG.UserWidget.OnFocusReceived(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnFocusLost(struct FFocusEvent InFocusEvent); // Function UMG.UserWidget.OnFocusLost(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	bool OnDrop(struct FGeometry MyGeometry, struct FPointerEvent PointerEvent, struct UDragDropOperation Operation); // Function UMG.UserWidget.OnDrop(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	bool OnDragOver(struct FGeometry MyGeometry, struct FPointerEvent PointerEvent, struct UDragDropOperation Operation); // Function UMG.UserWidget.OnDragOver(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnDragLeave(struct FPointerEvent PointerEvent, struct UDragDropOperation Operation); // Function UMG.UserWidget.OnDragLeave(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnDragEnter(struct FGeometry MyGeometry, struct FPointerEvent PointerEvent, struct UDragDropOperation Operation); // Function UMG.UserWidget.OnDragEnter(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnDragDetected(struct FGeometry MyGeometry, struct FPointerEvent& PointerEvent, struct UDragDropOperation& Operation); // Function UMG.UserWidget.OnDragDetected(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnDragCancelled(struct FPointerEvent& PointerEvent, struct UDragDropOperation Operation); // Function UMG.UserWidget.OnDragCancelled(BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnAnimationStarted(struct UWidgetAnimation Animation); // Function UMG.UserWidget.OnAnimationStarted(BlueprintCosmetic|Native|Event|Protected|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x2A0F400>
	void OnAnimationFinished(struct UWidgetAnimation Animation); // Function UMG.UserWidget.OnAnimationFinished(BlueprintCosmetic|Native|Event|Protected|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x2A0F370>
	struct FEventReply OnAnalogValueChanged(struct FGeometry MyGeometry, struct FAnalogInputEvent InAnalogInputEvent); // Function UMG.UserWidget.OnAnalogValueChanged(Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnAddedToFocusPath(struct FFocusEvent InFocusEvent); // Function UMG.UserWidget.OnAddedToFocusPath(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void ListenForInputAction(struct FName ActionName, enum class EInputEvent EventType, bool bConsume, struct FDelegate Callback); // Function UMG.UserWidget.ListenForInputAction(Final|Native|Protected|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0F1F0>
	bool IsPlayingAnimation(); // Function UMG.UserWidget.IsPlayingAnimation(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A0F1C0>
	bool IsListeningForInputAction(struct FName ActionName); // Function UMG.UserWidget.IsListeningForInputAction(Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A0F130>
	bool IsInViewport(); // Function UMG.UserWidget.IsInViewport(Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A0EF60>
	bool IsInteractable(); // Function UMG.UserWidget.IsInteractable(BlueprintCosmetic|Event|Public|BlueprintEvent|Const) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	bool IsAnyAnimationPlaying(); // Function UMG.UserWidget.IsAnyAnimationPlaying(Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A0F100>
	bool IsAnimationPlayingForward(struct UWidgetAnimation InAnimation); // Function UMG.UserWidget.IsAnimationPlayingForward(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0F070>
	bool IsAnimationPlaying(struct UWidgetAnimation InAnimation); // Function UMG.UserWidget.IsAnimationPlaying(Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A0EFE0>
	struct APawn GetOwningPlayerPawn(); // Function UMG.UserWidget.GetOwningPlayerPawn(Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A0EF90>
	bool GetIsVisible(); // Function UMG.UserWidget.GetIsVisible(Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A0EF60>
	float GetAnimationCurrentTime(struct UWidgetAnimation InAnimation); // Function UMG.UserWidget.GetAnimationCurrentTime(Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A0EEC0>
	struct FAnchors GetAnchorsInViewport(); // Function UMG.UserWidget.GetAnchorsInViewport(Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A0EE80>
	struct FVector2D GetAlignmentInViewport(); // Function UMG.UserWidget.GetAlignmentInViewport(Final|BlueprintCosmetic|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A0EE40>
	void Destruct(); // Function UMG.UserWidget.Destruct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void Construct(); // Function UMG.UserWidget.Construct(BlueprintCosmetic|Event|Public|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void CancelLatentActions(); // Function UMG.UserWidget.CancelLatentActions(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0EE20>
	void BindToAnimationStarted(struct UWidgetAnimation Animation, struct FDelegate Delegate); // Function UMG.UserWidget.BindToAnimationStarted(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0ED40>
	void BindToAnimationFinished(struct UWidgetAnimation Animation, struct FDelegate Delegate); // Function UMG.UserWidget.BindToAnimationFinished(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0EC60>
	void BindToAnimationEvent(struct UWidgetAnimation Animation, struct FDelegate Delegate, enum class EWidgetAnimationEvent AnimationEvent, struct FName UserTag); // Function UMG.UserWidget.BindToAnimationEvent(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0EAF0>
	void AddToViewport(int32_t ZOrder); // Function UMG.UserWidget.AddToViewport(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0EA70>
	bool AddToPlayerScreen(int32_t ZOrder); // Function UMG.UserWidget.AddToPlayerScreen(Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0E9E0>
};

// Class UMG.Button
class UButton : public UContentWidget {

public:

	struct USlateWidgetStyleAsset Style; // 0x120 (8)
	struct FButtonStyle WidgetStyle; // 0x128 (632)
	struct FLinearColor ColorAndOpacity; // 0x3A0 (16)
	struct FLinearColor BackgroundColor; // 0x3B0 (16)
	enum class EButtonClickMethod ClickMethod; // 0x3C0 (1)
	enum class EButtonTouchMethod TouchMethod; // 0x3C1 (1)
	enum class EButtonPressMethod PressMethod; // 0x3C2 (1)
	bool IsFocusable; // 0x3C3 (1)
	struct FMulticastInlineDelegate OnClicked; // 0x3C8 (16)
	struct FMulticastInlineDelegate OnPressed; // 0x3D8 (16)
	struct FMulticastInlineDelegate OnReleased; // 0x3E8 (16)
	struct FMulticastInlineDelegate OnHovered; // 0x3F8 (16)
	struct FMulticastInlineDelegate OnUnHovered; // 0x408 (16)

	void SetTouchMethod(enum class EButtonTouchMethod InTouchMethod); // Function UMG.Button.SetTouchMethod(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F4820>
	void SetStyle(struct FButtonStyle& InStyle); // Function UMG.Button.SetStyle(Final|Native|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F4740>
	void SetPressMethod(enum class EButtonPressMethod InPressMethod); // Function UMG.Button.SetPressMethod(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F45C0>
	void SetColorAndOpacity(struct FLinearColor InColorAndOpacity); // Function UMG.Button.SetColorAndOpacity(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3930>
	void SetClickMethod(enum class EButtonClickMethod InClickMethod); // Function UMG.Button.SetClickMethod(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F38B0>
	void SetBackgroundColor(struct FLinearColor InBackgroundColor); // Function UMG.Button.SetBackgroundColor(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F33B0>
	bool IsPressed(); // Function UMG.Button.IsPressed(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F3120>
};

// Class UMG.Slider
class USlider : public UWidget {

public:

	float Value; // 0x108 (4)
	struct FDelegate ValueDelegate; // 0x10C (16)
	float MinValue; // 0x11C (4)
	float MaxValue; // 0x120 (4)
	struct FSliderStyle WidgetStyle; // 0x128 (832)
	enum class EOrientation Orientation; // 0x468 (1)
	struct FLinearColor SliderBarColor; // 0x46C (16)
	struct FLinearColor SliderHandleColor; // 0x47C (16)
	bool IndentHandle; // 0x48C (1)
	bool Locked; // 0x48D (1)
	bool MouseUsesStep; // 0x48E (1)
	bool RequiresControllerLock; // 0x48F (1)
	float StepSize; // 0x490 (4)
	bool IsFocusable; // 0x494 (1)
	struct FMulticastInlineDelegate OnMouseCaptureBegin; // 0x498 (16)
	struct FMulticastInlineDelegate OnMouseCaptureEnd; // 0x4A8 (16)
	struct FMulticastInlineDelegate OnControllerCaptureBegin; // 0x4B8 (16)
	struct FMulticastInlineDelegate OnControllerCaptureEnd; // 0x4C8 (16)
	struct FMulticastInlineDelegate OnValueChanged; // 0x4D8 (16)

	void SetValue(float InValue); // Function UMG.Slider.SetValue(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A920>
	void SetStepSize(float InValue); // Function UMG.Slider.SetStepSize(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A640>
	void SetSliderHandleColor(struct FLinearColor InValue); // Function UMG.Slider.SetSliderHandleColor(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A5C0>
	void SetSliderBarColor(struct FLinearColor InValue); // Function UMG.Slider.SetSliderBarColor(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A540>
	void SetMinValue(float InValue); // Function UMG.Slider.SetMinValue(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A1C0>
	void SetMaxValue(float InValue); // Function UMG.Slider.SetMaxValue(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09F40>
	void SetLocked(bool InValue); // Function UMG.Slider.SetLocked(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09DB0>
	void SetIndentHandle(bool InValue); // Function UMG.Slider.SetIndentHandle(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09BD0>
	float GetValue(); // Function UMG.Slider.GetValue(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A09410>
	float GetNormalizedValue(); // Function UMG.Slider.GetNormalizedValue(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A09220>
};

// Class UMG.Image
class UImage : public UWidget {

public:

	struct FSlateBrush Brush; // 0x108 (136)
	struct FDelegate BrushDelegate; // 0x190 (16)
	struct FLinearColor ColorAndOpacity; // 0x1A0 (16)
	struct FDelegate ColorAndOpacityDelegate; // 0x1B0 (16)
	bool bFlipForRightToLeftFlowDirection; // 0x1C0 (1)
	struct FDelegate OnMouseButtonDownEvent; // 0x1C4 (16)

	void SetOpacity(float InOpacity); // Function UMG.Image.SetOpacity(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FCE30>
	void SetColorAndOpacity(struct FLinearColor InColorAndOpacity); // Function UMG.Image.SetColorAndOpacity(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FCA80>
	void SetBrushTintColor(struct FSlateColor TintColor); // Function UMG.Image.SetBrushTintColor(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FC900>
	void SetBrushSize(struct FVector2D DesiredSize); // Function UMG.Image.SetBrushSize(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FC880>
	void SetBrushResourceObject(struct Object ResourceObject); // Function UMG.Image.SetBrushResourceObject(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FC800>
	void SetBrushFromTextureDynamic(struct UTexture2DDynamic Texture, bool bMatchSize); // Function UMG.Image.SetBrushFromTextureDynamic(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FC730>
	void SetBrushFromTexture(struct UTexture2D Texture, bool bMatchSize); // Function UMG.Image.SetBrushFromTexture(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FC660>
	void SetBrushFromSoftTexture(struct TSoftObjectPtr<UTexture2D> SoftTexture, bool bMatchSize); // Function UMG.Image.SetBrushFromSoftTexture(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FC530>
	void SetBrushFromSoftMaterial(struct TSoftObjectPtr<UMaterialInterface> SoftMaterial); // Function UMG.Image.SetBrushFromSoftMaterial(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FC440>
	void SetBrushFromMaterial(struct UMaterialInterface Material); // Function UMG.Image.SetBrushFromMaterial(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FC3B0>
	void SetBrushFromAtlasInterface(struct TScriptInterface<ISlateTextureAtlasInterface> AtlasRegion, bool bMatchSize); // Function UMG.Image.SetBrushFromAtlasInterface(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FC2C0>
	void SetBrushFromAsset(struct USlateBrushAsset Asset); // Function UMG.Image.SetBrushFromAsset(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FC230>
	void SetBrush(struct FSlateBrush& InBrush); // Function UMG.Image.SetBrush(Native|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FC0B0>
	struct UMaterialInstanceDynamic GetDynamicMaterial(); // Function UMG.Image.GetDynamicMaterial(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FB7A0>
};

// Class UMG.TextLayoutWidget
class UTextLayoutWidget : public UWidget {

public:

	struct FShapedTextOptions ShapedTextOptions; // 0x108 (3)
	enum class ETextJustify Justification; // 0x10B (1)
	enum class ETextWrappingPolicy WrappingPolicy; // 0x10C (1)
	char AutoWrapText : 1; // 0x10D (1)
	char pad_10D_1 : 7; // 0x10D (1)
	float WrapTextAt; // 0x110 (4)
	struct FMargin Margin; // 0x114 (16)
	float LineHeightPercentage; // 0x124 (4)

	void SetJustification(enum class ETextJustify InJustification); // Function UMG.TextLayoutWidget.SetJustification(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09D30>
};

// Class UMG.TextBlock
class UTextBlock : public UTextLayoutWidget {

public:

	struct FText Text; // 0x128 (24)
	struct FDelegate TextDelegate; // 0x140 (16)
	struct FSlateColor ColorAndOpacity; // 0x150 (40)
	struct FDelegate ColorAndOpacityDelegate; // 0x178 (16)
	struct FSlateFontInfo Font; // 0x188 (80)
	struct FSlateBrush StrikeBrush; // 0x1D8 (136)
	struct FVector2D ShadowOffset; // 0x260 (8)
	struct FLinearColor ShadowColorAndOpacity; // 0x268 (16)
	struct FDelegate ShadowColorAndOpacityDelegate; // 0x278 (16)
	float MinDesiredWidth; // 0x288 (4)
	bool bWrapWithInvalidationPanel; // 0x28C (1)
	bool bAutoWrapText; // 0x28D (1)
	bool bSimpleTextMode; // 0x28E (1)

	void SetText(struct FText InText); // Function UMG.TextBlock.SetText(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A840>
	void SetStrikeBrush(struct FSlateBrush InStrikeBrush); // Function UMG.TextBlock.SetStrikeBrush(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A6C0>
	void SetShadowOffset(struct FVector2D InShadowOffset); // Function UMG.TextBlock.SetShadowOffset(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A440>
	void SetShadowColorAndOpacity(struct FLinearColor InShadowColorAndOpacity); // Function UMG.TextBlock.SetShadowColorAndOpacity(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A3C0>
	void SetOpacity(float InOpacity); // Function UMG.TextBlock.SetOpacity(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A340>
	void SetMinDesiredWidth(float InMinDesiredWidth); // Function UMG.TextBlock.SetMinDesiredWidth(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A040>
	void SetFont(struct FSlateFontInfo InFontInfo); // Function UMG.TextBlock.SetFont(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A099B0>
	void SetColorAndOpacity(struct FSlateColor InColorAndOpacity); // Function UMG.TextBlock.SetColorAndOpacity(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09740>
	void SetAutoWrapText(bool InAutoTextWrap); // Function UMG.TextBlock.SetAutoWrapText(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A096B0>
	struct FText GetText(); // Function UMG.TextBlock.GetText(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A092D0>
	struct UMaterialInstanceDynamic GetDynamicOutlineMaterial(); // Function UMG.TextBlock.GetDynamicOutlineMaterial(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A090D0>
	struct UMaterialInstanceDynamic GetDynamicFontMaterial(); // Function UMG.TextBlock.GetDynamicFontMaterial(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A090A0>
};

// Class UMG.AsyncTaskDownloadImage
class UAsyncTaskDownloadImage : public UBlueprintAsyncActionBase {

public:

	struct FMulticastInlineDelegate OnSuccess; // 0x30 (16)
	struct FMulticastInlineDelegate OnFail; // 0x40 (16)

	struct UAsyncTaskDownloadImage DownloadImage(struct FString URL); // Function UMG.AsyncTaskDownloadImage.DownloadImage(Final|Native|Static|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F2B20>
};

// Class UMG.BackgroundBlur
class UBackgroundBlur : public UContentWidget {

public:

	struct FMargin Padding; // 0x120 (16)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x130 (1)
	enum class EVerticalAlignment VerticalAlignment; // 0x131 (1)
	bool bApplyAlphaToBlur; // 0x132 (1)
	float BlurStrength; // 0x134 (4)
	bool bOverrideAutoRadiusCalculation; // 0x138 (1)
	int32_t BlurRadius; // 0x13C (4)
	struct FSlateBrush LowQualityFallbackBrush; // 0x140 (136)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.BackgroundBlur.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F48A0>
	void SetPadding(struct FMargin InPadding); // Function UMG.BackgroundBlur.SetPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F41F0>
	void SetLowQualityFallbackBrush(struct FSlateBrush& InBrush); // Function UMG.BackgroundBlur.SetLowQualityFallbackBrush(Final|Native|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3E60>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.BackgroundBlur.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3AB0>
	void SetBlurStrength(float InStrength); // Function UMG.BackgroundBlur.SetBlurStrength(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F34B0>
	void SetBlurRadius(int32_t InBlurRadius); // Function UMG.BackgroundBlur.SetBlurRadius(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3430>
	void SetApplyAlphaToBlur(bool bInApplyAlphaToBlur); // Function UMG.BackgroundBlur.SetApplyAlphaToBlur(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3290>
};

// Class UMG.PanelSlot
class UPanelSlot : public UVisual {

public:

	struct UPanelWidget Parent; // 0x28 (8)
	struct UWidget Content; // 0x30 (8)
};

// Class UMG.BackgroundBlurSlot
class UBackgroundBlurSlot : public UPanelSlot {

public:

	struct FMargin Padding; // 0x38 (16)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x48 (1)
	enum class EVerticalAlignment VerticalAlignment; // 0x49 (1)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.BackgroundBlurSlot.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F4920>
	void SetPadding(struct FMargin InPadding); // Function UMG.BackgroundBlurSlot.SetPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F4280>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.BackgroundBlurSlot.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3B30>
};

// Class UMG.PropertyBinding
class UPropertyBinding : public Object {

public:

	struct TWeakObjectPtr<struct Object> SourceObject; // 0x28 (8)
	struct FDynamicPropertyPath SourcePath; // 0x30 (40)
	struct FName DestinationProperty; // 0x58 (8)
};

// Class UMG.Border
class UBorder : public UContentWidget {

public:

	enum class EHorizontalAlignment HorizontalAlignment; // 0x120 (1)
	enum class EVerticalAlignment VerticalAlignment; // 0x121 (1)
	char bShowEffectWhenDisabled : 1; // 0x122 (1)
	char pad_122_1 : 7; // 0x122 (1)
	struct FLinearColor ContentColorAndOpacity; // 0x124 (16)
	struct FDelegate ContentColorAndOpacityDelegate; // 0x134 (16)
	struct FMargin Padding; // 0x144 (16)
	struct FSlateBrush Background; // 0x158 (136)
	struct FDelegate BackgroundDelegate; // 0x1E0 (16)
	struct FLinearColor BrushColor; // 0x1F0 (16)
	struct FDelegate BrushColorDelegate; // 0x200 (16)
	struct FVector2D DesiredSizeScale; // 0x210 (8)
	bool bFlipForRightToLeftFlowDirection; // 0x218 (1)
	struct FDelegate OnMouseButtonDownEvent; // 0x21C (16)
	struct FDelegate OnMouseButtonUpEvent; // 0x22C (16)
	struct FDelegate OnMouseMoveEvent; // 0x23C (16)
	struct FDelegate OnMouseDoubleClickEvent; // 0x24C (16)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.Border.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F49A0>
	void SetPadding(struct FMargin InPadding); // Function UMG.Border.SetPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F4310>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.Border.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3BB0>
	void SetDesiredSizeScale(struct FVector2D InScale); // Function UMG.Border.SetDesiredSizeScale(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3A30>
	void SetContentColorAndOpacity(struct FLinearColor InContentColorAndOpacity); // Function UMG.Border.SetContentColorAndOpacity(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F39B0>
	void SetBrushFromTexture(struct UTexture2D Texture); // Function UMG.Border.SetBrushFromTexture(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F37B0>
	void SetBrushFromMaterial(struct UMaterialInterface Material); // Function UMG.Border.SetBrushFromMaterial(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F37B0>
	void SetBrushFromAsset(struct USlateBrushAsset Asset); // Function UMG.Border.SetBrushFromAsset(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3730>
	void SetBrushColor(struct FLinearColor InBrushColor); // Function UMG.Border.SetBrushColor(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F36B0>
	void SetBrush(struct FSlateBrush& InBrush); // Function UMG.Border.SetBrush(Final|Native|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3530>
	struct UMaterialInstanceDynamic GetDynamicMaterial(); // Function UMG.Border.GetDynamicMaterial(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F2CE0>
};

// Class UMG.BorderSlot
class UBorderSlot : public UPanelSlot {

public:

	struct FMargin Padding; // 0x38 (16)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x48 (1)
	enum class EVerticalAlignment VerticalAlignment; // 0x49 (1)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.BorderSlot.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F4A20>
	void SetPadding(struct FMargin InPadding); // Function UMG.BorderSlot.SetPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F43A0>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.BorderSlot.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3C30>
};

// Class UMG.ButtonSlot
class UButtonSlot : public UPanelSlot {

public:

	struct FMargin Padding; // 0x38 (16)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x48 (1)
	enum class EVerticalAlignment VerticalAlignment; // 0x49 (1)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.ButtonSlot.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F4AA0>
	void SetPadding(struct FMargin InPadding); // Function UMG.ButtonSlot.SetPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F4430>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.ButtonSlot.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3CB0>
};

// Class UMG.CanvasPanelSlot
class UCanvasPanelSlot : public UPanelSlot {

public:

	struct FAnchorData LayoutData; // 0x38 (40)
	bool bAutoSize; // 0x60 (1)
	int32_t ZOrder; // 0x64 (4)

	void SetZOrder(int32_t InZOrder); // Function UMG.CanvasPanelSlot.SetZOrder(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F4B20>
	void SetSize(struct FVector2D InSize); // Function UMG.CanvasPanelSlot.SetSize(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F46C0>
	void SetPosition(struct FVector2D InPosition); // Function UMG.CanvasPanelSlot.SetPosition(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F4540>
	void SetOffsets(struct FMargin InOffset); // Function UMG.CanvasPanelSlot.SetOffsets(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F4160>
	void SetMinimum(struct FVector2D InMinimumAnchors); // Function UMG.CanvasPanelSlot.SetMinimum(Final|Native|Public|HasDefaults) // <VeiledExperts-Win64-Shipping.exe+0x29F4060>
	void SetMaximum(struct FVector2D InMaximumAnchors); // Function UMG.CanvasPanelSlot.SetMaximum(Final|Native|Public|HasDefaults) // <VeiledExperts-Win64-Shipping.exe+0x29F3FE0>
	void SetLayout(struct FAnchorData& InLayoutData); // Function UMG.CanvasPanelSlot.SetLayout(Final|Native|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3DC0>
	void SetAutoSize(bool InbAutoSize); // Function UMG.CanvasPanelSlot.SetAutoSize(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3320>
	void SetAnchors(struct FAnchors InAnchors); // Function UMG.CanvasPanelSlot.SetAnchors(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3200>
	void SetAlignment(struct FVector2D InAlignment); // Function UMG.CanvasPanelSlot.SetAlignment(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3180>
	int32_t GetZOrder(); // Function UMG.CanvasPanelSlot.GetZOrder(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F30C0>
	struct FVector2D GetSize(); // Function UMG.CanvasPanelSlot.GetSize(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F2E20>
	struct FVector2D GetPosition(); // Function UMG.CanvasPanelSlot.GetPosition(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F2DE0>
	struct FMargin GetOffsets(); // Function UMG.CanvasPanelSlot.GetOffsets(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F2DA0>
	struct FAnchorData GetLayout(); // Function UMG.CanvasPanelSlot.GetLayout(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F2D10>
	bool GetAutoSize(); // Function UMG.CanvasPanelSlot.GetAutoSize(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F2C80>
	struct FAnchors GetAnchors(); // Function UMG.CanvasPanelSlot.GetAnchors(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F2C40>
	struct FVector2D GetAlignment(); // Function UMG.CanvasPanelSlot.GetAlignment(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F2C00>
};

// Class UMG.CheckBox
class UCheckBox : public UContentWidget {

public:

	enum class ECheckBoxState CheckedState; // 0x120 (1)
	struct FDelegate CheckedStateDelegate; // 0x124 (16)
	struct FCheckBoxStyle WidgetStyle; // 0x138 (1408)
	struct USlateWidgetStyleAsset Style; // 0x6B8 (8)
	struct USlateBrushAsset UncheckedImage; // 0x6C0 (8)
	struct USlateBrushAsset UncheckedHoveredImage; // 0x6C8 (8)
	struct USlateBrushAsset UncheckedPressedImage; // 0x6D0 (8)
	struct USlateBrushAsset CheckedImage; // 0x6D8 (8)
	struct USlateBrushAsset CheckedHoveredImage; // 0x6E0 (8)
	struct USlateBrushAsset CheckedPressedImage; // 0x6E8 (8)
	struct USlateBrushAsset UndeterminedImage; // 0x6F0 (8)
	struct USlateBrushAsset UndeterminedHoveredImage; // 0x6F8 (8)
	struct USlateBrushAsset UndeterminedPressedImage; // 0x700 (8)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x708 (1)
	struct FMargin Padding; // 0x70C (16)
	struct FSlateColor BorderBackgroundColor; // 0x720 (40)
	bool IsFocusable; // 0x748 (1)
	struct FMulticastInlineDelegate OnCheckStateChanged; // 0x750 (16)

	void SetIsChecked(bool InIsChecked); // Function UMG.CheckBox.SetIsChecked(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3D30>
	void SetCheckedState(enum class ECheckBoxState InCheckedState); // Function UMG.CheckBox.SetCheckedState(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3830>
	bool IsPressed(); // Function UMG.CheckBox.IsPressed(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F3150>
	bool IsChecked(); // Function UMG.CheckBox.IsChecked(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F30F0>
	enum class ECheckBoxState GetCheckedState(); // Function UMG.CheckBox.GetCheckedState(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F2CB0>
};

// Class UMG.CircularThrobber
class UCircularThrobber : public UWidget {

public:

	int32_t NumberOfPieces; // 0x108 (4)
	float Period; // 0x10C (4)
	float Radius; // 0x110 (4)
	struct USlateBrushAsset PieceImage; // 0x118 (8)
	struct FSlateBrush Image; // 0x120 (136)
	bool bEnableRadius; // 0x1A8 (1)

	void SetRadius(float InRadius); // Function UMG.CircularThrobber.SetRadius(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F4640>
	void SetPeriod(float InPeriod); // Function UMG.CircularThrobber.SetPeriod(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F44C0>
	void SetNumberOfPieces(int32_t InNumberOfPieces); // Function UMG.CircularThrobber.SetNumberOfPieces(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F40E0>
};

// Class UMG.ComboBox
class UComboBox : public UWidget {

public:

	struct TArray<struct Object> Items; // 0x108 (16)
	struct FDelegate OnGenerateWidgetEvent; // 0x118 (16)
	bool bIsFocusable; // 0x128 (1)
};

// Class UMG.ComboBoxString
class UComboBoxString : public UWidget {

public:

	struct TArray<struct FString> DefaultOptions; // 0x108 (16)
	struct FString SelectedOption; // 0x118 (16)
	struct FComboBoxStyle WidgetStyle; // 0x128 (1008)
	struct FTableRowStyle ItemStyle; // 0x518 (1992)
	struct FMargin ContentPadding; // 0xCE0 (16)
	float MaxListHeight; // 0xCF0 (4)
	bool HasDownArrow; // 0xCF4 (1)
	bool EnableGamepadNavigationMode; // 0xCF5 (1)
	struct FSlateFontInfo Font; // 0xCF8 (80)
	struct FSlateColor ForegroundColor; // 0xD48 (40)
	bool bIsFocusable; // 0xD70 (1)
	struct FDelegate OnGenerateWidgetEvent; // 0xD74 (16)
	struct FMulticastInlineDelegate OnSelectionChanged; // 0xD88 (16)
	struct FMulticastInlineDelegate OnOpening; // 0xD98 (16)

	void SetSelectedOption(struct FString Option); // Function UMG.ComboBoxString.SetSelectedOption(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F8950>
	void SetSelectedIndex(int32_t Index); // Function UMG.ComboBoxString.SetSelectedIndex(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F88D0>
	bool RemoveOption(struct FString Option); // Function UMG.ComboBoxString.RemoveOption(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F79C0>
	void RefreshOptions(); // Function UMG.ComboBoxString.RefreshOptions(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F7920>
	void OnSelectionChangedEvent__DelegateSignature(struct FString SelectedItem, enum class ESelectInfo SelectionType); // DelegateFunction UMG.ComboBoxString.OnSelectionChangedEvent__DelegateSignature(MulticastDelegate|Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnOpeningEvent__DelegateSignature(); // DelegateFunction UMG.ComboBoxString.OnOpeningEvent__DelegateSignature(MulticastDelegate|Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	bool IsOpen(); // Function UMG.ComboBoxString.IsOpen(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F78F0>
	struct FString GetSelectedOption(); // Function UMG.ComboBoxString.GetSelectedOption(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F76D0>
	int32_t GetSelectedIndex(); // Function UMG.ComboBoxString.GetSelectedIndex(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F76A0>
	int32_t GetOptionCount(); // Function UMG.ComboBoxString.GetOptionCount(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F7670>
	struct FString GetOptionAtIndex(int32_t Index); // Function UMG.ComboBoxString.GetOptionAtIndex(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F75A0>
	int32_t FindOptionIndex(struct FString Option); // Function UMG.ComboBoxString.FindOptionIndex(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F73A0>
	void ClearSelection(); // Function UMG.ComboBoxString.ClearSelection(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F6FF0>
	void ClearOptions(); // Function UMG.ComboBoxString.ClearOptions(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F6FD0>
	void AddOption(struct FString Option); // Function UMG.ComboBoxString.AddOption(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F6E50>
};

// Class UMG.DragDropOperation
class UDragDropOperation : public Object {

public:

	struct FString Tag; // 0x28 (16)
	struct Object Payload; // 0x38 (8)
	struct UWidget DefaultDragVisual; // 0x40 (8)
	enum class EDragPivot Pivot; // 0x48 (1)
	struct FVector2D Offset; // 0x4C (8)
	struct FMulticastInlineDelegate OnDrop; // 0x58 (16)
	struct FMulticastInlineDelegate OnDragCancelled; // 0x68 (16)
	struct FMulticastInlineDelegate OnDragged; // 0x78 (16)

	void Drop(struct FPointerEvent& PointerEvent); // Function UMG.DragDropOperation.Drop(Native|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x29F7270>
	void Dragged(struct FPointerEvent& PointerEvent); // Function UMG.DragDropOperation.Dragged(Native|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x29F7140>
	void DragCancelled(struct FPointerEvent& PointerEvent); // Function UMG.DragDropOperation.DragCancelled(Native|Event|Public|HasOutParms|BlueprintEvent) // <VeiledExperts-Win64-Shipping.exe+0x29F7010>
};

// Class UMG.DynamicEntryBoxBase
class UDynamicEntryBoxBase : public UWidget {

public:

	enum class EDynamicBoxType EntryBoxType; // 0x108 (1)
	struct FVector2D EntrySpacing; // 0x10C (8)
	struct TArray<struct FVector2D> SpacingPattern; // 0x118 (16)
	struct FSlateChildSize EntrySizeRule; // 0x128 (8)
	enum class EHorizontalAlignment EntryHorizontalAlignment; // 0x130 (1)
	enum class EVerticalAlignment EntryVerticalAlignment; // 0x131 (1)
	int32_t MaxElementSize; // 0x134 (4)
	struct FUserWidgetPool EntryWidgetPool; // 0x148 (128)

	void SetEntrySpacing(struct FVector2D& InEntrySpacing); // Function UMG.DynamicEntryBoxBase.SetEntrySpacing(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F7D60>
	int32_t GetNumEntries(); // Function UMG.DynamicEntryBoxBase.GetNumEntries(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F7570>
	struct TArray<struct UUserWidget> GetAllEntries(); // Function UMG.DynamicEntryBoxBase.GetAllEntries(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F7450>
};

// Class UMG.DynamicEntryBox
class UDynamicEntryBox : public UDynamicEntryBoxBase {

public:

	struct UClass* EntryWidgetClass; // 0x1C8 (8)

	void Reset(bool bDeleteWidgets); // Function UMG.DynamicEntryBox.Reset(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F7A70>
	void RemoveEntry(struct UUserWidget EntryWidget); // Function UMG.DynamicEntryBox.RemoveEntry(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F7940>
	struct UUserWidget BP_CreateEntryOfClass(struct UClass* EntryClass); // Function UMG.DynamicEntryBox.BP_CreateEntryOfClass(Final|Native|Private|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F6F20>
	struct UUserWidget BP_CreateEntry(); // Function UMG.DynamicEntryBox.BP_CreateEntry(Final|Native|Private|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F6EF0>
};

// Class UMG.EditableText
class UEditableText : public UWidget {

public:

	struct FText Text; // 0x108 (24)
	struct FDelegate TextDelegate; // 0x120 (16)
	struct FText HintText; // 0x130 (24)
	struct FDelegate HintTextDelegate; // 0x148 (16)
	struct FEditableTextStyle WidgetStyle; // 0x158 (536)
	struct USlateWidgetStyleAsset Style; // 0x370 (8)
	struct USlateBrushAsset BackgroundImageSelected; // 0x378 (8)
	struct USlateBrushAsset BackgroundImageComposing; // 0x380 (8)
	struct USlateBrushAsset CaretImage; // 0x388 (8)
	struct FSlateFontInfo Font; // 0x390 (80)
	struct FSlateColor ColorAndOpacity; // 0x3E0 (40)
	bool IsReadOnly; // 0x408 (1)
	bool IsPassword; // 0x409 (1)
	float MinimumDesiredWidth; // 0x40C (4)
	bool IsCaretMovedWhenGainFocus; // 0x410 (1)
	bool SelectAllTextWhenFocused; // 0x411 (1)
	bool RevertTextOnEscape; // 0x412 (1)
	bool ClearKeyboardFocusOnCommit; // 0x413 (1)
	bool SelectAllTextOnCommit; // 0x414 (1)
	bool AllowContextMenu; // 0x415 (1)
	enum class EVirtualKeyboardType KeyboardType; // 0x416 (1)
	struct FVirtualKeyboardOptions VirtualKeyboardOptions; // 0x417 (1)
	enum class EVirtualKeyboardTrigger VirtualKeyboardTrigger; // 0x418 (1)
	enum class EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0x419 (1)
	enum class ETextJustify Justification; // 0x41A (1)
	struct FShapedTextOptions ShapedTextOptions; // 0x41B (3)
	struct FMulticastInlineDelegate OnTextChanged; // 0x420 (16)
	struct FMulticastInlineDelegate OnTextCommitted; // 0x430 (16)

	void SetText(struct FText InText); // Function UMG.EditableText.SetText(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F8A30>
	void SetJustification(enum class ETextJustify InJustification); // Function UMG.EditableText.SetJustification(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F8470>
	void SetIsReadOnly(bool InbIsReadyOnly); // Function UMG.EditableText.SetIsReadOnly(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F8350>
	void SetIsPassword(bool InbIsPassword); // Function UMG.EditableText.SetIsPassword(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F8230>
	void SetHintText(struct FText InHintText); // Function UMG.EditableText.SetHintText(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F7ED0>
	void OnEditableTextCommittedEvent__DelegateSignature(struct FText& Text, enum class ETextCommit CommitMethod); // DelegateFunction UMG.EditableText.OnEditableTextCommittedEvent__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnEditableTextChangedEvent__DelegateSignature(struct FText& Text); // DelegateFunction UMG.EditableText.OnEditableTextChangedEvent__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FText GetText(); // Function UMG.EditableText.GetText(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F7750>
};

// Class UMG.EditableTextBox
class UEditableTextBox : public UWidget {

public:

	struct FText Text; // 0x108 (24)
	struct FDelegate TextDelegate; // 0x120 (16)
	struct FEditableTextBoxStyle WidgetStyle; // 0x130 (2032)
	struct USlateWidgetStyleAsset Style; // 0x920 (8)
	struct FText HintText; // 0x928 (24)
	struct FDelegate HintTextDelegate; // 0x940 (16)
	struct FSlateFontInfo Font; // 0x950 (80)
	struct FLinearColor ForegroundColor; // 0x9A0 (16)
	struct FLinearColor BackgroundColor; // 0x9B0 (16)
	struct FLinearColor ReadOnlyForegroundColor; // 0x9C0 (16)
	bool IsReadOnly; // 0x9D0 (1)
	bool IsPassword; // 0x9D1 (1)
	float MinimumDesiredWidth; // 0x9D4 (4)
	struct FMargin Padding; // 0x9D8 (16)
	bool IsCaretMovedWhenGainFocus; // 0x9E8 (1)
	bool SelectAllTextWhenFocused; // 0x9E9 (1)
	bool RevertTextOnEscape; // 0x9EA (1)
	bool ClearKeyboardFocusOnCommit; // 0x9EB (1)
	bool SelectAllTextOnCommit; // 0x9EC (1)
	bool AllowContextMenu; // 0x9ED (1)
	enum class EVirtualKeyboardType KeyboardType; // 0x9EE (1)
	struct FVirtualKeyboardOptions VirtualKeyboardOptions; // 0x9EF (1)
	enum class EVirtualKeyboardTrigger VirtualKeyboardTrigger; // 0x9F0 (1)
	enum class EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0x9F1 (1)
	enum class ETextJustify Justification; // 0x9F2 (1)
	struct FShapedTextOptions ShapedTextOptions; // 0x9F3 (3)
	struct FMulticastInlineDelegate OnTextChanged; // 0x9F8 (16)
	struct FMulticastInlineDelegate OnTextCommitted; // 0xA08 (16)

	void SetText(struct FText InText); // Function UMG.EditableTextBox.SetText(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F8B10>
	void SetJustification(enum class ETextJustify InJustification); // Function UMG.EditableTextBox.SetJustification(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F84F0>
	void SetIsReadOnly(bool bReadOnly); // Function UMG.EditableTextBox.SetIsReadOnly(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F83E0>
	void SetIsPassword(bool bIsPassword); // Function UMG.EditableTextBox.SetIsPassword(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F82C0>
	void SetHintText(struct FText InText); // Function UMG.EditableTextBox.SetHintText(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F7FB0>
	void SetError(struct FText InError); // Function UMG.EditableTextBox.SetError(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F7DF0>
	void OnEditableTextBoxCommittedEvent__DelegateSignature(struct FText& Text, enum class ETextCommit CommitMethod); // DelegateFunction UMG.EditableTextBox.OnEditableTextBoxCommittedEvent__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnEditableTextBoxChangedEvent__DelegateSignature(struct FText& Text); // DelegateFunction UMG.EditableTextBox.OnEditableTextBoxChangedEvent__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	bool HasError(); // Function UMG.EditableTextBox.HasError(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F78C0>
	struct FText GetText(); // Function UMG.EditableTextBox.GetText(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F77F0>
	void ClearError(); // Function UMG.EditableTextBox.ClearError(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F6FB0>
};

// Class UMG.ExpandableArea
class UExpandableArea : public UWidget {

public:

	struct FExpandableAreaStyle Style; // 0x110 (288)
	struct FSlateBrush BorderBrush; // 0x230 (136)
	struct FSlateColor BorderColor; // 0x2B8 (40)
	bool bIsExpanded; // 0x2E0 (1)
	float MaxHeight; // 0x2E4 (4)
	struct FMargin HeaderPadding; // 0x2E8 (16)
	struct FMargin AreaPadding; // 0x2F8 (16)
	struct FMulticastInlineDelegate OnExpansionChanged; // 0x308 (16)
	struct UWidget HeaderContent; // 0x318 (8)
	struct UWidget BodyContent; // 0x320 (8)

	void SetIsExpanded_Animated(bool IsExpanded); // Function UMG.ExpandableArea.SetIsExpanded_Animated(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F81A0>
	void SetIsExpanded(bool IsExpanded); // Function UMG.ExpandableArea.SetIsExpanded(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F8110>
	bool GetIsExpanded(); // Function UMG.ExpandableArea.GetIsExpanded(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29F7540>
};

// Class UMG.GridPanel
class UGridPanel : public UPanelWidget {

public:

	struct TArray<float> ColumnFill; // 0x120 (16)
	struct TArray<float> RowFill; // 0x130 (16)

	void SetRowFill(int32_t ColumnIndex, float Coefficient); // Function UMG.GridPanel.SetRowFill(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F8780>
	void SetColumnFill(int32_t ColumnIndex, float Coefficient); // Function UMG.GridPanel.SetColumnFill(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F7B80>
	struct UGridSlot AddChildToGrid(struct UWidget Content, int32_t InRow, int32_t InColumn); // Function UMG.GridPanel.AddChildToGrid(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F6D50>
};

// Class UMG.GridSlot
class UGridSlot : public UPanelSlot {

public:

	struct FMargin Padding; // 0x38 (16)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x48 (1)
	enum class EVerticalAlignment VerticalAlignment; // 0x49 (1)
	int32_t Row; // 0x4C (4)
	int32_t RowSpan; // 0x50 (4)
	int32_t Column; // 0x54 (4)
	int32_t ColumnSpan; // 0x58 (4)
	int32_t Layer; // 0x5C (4)
	struct FVector2D Nudge; // 0x60 (8)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.GridSlot.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F8BF0>
	void SetRowSpan(int32_t InRowSpan); // Function UMG.GridSlot.SetRowSpan(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F8850>
	void SetRow(int32_t InRow); // Function UMG.GridSlot.SetRow(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F8700>
	void SetPadding(struct FMargin InPadding); // Function UMG.GridSlot.SetPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F8670>
	void SetNudge(struct FVector2D InNudge); // Function UMG.GridSlot.SetNudge(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F85F0>
	void SetLayer(int32_t InLayer); // Function UMG.GridSlot.SetLayer(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F8570>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.GridSlot.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F8090>
	void SetColumnSpan(int32_t InColumnSpan); // Function UMG.GridSlot.SetColumnSpan(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F7C50>
	void SetColumn(int32_t InColumn); // Function UMG.GridSlot.SetColumn(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F7B00>
};

// Class UMG.HorizontalBoxSlot
class UHorizontalBoxSlot : public UPanelSlot {

public:

	struct FMargin Padding; // 0x40 (16)
	struct FSlateChildSize Size; // 0x50 (8)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x58 (1)
	enum class EVerticalAlignment VerticalAlignment; // 0x59 (1)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.HorizontalBoxSlot.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FD3C0>
	void SetSize(struct FSlateChildSize InSize); // Function UMG.HorizontalBoxSlot.SetSize(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FD2B0>
	void SetPadding(struct FMargin InPadding); // Function UMG.HorizontalBoxSlot.SetPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FCEB0>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.HorizontalBoxSlot.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FCBF0>
};

// Class UMG.InputKeySelector
class UInputKeySelector : public UWidget {

public:

	struct FButtonStyle WidgetStyle; // 0x108 (632)
	struct FTextBlockStyle TextStyle; // 0x380 (616)
	struct FInputChord SelectedKey; // 0x5E8 (32)
	struct FSlateFontInfo Font; // 0x608 (80)
	struct FMargin Margin; // 0x658 (16)
	struct FLinearColor ColorAndOpacity; // 0x668 (16)
	struct FText KeySelectionText; // 0x678 (24)
	struct FText NoKeySpecifiedText; // 0x690 (24)
	bool bAllowModifierKeys; // 0x6A8 (1)
	bool bAllowGamepadKeys; // 0x6A9 (1)
	struct TArray<struct FKey> EscapeKeys; // 0x6B0 (16)
	struct FMulticastInlineDelegate OnKeySelected; // 0x6C0 (16)
	struct FMulticastInlineDelegate OnIsSelectingKeyChanged; // 0x6D0 (16)

	void SetTextBlockVisibility(enum class ESlateVisibility InVisibility); // Function UMG.InputKeySelector.SetTextBlockVisibility(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FD340>
	void SetSelectedKey(struct FInputChord& InSelectedKey); // Function UMG.InputKeySelector.SetSelectedKey(Final|Native|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FD140>
	void SetNoKeySpecifiedText(struct FText InNoKeySpecifiedText); // Function UMG.InputKeySelector.SetNoKeySpecifiedText(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FCD50>
	void SetKeySelectionText(struct FText InKeySelectionText); // Function UMG.InputKeySelector.SetKeySelectionText(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FCC70>
	void SetEscapeKeys(struct TArray<struct FKey>& InKeys); // Function UMG.InputKeySelector.SetEscapeKeys(Final|Native|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FCB00>
	void SetAllowModifierKeys(bool bInAllowModifierKeys); // Function UMG.InputKeySelector.SetAllowModifierKeys(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FC020>
	void SetAllowGamepadKeys(bool bInAllowGamepadKeys); // Function UMG.InputKeySelector.SetAllowGamepadKeys(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FBF90>
	void OnKeySelected__DelegateSignature(struct FInputChord SelectedKey); // DelegateFunction UMG.InputKeySelector.OnKeySelected__DelegateSignature(MulticastDelegate|Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnIsSelectingKeyChanged__DelegateSignature(); // DelegateFunction UMG.InputKeySelector.OnIsSelectingKeyChanged__DelegateSignature(MulticastDelegate|Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	bool GetIsSelectingKey(); // Function UMG.InputKeySelector.GetIsSelectingKey(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29FB860>
};

// Class UMG.InvalidationBox
class UInvalidationBox : public UContentWidget {

public:

	bool bCanCache; // 0x120 (1)
	bool CacheRelativeTransforms; // 0x121 (1)

	void SetCanCache(bool CanCache); // Function UMG.InvalidationBox.SetCanCache(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FC9F0>
	void InvalidateCache(); // Function UMG.InvalidationBox.InvalidateCache(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0xFBCF20>
	bool GetCanCache(); // Function UMG.InvalidationBox.GetCanCache(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29FB6E0>
};

// Class UMG.ListViewBase
class UListViewBase : public UWidget {

public:

	struct UClass* EntryWidgetClass; // 0x108 (8)
	float WheelScrollMultiplier; // 0x110 (4)
	bool bEnableScrollAnimation; // 0x114 (1)
	bool bEnableFixedLineOffset; // 0x115 (1)
	float FixedLineScrollOffset; // 0x118 (4)
	struct FMulticastInlineDelegate BP_OnEntryGenerated; // 0x120 (16)
	struct FMulticastInlineDelegate BP_OnEntryReleased; // 0x130 (16)
	struct FUserWidgetPool EntryWidgetPool; // 0x140 (128)

	void SetWheelScrollMultiplier(float NewWheelScrollMultiplier); // Function UMG.ListViewBase.SetWheelScrollMultiplier(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FD440>
	void SetScrollOffset(float InScrollOffset); // Function UMG.ListViewBase.SetScrollOffset(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FCFC0>
	void SetScrollbarVisibility(enum class ESlateVisibility InVisibility); // Function UMG.ListViewBase.SetScrollbarVisibility(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FD040>
	void ScrollToTop(); // Function UMG.ListViewBase.ScrollToTop(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FBF70>
	void ScrollToBottom(); // Function UMG.ListViewBase.ScrollToBottom(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FBF50>
	void RequestRefresh(); // Function UMG.ListViewBase.RequestRefresh(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FBEB0>
	void RegenerateAllEntries(); // Function UMG.ListViewBase.RegenerateAllEntries(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FBE10>
	struct TArray<struct UUserWidget> GetDisplayedEntryWidgets(); // Function UMG.ListViewBase.GetDisplayedEntryWidgets(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29FB710>
};

// Class UMG.ListView
class UListView : public UListViewBase {

public:

	enum class EOrientation Orientation; // 0x2D8 (1)
	enum class ESelectionMode SelectionMode; // 0x2D9 (1)
	enum class EConsumeMouseWheel ConsumeMouseWheel; // 0x2DA (1)
	bool bClearSelectionOnClick; // 0x2DB (1)
	bool bIsFocusable; // 0x2DC (1)
	float EntrySpacing; // 0x2E0 (4)
	bool bReturnFocusToSelection; // 0x2E4 (1)
	struct TArray<struct Object> ListItems; // 0x2E8 (16)
	struct FMulticastInlineDelegate BP_OnEntryInitialized; // 0x308 (16)
	struct FMulticastInlineDelegate BP_OnItemClicked; // 0x318 (16)
	struct FMulticastInlineDelegate BP_OnItemDoubleClicked; // 0x328 (16)
	struct FMulticastInlineDelegate BP_OnItemIsHoveredChanged; // 0x338 (16)
	struct FMulticastInlineDelegate BP_OnItemSelectionChanged; // 0x348 (16)
	struct FMulticastInlineDelegate BP_OnItemScrolledIntoView; // 0x358 (16)

	void SetSelectionMode(enum class ESelectionMode SelectionMode); // Function UMG.ListView.SetSelectionMode(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FD230>
	void SetSelectedIndex(int32_t Index); // Function UMG.ListView.SetSelectedIndex(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FD0C0>
	void ScrollIndexIntoView(int32_t Index); // Function UMG.ListView.ScrollIndexIntoView(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FBED0>
	void RemoveItem(struct Object Item); // Function UMG.ListView.RemoveItem(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FBE30>
	void NavigateToIndex(int32_t Index); // Function UMG.ListView.NavigateToIndex(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FBD00>
	bool IsRefreshPending(); // Function UMG.ListView.IsRefreshPending(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29FBCD0>
	int32_t GetNumItems(); // Function UMG.ListView.GetNumItems(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29FBA30>
	struct TArray<struct Object> GetListItems(); // Function UMG.ListView.GetListItems(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29FB9C0>
	struct Object GetItemAt(int32_t Index); // Function UMG.ListView.GetItemAt(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29FB890>
	int32_t GetIndexForItem(struct Object Item); // Function UMG.ListView.GetIndexForItem(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29FB7D0>
	void ClearListItems(); // Function UMG.ListView.ClearListItems(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FB610>
	void BP_SetSelectedItem(struct Object Item); // Function UMG.ListView.BP_SetSelectedItem(Final|Native|Private|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FB590>
	void BP_SetListItems(struct TArray<struct Object>& InListItems); // Function UMG.ListView.BP_SetListItems(Final|Native|Private|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FB4E0>
	void BP_SetItemSelection(struct Object Item, bool bSelected); // Function UMG.ListView.BP_SetItemSelection(Final|Native|Private|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FB410>
	void BP_ScrollItemIntoView(struct Object Item); // Function UMG.ListView.BP_ScrollItemIntoView(Final|Native|Private|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FB390>
	void BP_NavigateToItem(struct Object Item); // Function UMG.ListView.BP_NavigateToItem(Final|Native|Private|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FB310>
	bool BP_IsItemVisible(struct Object Item); // Function UMG.ListView.BP_IsItemVisible(Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29FB280>
	bool BP_GetSelectedItems(struct TArray<struct Object>& Items); // Function UMG.ListView.BP_GetSelectedItems(Final|Native|Private|HasOutParms|BlueprintCallable|Const) // <VeiledExperts-Win64-Shipping.exe+0x29FB1C0>
	struct Object BP_GetSelectedItem(); // Function UMG.ListView.BP_GetSelectedItem(Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29FB190>
	int32_t BP_GetNumItemsSelected(); // Function UMG.ListView.BP_GetNumItemsSelected(Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29FB160>
	void BP_ClearSelection(); // Function UMG.ListView.BP_ClearSelection(Final|Native|Private|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FB140>
	void BP_CancelScrollIntoView(); // Function UMG.ListView.BP_CancelScrollIntoView(Final|Native|Private|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FB120>
	void AddItem(struct Object Item); // Function UMG.ListView.AddItem(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FB0A0>
};

// Class UMG.MenuAnchor
class UMenuAnchor : public UContentWidget {

public:

	struct UClass* MenuClass; // 0x120 (8)
	struct FDelegate OnGetMenuContentEvent; // 0x128 (16)
	enum class EMenuPlacement Placement; // 0x138 (1)
	bool bFitInWindow; // 0x139 (1)
	bool ShouldDeferPaintingAfterWindowContent; // 0x13A (1)
	bool UseApplicationMenuStack; // 0x13B (1)
	struct FMulticastInlineDelegate OnMenuOpenChanged; // 0x140 (16)

	void ToggleOpen(bool bFocusOnOpen); // Function UMG.MenuAnchor.ToggleOpen(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FD4F0>
	bool ShouldOpenDueToClick(); // Function UMG.MenuAnchor.ShouldOpenDueToClick(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29FD4C0>
	void SetPlacement(enum class EMenuPlacement InPlacement); // Function UMG.MenuAnchor.SetPlacement(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FCF40>
	void Open(bool bFocusMenu); // Function UMG.MenuAnchor.Open(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FBD80>
	bool IsOpen(); // Function UMG.MenuAnchor.IsOpen(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29FBCA0>
	bool HasOpenSubMenus(); // Function UMG.MenuAnchor.HasOpenSubMenus(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29FBB30>
	struct FVector2D GetMenuPosition(); // Function UMG.MenuAnchor.GetMenuPosition(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x29FB9F0>
	void FitInWindow(bool bFit); // Function UMG.MenuAnchor.FitInWindow(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FB650>
	void Close(); // Function UMG.MenuAnchor.Close(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FB630>
};

// Class UMG.MovieScene2DTransformSection
class UMovieScene2DTransformSection : public UMovieSceneSection {

public:

	struct FMovieScene2DTransformMask TransformMask; // 0xE0 (4)
	struct FMovieSceneFloatChannel Translation[0x2]; // 0xE8 (320)
	struct FMovieSceneFloatChannel Rotation; // 0x228 (160)
	struct FMovieSceneFloatChannel Scale[0x2]; // 0x2C8 (320)
	struct FMovieSceneFloatChannel Shear[0x2]; // 0x408 (320)
};

// Class UMG.MovieSceneMarginSection
class UMovieSceneMarginSection : public UMovieSceneSection {

public:

	struct FMovieSceneFloatChannel TopCurve; // 0xE0 (160)
	struct FMovieSceneFloatChannel LeftCurve; // 0x180 (160)
	struct FMovieSceneFloatChannel RightCurve; // 0x220 (160)
	struct FMovieSceneFloatChannel BottomCurve; // 0x2C0 (160)
};

// Class UMG.MovieSceneWidgetMaterialTrack
class UMovieSceneWidgetMaterialTrack : public UMovieSceneMaterialTrack {

public:

	struct TArray<struct FName> BrushPropertyNamePath; // 0x68 (16)
	struct FName TrackName; // 0x78 (8)
};

// Class UMG.MultiLineEditableText
class UMultiLineEditableText : public UTextLayoutWidget {

public:

	struct FText Text; // 0x128 (24)
	struct FText HintText; // 0x140 (24)
	struct FDelegate HintTextDelegate; // 0x158 (16)
	struct FTextBlockStyle WidgetStyle; // 0x168 (616)
	bool bIsReadOnly; // 0x3D0 (1)
	struct FSlateFontInfo Font; // 0x3D8 (80)
	bool SelectAllTextWhenFocused; // 0x428 (1)
	bool ClearTextSelectionOnFocusLoss; // 0x429 (1)
	bool RevertTextOnEscape; // 0x42A (1)
	bool ClearKeyboardFocusOnCommit; // 0x42B (1)
	bool AllowContextMenu; // 0x42C (1)
	struct FVirtualKeyboardOptions VirtualKeyboardOptions; // 0x42D (1)
	enum class EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0x42E (1)
	struct FMulticastInlineDelegate OnTextChanged; // 0x430 (16)
	struct FMulticastInlineDelegate OnTextCommitted; // 0x440 (16)

	void SetWidgetStyle(struct FTextBlockStyle& InWidgetStyle); // Function UMG.MultiLineEditableText.SetWidgetStyle(Final|Native|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A02480>
	void SetText(struct FText InText); // Function UMG.MultiLineEditableText.SetText(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01FC0>
	void SetIsReadOnly(bool bReadOnly); // Function UMG.MultiLineEditableText.SetIsReadOnly(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01C50>
	void SetHintText(struct FText InHintText); // Function UMG.MultiLineEditableText.SetHintText(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01980>
	void OnMultiLineEditableTextCommittedEvent__DelegateSignature(struct FText& Text, enum class ETextCommit CommitMethod); // DelegateFunction UMG.MultiLineEditableText.OnMultiLineEditableTextCommittedEvent__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnMultiLineEditableTextChangedEvent__DelegateSignature(struct FText& Text); // DelegateFunction UMG.MultiLineEditableText.OnMultiLineEditableTextChangedEvent__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FText GetText(); // Function UMG.MultiLineEditableText.GetText(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A00DB0>
	struct FText GetHintText(); // Function UMG.MultiLineEditableText.GetHintText(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A00C70>
};

// Class UMG.MultiLineEditableTextBox
class UMultiLineEditableTextBox : public UTextLayoutWidget {

public:

	struct FText Text; // 0x128 (24)
	struct FText HintText; // 0x140 (24)
	struct FDelegate HintTextDelegate; // 0x158 (16)
	struct FEditableTextBoxStyle WidgetStyle; // 0x168 (2032)
	struct FTextBlockStyle TextStyle; // 0x958 (616)
	bool bIsReadOnly; // 0xBC0 (1)
	bool AllowContextMenu; // 0xBC1 (1)
	struct FVirtualKeyboardOptions VirtualKeyboardOptions; // 0xBC2 (1)
	enum class EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0xBC3 (1)
	struct USlateWidgetStyleAsset Style; // 0xBC8 (8)
	struct FSlateFontInfo Font; // 0xBD0 (80)
	struct FLinearColor ForegroundColor; // 0xC20 (16)
	struct FLinearColor BackgroundColor; // 0xC30 (16)
	struct FLinearColor ReadOnlyForegroundColor; // 0xC40 (16)
	struct FMulticastInlineDelegate OnTextChanged; // 0xC50 (16)
	struct FMulticastInlineDelegate OnTextCommitted; // 0xC60 (16)

	void SetTextStyle(struct FTextBlockStyle& InTextStyle); // Function UMG.MultiLineEditableTextBox.SetTextStyle(Final|Native|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A02250>
	void SetText(struct FText InText); // Function UMG.MultiLineEditableTextBox.SetText(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A020A0>
	void SetIsReadOnly(bool bReadOnly); // Function UMG.MultiLineEditableTextBox.SetIsReadOnly(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01CE0>
	void SetHintText(struct FText InHintText); // Function UMG.MultiLineEditableTextBox.SetHintText(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01A60>
	void SetError(struct FText InError); // Function UMG.MultiLineEditableTextBox.SetError(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01820>
	void OnMultiLineEditableTextBoxCommittedEvent__DelegateSignature(struct FText& Text, enum class ETextCommit CommitMethod); // DelegateFunction UMG.MultiLineEditableTextBox.OnMultiLineEditableTextBoxCommittedEvent__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnMultiLineEditableTextBoxChangedEvent__DelegateSignature(struct FText& Text); // DelegateFunction UMG.MultiLineEditableTextBox.OnMultiLineEditableTextBoxChangedEvent__DelegateSignature(MulticastDelegate|Public|Delegate|HasOutParms) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	struct FText GetText(); // Function UMG.MultiLineEditableTextBox.GetText(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A00E50>
	struct FText GetHintText(); // Function UMG.MultiLineEditableTextBox.GetHintText(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A00D10>
};

// Class UMG.OverlaySlot
class UOverlaySlot : public UPanelSlot {

public:

	struct FMargin Padding; // 0x40 (16)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x50 (1)
	enum class EVerticalAlignment VerticalAlignment; // 0x51 (1)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.OverlaySlot.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A02400>
	void SetPadding(struct FMargin InPadding); // Function UMG.OverlaySlot.SetPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01DF0>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.OverlaySlot.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01B40>
};

// Class UMG.ProgressBar
class UProgressBar : public UWidget {

public:

	struct FProgressBarStyle WidgetStyle; // 0x108 (416)
	struct USlateWidgetStyleAsset Style; // 0x2A8 (8)
	struct USlateBrushAsset BackgroundImage; // 0x2B0 (8)
	struct USlateBrushAsset FillImage; // 0x2B8 (8)
	struct USlateBrushAsset MarqueeImage; // 0x2C0 (8)
	float Percent; // 0x2C8 (4)
	enum class EProgressBarFillType BarFillType; // 0x2CC (1)
	bool bIsMarquee; // 0x2CD (1)
	struct FVector2D BorderPadding; // 0x2D0 (8)
	struct FDelegate PercentDelegate; // 0x2D8 (16)
	struct FLinearColor FillColorAndOpacity; // 0x2E8 (16)
	struct FDelegate FillColorAndOpacityDelegate; // 0x2F8 (16)

	void SetPercent(float InPercent); // Function UMG.ProgressBar.SetPercent(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01E80>
	void SetIsMarquee(bool InbIsMarquee); // Function UMG.ProgressBar.SetIsMarquee(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01BC0>
	void SetFillColorAndOpacity(struct FLinearColor InColor); // Function UMG.ProgressBar.SetFillColorAndOpacity(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01900>
};

// Class UMG.RetainerBox
class URetainerBox : public UContentWidget {

public:

	bool RenderOnInvalidation; // 0x120 (1)
	bool RenderOnPhase; // 0x121 (1)
	int32_t Phase; // 0x124 (4)
	int32_t PhaseCount; // 0x128 (4)
	struct UMaterialInterface EffectMaterial; // 0x130 (8)
	struct FName TextureParameter; // 0x138 (8)

	void SetTextureParameter(struct FName TextureParameter); // Function UMG.RetainerBox.SetTextureParameter(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A02380>
	void SetRenderingPhase(int32_t RenderPhase, int32_t TotalPhases); // Function UMG.RetainerBox.SetRenderingPhase(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01F00>
	void SetEffectMaterial(struct UMaterialInterface EffectMaterial); // Function UMG.RetainerBox.SetEffectMaterial(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A017A0>
	void RequestRender(); // Function UMG.RetainerBox.RequestRender(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A011A0>
	struct UMaterialInstanceDynamic GetEffectMaterial(); // Function UMG.RetainerBox.GetEffectMaterial(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A00C40>
};

// Class UMG.RichTextBlock
class URichTextBlock : public UTextLayoutWidget {

public:

	struct FText Text; // 0x128 (24)
	struct UDataTable TextStyleSet; // 0x140 (8)
	struct TArray<struct UClass*> DecoratorClasses; // 0x148 (16)
	bool bOverrideDefaultStyle; // 0x158 (1)
	struct FTextBlockStyle DefaultTextStyleOverride; // 0x160 (616)
	float MinDesiredWidth; // 0x3C8 (4)
	struct TArray<struct URichTextBlockDecorator> InstanceDecorators; // 0x638 (16)

	void SetTextStyleSet(struct UDataTable NewTextStyleSet); // Function UMG.RichTextBlock.SetTextStyleSet(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A02300>
	void SetText(struct FText& InText); // Function UMG.RichTextBlock.SetText(Native|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A02180>
	void SetMinDesiredWidth(float InMinDesiredWidth); // Function UMG.RichTextBlock.SetMinDesiredWidth(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01D70>
	void SetDefaultTextStyle(struct FTextBlockStyle& InDefaultTextStyle); // Function UMG.RichTextBlock.SetDefaultTextStyle(Final|Native|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A016F0>
	void SetDefaultStrikeBrush(struct FSlateBrush& InStrikeBrush); // Function UMG.RichTextBlock.SetDefaultStrikeBrush(Final|Native|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01570>
	void SetDefaultShadowOffset(struct FVector2D InShadowOffset); // Function UMG.RichTextBlock.SetDefaultShadowOffset(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A014F0>
	void SetDefaultShadowColorAndOpacity(struct FLinearColor InShadowColorAndOpacity); // Function UMG.RichTextBlock.SetDefaultShadowColorAndOpacity(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01470>
	void SetDefaultFont(struct FSlateFontInfo InFontInfo); // Function UMG.RichTextBlock.SetDefaultFont(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01340>
	void SetDefaultColorAndOpacity(struct FSlateColor InColorAndOpacity); // Function UMG.RichTextBlock.SetDefaultColorAndOpacity(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01250>
	void SetAutoWrapText(bool InAutoTextWrap); // Function UMG.RichTextBlock.SetAutoWrapText(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A011C0>
	struct FText GetText(); // Function UMG.RichTextBlock.GetText(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A00EF0>
	struct URichTextBlockDecorator GetDecoratorByClass(struct UClass* DecoratorClass); // Function UMG.RichTextBlock.GetDecoratorByClass(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A00BB0>
	void ClearAllDefaultStyleOverrides(); // Function UMG.RichTextBlock.ClearAllDefaultStyleOverrides(Final|Native|Public) // <VeiledExperts-Win64-Shipping.exe+0x2A009A0>
};

// Class UMG.RichTextBlockImageDecorator
class URichTextBlockImageDecorator : public URichTextBlockDecorator {

public:

	struct UDataTable ImageSet; // 0x28 (8)
};

// Class UMG.SafeZone
class USafeZone : public UContentWidget {

public:

	bool PadLeft; // 0x120 (1)
	bool PadRight; // 0x121 (1)
	bool PadTop; // 0x122 (1)
	bool PadBottom; // 0x123 (1)

	void SetSidesToPad(bool InPadLeft, bool InPadRight, bool InPadTop, bool InPadBottom); // Function UMG.SafeZone.SetSidesToPad(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A06410>
};

// Class UMG.SafeZoneSlot
class USafeZoneSlot : public UPanelSlot {

public:

	bool bIsTitleSafe; // 0x38 (1)
	struct FMargin SafeAreaScale; // 0x3C (16)
	enum class EHorizontalAlignment HAlign; // 0x4C (1)
	enum class EVerticalAlignment VAlign; // 0x4D (1)
	struct FMargin Padding; // 0x50 (16)
};

// Class UMG.ScaleBox
class UScaleBox : public UContentWidget {

public:

	enum class EStretch Stretch; // 0x120 (1)
	enum class EStretchDirection StretchDirection; // 0x121 (1)
	float UserSpecifiedScale; // 0x124 (4)
	bool IgnoreInheritedScale; // 0x128 (1)

	void SetUserSpecifiedScale(float InUserSpecifiedScale); // Function UMG.ScaleBox.SetUserSpecifiedScale(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A06740>
	void SetStretchDirection(enum class EStretchDirection InStretchDirection); // Function UMG.ScaleBox.SetStretchDirection(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A066C0>
	void SetStretch(enum class EStretch InStretch); // Function UMG.ScaleBox.SetStretch(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A06640>
	void SetIgnoreInheritedScale(bool bInIgnoreInheritedScale); // Function UMG.ScaleBox.SetIgnoreInheritedScale(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05C20>
};

// Class UMG.ScaleBoxSlot
class UScaleBoxSlot : public UPanelSlot {

public:

	struct FMargin Padding; // 0x38 (16)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x48 (1)
	enum class EVerticalAlignment VerticalAlignment; // 0x49 (1)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.ScaleBoxSlot.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F4AA0>
	void SetPadding(struct FMargin InPadding); // Function UMG.ScaleBoxSlot.SetPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A06030>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.ScaleBoxSlot.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29F3CB0>
};

// Class UMG.ScrollBar
class UScrollBar : public UWidget {

public:

	struct FScrollBarStyle WidgetStyle; // 0x108 (1232)
	struct USlateWidgetStyleAsset Style; // 0x5D8 (8)
	bool bAlwaysShowScrollbar; // 0x5E0 (1)
	bool bAlwaysShowScrollbarTrack; // 0x5E1 (1)
	enum class EOrientation Orientation; // 0x5E2 (1)
	struct FVector2D Thickness; // 0x5E4 (8)
	struct FMargin Padding; // 0x5EC (16)

	void SetState(float InOffsetFraction, float InThumbSizeFraction); // Function UMG.ScrollBar.SetState(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A06580>
};

// Class UMG.ScrollBox
class UScrollBox : public UPanelWidget {

public:

	struct FScrollBoxStyle WidgetStyle; // 0x120 (552)
	struct FScrollBarStyle WidgetBarStyle; // 0x348 (1232)
	struct USlateWidgetStyleAsset Style; // 0x818 (8)
	struct USlateWidgetStyleAsset BarStyle; // 0x820 (8)
	enum class EOrientation Orientation; // 0x828 (1)
	enum class ESlateVisibility ScrollBarVisibility; // 0x829 (1)
	enum class EConsumeMouseWheel ConsumeMouseWheel; // 0x82A (1)
	struct FVector2D ScrollbarThickness; // 0x82C (8)
	struct FMargin ScrollbarPadding; // 0x834 (16)
	bool AlwaysShowScrollbar; // 0x844 (1)
	bool AlwaysShowScrollbarTrack; // 0x845 (1)
	bool AllowOverscroll; // 0x846 (1)
	bool bAnimateWheelScrolling; // 0x847 (1)
	enum class EDescendantScrollDestination NavigationDestination; // 0x848 (1)
	float NavigationScrollPadding; // 0x84C (4)
	enum class EScrollWhenFocusChanges ScrollWhenFocusChanges; // 0x850 (1)
	bool bAllowRightClickDragScrolling; // 0x851 (1)
	float WheelScrollMultiplier; // 0x854 (4)
	struct FMulticastInlineDelegate OnUserScrolled; // 0x858 (16)

	void SetWheelScrollMultiplier(float NewWheelScrollMultiplier); // Function UMG.ScrollBox.SetWheelScrollMultiplier(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A068C0>
	void SetScrollOffset(float NewScrollOffset); // Function UMG.ScrollBox.SetScrollOffset(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A06260>
	void SetScrollbarVisibility(enum class ESlateVisibility NewScrollBarVisibility); // Function UMG.ScrollBox.SetScrollbarVisibility(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A061E0>
	void SetScrollbarThickness(struct FVector2D& NewScrollbarThickness); // Function UMG.ScrollBox.SetScrollbarThickness(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A06380>
	void SetScrollbarPadding(struct FMargin& NewScrollbarPadding); // Function UMG.ScrollBox.SetScrollbarPadding(Final|Native|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A062E0>
	void SetOrientation(enum class EOrientation NewOrientation); // Function UMG.ScrollBox.SetOrientation(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05FB0>
	void SetConsumeMouseWheel(enum class EConsumeMouseWheel NewConsumeMouseWheel); // Function UMG.ScrollBox.SetConsumeMouseWheel(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05A20>
	void SetAnimateWheelScrolling(bool bShouldAnimateWheelScrolling); // Function UMG.ScrollBox.SetAnimateWheelScrolling(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05990>
	void SetAlwaysShowScrollbar(bool NewAlwaysShowScrollbar); // Function UMG.ScrollBox.SetAlwaysShowScrollbar(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05900>
	void SetAllowOverscroll(bool NewAllowOverscroll); // Function UMG.ScrollBox.SetAllowOverscroll(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05870>
	void ScrollWidgetIntoView(struct UWidget WidgetToFind, bool AnimateScroll, enum class EDescendantScrollDestination ScrollDestination, float Padding); // Function UMG.ScrollBox.ScrollWidgetIntoView(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05720>
	void ScrollToStart(); // Function UMG.ScrollBox.ScrollToStart(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05700>
	void ScrollToEnd(); // Function UMG.ScrollBox.ScrollToEnd(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A056E0>
	float GetViewOffsetFraction(); // Function UMG.ScrollBox.GetViewOffsetFraction(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A04EB0>
	float GetScrollOffsetOfEnd(); // Function UMG.ScrollBox.GetScrollOffsetOfEnd(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A04E80>
	float GetScrollOffset(); // Function UMG.ScrollBox.GetScrollOffset(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A04E50>
	void EndInertialScrolling(); // Function UMG.ScrollBox.EndInertialScrolling(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A04940>
};

// Class UMG.ScrollBoxSlot
class UScrollBoxSlot : public UPanelSlot {

public:

	struct FMargin Padding; // 0x38 (16)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x48 (1)
	enum class EVerticalAlignment VerticalAlignment; // 0x49 (1)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.ScrollBoxSlot.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A067C0>
	void SetPadding(struct FMargin InPadding); // Function UMG.ScrollBoxSlot.SetPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A060C0>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.ScrollBoxSlot.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05B20>
};

// Class UMG.SizeBox
class USizeBox : public UContentWidget {

public:

	float WidthOverride; // 0x130 (4)
	float HeightOverride; // 0x134 (4)
	float MinDesiredWidth; // 0x138 (4)
	float MinDesiredHeight; // 0x13C (4)
	float MaxDesiredWidth; // 0x140 (4)
	float MaxDesiredHeight; // 0x144 (4)
	float MinAspectRatio; // 0x148 (4)
	float MaxAspectRatio; // 0x14C (4)
	char bOverride_WidthOverride : 1; // 0x150 (1)
	char pad_140_1 : 7; // 0x140 (1)
	char pad_141_0 : 1; // 0x141 (1)
	char bOverride_HeightOverride : 1; // 0x150 (1)
	char pad_141_2 : 6; // 0x141 (1)
	char pad_142_0 : 2; // 0x142 (1)
	char bOverride_MinDesiredWidth : 1; // 0x150 (1)
	char pad_142_3 : 5; // 0x142 (1)
	char pad_143_0 : 3; // 0x143 (1)
	char bOverride_MinDesiredHeight : 1; // 0x150 (1)
	char pad_143_4 : 4; // 0x143 (1)
	char pad_144_0 : 4; // 0x144 (1)
	char bOverride_MaxDesiredWidth : 1; // 0x150 (1)
	char pad_144_5 : 3; // 0x144 (1)
	char pad_145_0 : 5; // 0x145 (1)
	char bOverride_MaxDesiredHeight : 1; // 0x150 (1)
	char pad_145_6 : 2; // 0x145 (1)
	char pad_146_0 : 6; // 0x146 (1)
	char bOverride_MinAspectRatio : 1; // 0x150 (1)
	char pad_146_7 : 1; // 0x146 (1)
	char pad_147_0 : 7; // 0x147 (1)
	char bOverride_MaxAspectRatio : 1; // 0x150 (1)

	void SetWidthOverride(float InWidthOverride); // Function UMG.SizeBox.SetWidthOverride(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A06940>
	void SetMinDesiredWidth(float InMinDesiredWidth); // Function UMG.SizeBox.SetMinDesiredWidth(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05F30>
	void SetMinDesiredHeight(float InMinDesiredHeight); // Function UMG.SizeBox.SetMinDesiredHeight(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05EB0>
	void SetMinAspectRatio(float InMinAspectRatio); // Function UMG.SizeBox.SetMinAspectRatio(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05E30>
	void SetMaxDesiredWidth(float InMaxDesiredWidth); // Function UMG.SizeBox.SetMaxDesiredWidth(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05DB0>
	void SetMaxDesiredHeight(float InMaxDesiredHeight); // Function UMG.SizeBox.SetMaxDesiredHeight(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05D30>
	void SetMaxAspectRatio(float InMaxAspectRatio); // Function UMG.SizeBox.SetMaxAspectRatio(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05CB0>
	void SetHeightOverride(float InHeightOverride); // Function UMG.SizeBox.SetHeightOverride(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05AA0>
	void ClearWidthOverride(); // Function UMG.SizeBox.ClearWidthOverride(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A04920>
	void ClearMinDesiredWidth(); // Function UMG.SizeBox.ClearMinDesiredWidth(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A04900>
	void ClearMinDesiredHeight(); // Function UMG.SizeBox.ClearMinDesiredHeight(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A048E0>
	void ClearMinAspectRatio(); // Function UMG.SizeBox.ClearMinAspectRatio(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A048C0>
	void ClearMaxDesiredWidth(); // Function UMG.SizeBox.ClearMaxDesiredWidth(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A048A0>
	void ClearMaxDesiredHeight(); // Function UMG.SizeBox.ClearMaxDesiredHeight(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A04880>
	void ClearMaxAspectRatio(); // Function UMG.SizeBox.ClearMaxAspectRatio(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A04860>
	void ClearHeightOverride(); // Function UMG.SizeBox.ClearHeightOverride(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A04840>
};

// Class UMG.SizeBoxSlot
class USizeBoxSlot : public UPanelSlot {

public:

	struct FMargin Padding; // 0x38 (16)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x58 (1)
	enum class EVerticalAlignment VerticalAlignment; // 0x59 (1)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.SizeBoxSlot.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A06840>
	void SetPadding(struct FMargin InPadding); // Function UMG.SizeBoxSlot.SetPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A06150>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.SizeBoxSlot.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A05BA0>
};

// Class UMG.SlateVectorArtData
class USlateVectorArtData : public Object {

public:

	struct TArray<struct FSlateMeshVertex> VertexData; // 0x28 (16)
	struct TArray<uint32_t> IndexData; // 0x38 (16)
	struct UMaterialInterface Material; // 0x48 (8)
	struct FVector2D ExtentMin; // 0x50 (8)
	struct FVector2D ExtentMax; // 0x58 (8)
};

// Class UMG.SlateAccessibleWidgetData
class USlateAccessibleWidgetData : public Object {

public:

	bool bCanChildrenBeAccessible; // 0x28 (1)
	enum class ESlateAccessibleBehavior AccessibleBehavior; // 0x29 (1)
	enum class ESlateAccessibleBehavior AccessibleSummaryBehavior; // 0x2A (1)
	struct FText AccessibleText; // 0x30 (24)
	struct FDelegate AccessibleTextDelegate; // 0x48 (16)
	struct FText AccessibleSummaryText; // 0x58 (24)
	struct FDelegate AccessibleSummaryTextDelegate; // 0x70 (16)
};

// Class UMG.Spacer
class USpacer : public UWidget {

public:

	struct FVector2D Size; // 0x108 (8)

	void SetSize(struct FVector2D InSize); // Function UMG.Spacer.SetSize(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A4C0>
};

// Class UMG.SpinBox
class USpinBox : public UWidget {

public:

	float Value; // 0x108 (4)
	struct FDelegate ValueDelegate; // 0x10C (16)
	struct FSpinBoxStyle WidgetStyle; // 0x120 (744)
	struct USlateWidgetStyleAsset Style; // 0x408 (8)
	int32_t MinFractionalDigits; // 0x410 (4)
	int32_t MaxFractionalDigits; // 0x414 (4)
	bool bAlwaysUsesDeltaSnap; // 0x418 (1)
	float Delta; // 0x41C (4)
	float SliderExponent; // 0x420 (4)
	struct FSlateFontInfo Font; // 0x428 (80)
	enum class ETextJustify Justification; // 0x478 (1)
	float MinDesiredWidth; // 0x47C (4)
	bool ClearKeyboardFocusOnCommit; // 0x480 (1)
	bool SelectAllTextOnCommit; // 0x481 (1)
	struct FSlateColor ForegroundColor; // 0x488 (40)
	struct FMulticastInlineDelegate OnValueChanged; // 0x4B0 (16)
	struct FMulticastInlineDelegate OnValueCommitted; // 0x4C0 (16)
	struct FMulticastInlineDelegate OnBeginSliderMovement; // 0x4D0 (16)
	struct FMulticastInlineDelegate OnEndSliderMovement; // 0x4E0 (16)
	char bOverride_MinValue : 1; // 0x4F0 (1)
	char pad_4DC_1 : 7; // 0x4DC (1)
	char pad_4DD_0 : 1; // 0x4DD (1)
	char bOverride_MaxValue : 1; // 0x4F0 (1)
	char pad_4DD_2 : 6; // 0x4DD (1)
	char pad_4DE_0 : 2; // 0x4DE (1)
	char bOverride_MinSliderValue : 1; // 0x4F0 (1)
	char pad_4DE_3 : 5; // 0x4DE (1)
	char pad_4DF_0 : 3; // 0x4DF (1)
	char bOverride_MaxSliderValue : 1; // 0x4F0 (1)
	char pad_4DF_4 : 4; // 0x4DF (1)
	float MinValue; // 0x4F4 (4)
	float MaxValue; // 0x4F8 (4)
	float MinSliderValue; // 0x4FC (4)
	float MaxSliderValue; // 0x500 (4)

	void SetValue(float NewValue); // Function UMG.SpinBox.SetValue(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A9A0>
	void SetMinValue(float NewValue); // Function UMG.SpinBox.SetMinValue(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A240>
	void SetMinSliderValue(float NewValue); // Function UMG.SpinBox.SetMinSliderValue(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A140>
	void SetMinFractionalDigits(int32_t NewValue); // Function UMG.SpinBox.SetMinFractionalDigits(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A0C0>
	void SetMaxValue(float NewValue); // Function UMG.SpinBox.SetMaxValue(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09FC0>
	void SetMaxSliderValue(float NewValue); // Function UMG.SpinBox.SetMaxSliderValue(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09EC0>
	void SetMaxFractionalDigits(int32_t NewValue); // Function UMG.SpinBox.SetMaxFractionalDigits(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09E40>
	void SetForegroundColor(struct FSlateColor InForegroundColor); // Function UMG.SpinBox.SetForegroundColor(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09AE0>
	void SetDelta(float NewValue); // Function UMG.SpinBox.SetDelta(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09830>
	void SetAlwaysUsesDeltaSnap(bool bNewValue); // Function UMG.SpinBox.SetAlwaysUsesDeltaSnap(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09470>
	void OnSpinBoxValueCommittedEvent__DelegateSignature(float InValue, enum class ETextCommit CommitMethod); // DelegateFunction UMG.SpinBox.OnSpinBoxValueCommittedEvent__DelegateSignature(MulticastDelegate|Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnSpinBoxValueChangedEvent__DelegateSignature(float InValue); // DelegateFunction UMG.SpinBox.OnSpinBoxValueChangedEvent__DelegateSignature(MulticastDelegate|Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	void OnSpinBoxBeginSliderMovement__DelegateSignature(); // DelegateFunction UMG.SpinBox.OnSpinBoxBeginSliderMovement__DelegateSignature(MulticastDelegate|Public|Delegate) // <VeiledExperts-Win64-Shipping.exe+0x1B72D40>
	float GetValue(); // Function UMG.SpinBox.GetValue(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A09440>
	float GetMinValue(); // Function UMG.SpinBox.GetMinValue(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A091F0>
	float GetMinSliderValue(); // Function UMG.SpinBox.GetMinSliderValue(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A091C0>
	int32_t GetMinFractionalDigits(); // Function UMG.SpinBox.GetMinFractionalDigits(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A09190>
	float GetMaxValue(); // Function UMG.SpinBox.GetMaxValue(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A09160>
	float GetMaxSliderValue(); // Function UMG.SpinBox.GetMaxSliderValue(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A09130>
	int32_t GetMaxFractionalDigits(); // Function UMG.SpinBox.GetMaxFractionalDigits(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A09100>
	float GetDelta(); // Function UMG.SpinBox.GetDelta(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A09070>
	bool GetAlwaysUsesDeltaSnap(); // Function UMG.SpinBox.GetAlwaysUsesDeltaSnap(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A09040>
	void ClearMinValue(); // Function UMG.SpinBox.ClearMinValue(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A08FE0>
	void ClearMinSliderValue(); // Function UMG.SpinBox.ClearMinSliderValue(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A08FC0>
	void ClearMaxValue(); // Function UMG.SpinBox.ClearMaxValue(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A08FA0>
	void ClearMaxSliderValue(); // Function UMG.SpinBox.ClearMaxSliderValue(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A08F80>
};

// Class UMG.Throbber
class UThrobber : public UWidget {

public:

	int32_t NumberOfPieces; // 0x108 (4)
	bool bAnimateHorizontally; // 0x10C (1)
	bool bAnimateVertically; // 0x10D (1)
	bool bAnimateOpacity; // 0x10E (1)
	struct USlateBrushAsset PieceImage; // 0x110 (8)
	struct FSlateBrush Image; // 0x118 (136)

	void SetNumberOfPieces(int32_t InNumberOfPieces); // Function UMG.Throbber.SetNumberOfPieces(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0A2C0>
	void SetAnimateVertically(bool bInAnimateVertically); // Function UMG.Throbber.SetAnimateVertically(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09620>
	void SetAnimateOpacity(bool bInAnimateOpacity); // Function UMG.Throbber.SetAnimateOpacity(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09590>
	void SetAnimateHorizontally(bool bInAnimateHorizontally); // Function UMG.Throbber.SetAnimateHorizontally(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09500>
};

// Class UMG.TileView
class UTileView : public UListView {

public:

	float EntryHeight; // 0x368 (4)
	float EntryWidth; // 0x36C (4)
	enum class EListItemAlignment TileAlignment; // 0x370 (1)
	bool bWrapHorizontalNavigation; // 0x371 (1)

	void SetEntryWidth(float NewWidth); // Function UMG.TileView.SetEntryWidth(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09930>
	void SetEntryHeight(float NewHeight); // Function UMG.TileView.SetEntryHeight(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A098B0>
};

// Class UMG.TreeView
class UTreeView : public UListView {

public:

	struct FDelegate BP_OnGetItemChildren; // 0x378 (16)
	struct FMulticastInlineDelegate BP_OnItemExpansionChanged; // 0x388 (16)

	void SetItemExpansion(struct Object Item, bool bExpandItem); // Function UMG.TreeView.SetItemExpansion(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09C60>
	void ExpandAll(); // Function UMG.TreeView.ExpandAll(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09020>
	void CollapseAll(); // Function UMG.TreeView.CollapseAll(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A09000>
};

// Class UMG.UMGSequencePlayer
class UUMGSequencePlayer : public Object {

public:

	struct UWidgetAnimation Animation; // 0x408 (8)

	void SetUserTag(struct FName InUserTag); // Function UMG.UMGSequencePlayer.SetUserTag(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A106C0>
	struct FName GetUserTag(); // Function UMG.UMGSequencePlayer.GetUserTag(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A0EFC0>
};

// Class UMG.UniformGridPanel
class UUniformGridPanel : public UPanelWidget {

public:

	struct FMargin SlotPadding; // 0x120 (16)
	float MinDesiredSlotWidth; // 0x130 (4)
	float MinDesiredSlotHeight; // 0x134 (4)

	void SetSlotPadding(struct FMargin InSlotPadding); // Function UMG.UniformGridPanel.SetSlotPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A10630>
	void SetMinDesiredSlotWidth(float InMinDesiredSlotWidth); // Function UMG.UniformGridPanel.SetMinDesiredSlotWidth(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A101D0>
	void SetMinDesiredSlotHeight(float InMinDesiredSlotHeight); // Function UMG.UniformGridPanel.SetMinDesiredSlotHeight(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A10150>
	struct UUniformGridSlot AddChildToUniformGrid(struct UWidget Content, int32_t InRow, int32_t InColumn); // Function UMG.UniformGridPanel.AddChildToUniformGrid(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0E8E0>
};

// Class UMG.UniformGridSlot
class UUniformGridSlot : public UPanelSlot {

public:

	enum class EHorizontalAlignment HorizontalAlignment; // 0x38 (1)
	enum class EVerticalAlignment VerticalAlignment; // 0x39 (1)
	int32_t Row; // 0x3C (4)
	int32_t Column; // 0x40 (4)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.UniformGridSlot.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A10740>
	void SetRow(int32_t InRow); // Function UMG.UniformGridSlot.SetRow(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A105B0>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.UniformGridSlot.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0FFC0>
	void SetColumn(int32_t InColumn); // Function UMG.UniformGridSlot.SetColumn(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A0FDD0>
};

// Class UMG.VerticalBoxSlot
class UVerticalBoxSlot : public UPanelSlot {

public:

	struct FSlateChildSize Size; // 0x38 (8)
	struct FMargin Padding; // 0x40 (16)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x58 (1)
	enum class EVerticalAlignment VerticalAlignment; // 0x59 (1)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.VerticalBoxSlot.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A140F0>
	void SetSize(struct FSlateChildSize InSize); // Function UMG.VerticalBoxSlot.SetSize(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13E90>
	void SetPadding(struct FMargin InPadding); // Function UMG.VerticalBoxSlot.SetPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A13A20>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.VerticalBoxSlot.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A134A0>
};

// Class UMG.Viewport
class UViewport : public UContentWidget {

public:

	struct FLinearColor BackgroundColor; // 0x120 (16)

	struct UActor Spawn(struct UClass* ActorClass); // Function UMG.Viewport.Spawn(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A14310>
	void SetViewRotation(struct FRotator Rotation); // Function UMG.Viewport.SetViewRotation(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A14200>
	void SetViewLocation(struct FVector Location); // Function UMG.Viewport.SetViewLocation(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A14170>
	struct FRotator GetViewRotation(); // Function UMG.Viewport.GetViewRotation(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12EF0>
	struct UWorld GetViewportWorld(); // Function UMG.Viewport.GetViewportWorld(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12F30>
	struct FVector GetViewLocation(); // Function UMG.Viewport.GetViewLocation(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12EB0>
};

// Class UMG.WidgetAnimation
class UWidgetAnimation : public UMovieSceneSequence {

public:

	struct UMovieScene MovieScene; // 0x348 (8)
	struct TArray<struct FWidgetAnimationBinding> AnimationBindings; // 0x350 (16)
	bool bLegacyFinishOnStop; // 0x360 (1)
	struct FString DisplayLabel; // 0x368 (16)

	void UnbindFromAnimationStarted(struct UUserWidget Widget, struct FDelegate Delegate); // Function UMG.WidgetAnimation.UnbindFromAnimationStarted(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A14580>
	void UnbindFromAnimationFinished(struct UUserWidget Widget, struct FDelegate Delegate); // Function UMG.WidgetAnimation.UnbindFromAnimationFinished(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A144A0>
	void UnbindAllFromAnimationStarted(struct UUserWidget Widget); // Function UMG.WidgetAnimation.UnbindAllFromAnimationStarted(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A14420>
	void UnbindAllFromAnimationFinished(struct UUserWidget Widget); // Function UMG.WidgetAnimation.UnbindAllFromAnimationFinished(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A143A0>
	float GetStartTime(); // Function UMG.WidgetAnimation.GetStartTime(Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12E10>
	float GetEndTime(); // Function UMG.WidgetAnimation.GetEndTime(Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A12C50>
	void BindToAnimationStarted(struct UUserWidget Widget, struct FDelegate Delegate); // Function UMG.WidgetAnimation.BindToAnimationStarted(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A12A10>
	void BindToAnimationFinished(struct UUserWidget Widget, struct FDelegate Delegate); // Function UMG.WidgetAnimation.BindToAnimationFinished(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A12930>
};

// Class UMG.WidgetAnimationDelegateBinding
class UWidgetAnimationDelegateBinding : public UDynamicBlueprintBinding {

public:

	struct TArray<struct FBlueprintWidgetAnimationDelegateBinding> WidgetAnimationDelegateBindings; // 0x28 (16)
};

// Class UMG.WidgetAnimationPlayCallbackProxy
class UWidgetAnimationPlayCallbackProxy : public Object {

public:

	struct FMulticastInlineDelegate Finished; // 0x28 (16)

	struct UWidgetAnimationPlayCallbackProxy CreatePlayAnimationTimeRangeProxyObject(struct UUMGSequencePlayer& Result, struct UUserWidget Widget, struct UWidgetAnimation InAnimation, float StartAtTime, float EndAtTime, int32_t NumLoopsToPlay, enum class EUMGSequencePlayMode PlayMode, float PlaybackSpeed); // Function UMG.WidgetAnimationPlayCallbackProxy.CreatePlayAnimationTimeRangeProxyObject(Final|Native|Static|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A16570>
	struct UWidgetAnimationPlayCallbackProxy CreatePlayAnimationProxyObject(struct UUMGSequencePlayer& Result, struct UUserWidget Widget, struct UWidgetAnimation InAnimation, float StartAtTime, int32_t NumLoopsToPlay, enum class EUMGSequencePlayMode PlayMode, float PlaybackSpeed); // Function UMG.WidgetAnimationPlayCallbackProxy.CreatePlayAnimationProxyObject(Final|Native|Static|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A16370>
};

// Class UMG.WidgetBlueprintGeneratedClass
class UWidgetBlueprintGeneratedClass : public UBlueprintGeneratedClass {

public:

	struct UWidgetTree WidgetTree; // 0x328 (8)
	char bAllowTemplate : 1; // 0x330 (1)
	char bAllowDynamicCreation : 1; // 0x330 (1)
	char bValidTemplate : 1; // 0x330 (1)
	char bTemplateInitialized : 1; // 0x330 (1)
	char bCookedTemplate : 1; // 0x330 (1)
	char bClassRequiresNativeTick : 1; // 0x330 (1)
	char pad_330_6 : 2; // 0x330 (1)
	struct TArray<struct FDelegateRuntimeBinding> Bindings; // 0x338 (16)
	struct TArray<struct UWidgetAnimation> Animations; // 0x348 (16)
	struct TArray<struct FName> NamedSlots; // 0x358 (16)
	struct TSoftObjectPtr<UUserWidget> TemplateAsset; // 0x368 (40)
	struct UUserWidget Template; // 0x390 (8)
};

// Class UMG.WidgetComponent
class UWidgetComponent : public UMeshComponent {

public:

	enum class EWidgetSpace Space; // 0x430 (1)
	enum class EWidgetTimingPolicy TimingPolicy; // 0x431 (1)
	struct UClass* WidgetClass; // 0x438 (8)
	struct FIntPoint DrawSize; // 0x440 (8)
	bool bManuallyRedraw; // 0x448 (1)
	bool bRedrawRequested; // 0x449 (1)
	float RedrawTime; // 0x44C (4)
	struct FIntPoint CurrentDrawSize; // 0x458 (8)
	bool bDrawAtDesiredSize; // 0x460 (1)
	struct FVector2D Pivot; // 0x464 (8)
	bool bReceiveHardwareInput; // 0x46C (1)
	bool bWindowFocusable; // 0x46D (1)
	enum class EWindowVisibility WindowVisibility; // 0x46E (1)
	bool bApplyGammaCorrection; // 0x46F (1)
	struct ULocalPlayer OwnerPlayer; // 0x470 (8)
	struct FLinearColor BackgroundColor; // 0x478 (16)
	struct FLinearColor TintColorAndOpacity; // 0x488 (16)
	float OpacityFromTexture; // 0x498 (4)
	enum class EWidgetBlendMode BlendMode; // 0x49C (1)
	bool bIsTwoSided; // 0x49D (1)
	bool TickWhenOffscreen; // 0x49E (1)
	struct UUserWidget Widget; // 0x4A0 (8)
	struct UBodySetup BodySetup; // 0x4C8 (8)
	struct UMaterialInterface TranslucentMaterial; // 0x4D0 (8)
	struct UMaterialInterface TranslucentMaterial_OneSided; // 0x4D8 (8)
	struct UMaterialInterface OpaqueMaterial; // 0x4E0 (8)
	struct UMaterialInterface OpaqueMaterial_OneSided; // 0x4E8 (8)
	struct UMaterialInterface MaskedMaterial; // 0x4F0 (8)
	struct UMaterialInterface MaskedMaterial_OneSided; // 0x4F8 (8)
	struct UTextureRenderTarget2D RenderTarget; // 0x500 (8)
	struct UMaterialInstanceDynamic MaterialInstance; // 0x508 (8)
	bool bAddedToScreen; // 0x510 (1)
	bool bEditTimeUsable; // 0x511 (1)
	struct FName SharedLayerName; // 0x514 (8)
	int32_t LayerZOrder; // 0x51C (4)
	enum class EWidgetGeometryMode GeometryMode; // 0x520 (1)
	float CylinderArcAngle; // 0x524 (4)

	void SetWindowVisibility(enum class EWindowVisibility InVisibility); // Function UMG.WidgetComponent.SetWindowVisibility(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1D320>
	void SetWindowFocusable(bool bInWindowFocusable); // Function UMG.WidgetComponent.SetWindowFocusable(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1D290>
	void SetWidgetSpace(enum class EWidgetSpace NewSpace); // Function UMG.WidgetComponent.SetWidgetSpace(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1D210>
	void SetWidget(struct UUserWidget Widget); // Function UMG.WidgetComponent.SetWidget(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1D180>
	void SetTwoSided(bool bWantTwoSided); // Function UMG.WidgetComponent.SetTwoSided(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1D0F0>
	void SetTintColorAndOpacity(struct FLinearColor NewTintColorAndOpacity); // Function UMG.WidgetComponent.SetTintColorAndOpacity(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1D070>
	void SetTickWhenOffscreen(bool bWantTickWhenOffscreen); // Function UMG.WidgetComponent.SetTickWhenOffscreen(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1CFF0>
	void SetRedrawTime(float InRedrawTime); // Function UMG.WidgetComponent.SetRedrawTime(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1CF70>
	void SetPivot(struct FVector2D& InPivot); // Function UMG.WidgetComponent.SetPivot(Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1CEE0>
	void SetOwnerPlayer(struct ULocalPlayer LocalPlayer); // Function UMG.WidgetComponent.SetOwnerPlayer(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1CE60>
	void SetManuallyRedraw(bool bUseManualRedraw); // Function UMG.WidgetComponent.SetManuallyRedraw(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1CDD0>
	void SetGeometryMode(enum class EWidgetGeometryMode InGeometryMode); // Function UMG.WidgetComponent.SetGeometryMode(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1CD50>
	void SetDrawSize(struct FVector2D Size); // Function UMG.WidgetComponent.SetDrawSize(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1CC50>
	void SetDrawAtDesiredSize(bool bInDrawAtDesiredSize); // Function UMG.WidgetComponent.SetDrawAtDesiredSize(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1CBD0>
	void SetCylinderArcAngle(float InCylinderArcAngle); // Function UMG.WidgetComponent.SetCylinderArcAngle(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1CB50>
	void SetBackgroundColor(struct FLinearColor NewBackgroundColor); // Function UMG.WidgetComponent.SetBackgroundColor(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1CA10>
	void RequestRedraw(); // Function UMG.WidgetComponent.RequestRedraw(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1C830>
	enum class EWindowVisibility GetWindowVisiblility(); // Function UMG.WidgetComponent.GetWindowVisiblility(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1C0B0>
	bool GetWindowFocusable(); // Function UMG.WidgetComponent.GetWindowFocusable(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1C090>
	enum class EWidgetSpace GetWidgetSpace(); // Function UMG.WidgetComponent.GetWidgetSpace(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1C070>
	struct UUserWidget GetUserWidgetObject(); // Function UMG.WidgetComponent.GetUserWidgetObject(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1BE70>
	bool GetTwoSided(); // Function UMG.WidgetComponent.GetTwoSided(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1BE50>
	bool GetTickWhenOffscreen(); // Function UMG.WidgetComponent.GetTickWhenOffscreen(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1BE30>
	struct UTextureRenderTarget2D GetRenderTarget(); // Function UMG.WidgetComponent.GetRenderTarget(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1BE00>
	float GetRedrawTime(); // Function UMG.WidgetComponent.GetRedrawTime(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1BDE0>
	struct FVector2D GetPivot(); // Function UMG.WidgetComponent.GetPivot(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1BD00>
	struct ULocalPlayer GetOwnerPlayer(); // Function UMG.WidgetComponent.GetOwnerPlayer(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1BCD0>
	struct UMaterialInstanceDynamic GetMaterialInstance(); // Function UMG.WidgetComponent.GetMaterialInstance(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1BAB0>
	bool GetManuallyRedraw(); // Function UMG.WidgetComponent.GetManuallyRedraw(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x25FB4A0>
	enum class EWidgetGeometryMode GetGeometryMode(); // Function UMG.WidgetComponent.GetGeometryMode(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1B9E0>
	struct FVector2D GetDrawSize(); // Function UMG.WidgetComponent.GetDrawSize(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1B9A0>
	bool GetDrawAtDesiredSize(); // Function UMG.WidgetComponent.GetDrawAtDesiredSize(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1B980>
	float GetCylinderArcAngle(); // Function UMG.WidgetComponent.GetCylinderArcAngle(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1B960>
	struct FVector2D GetCurrentDrawSize(); // Function UMG.WidgetComponent.GetCurrentDrawSize(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1B920>
};

// Class UMG.WidgetInteractionComponent
class UWidgetInteractionComponent : public USceneComponent {

public:

	struct FMulticastInlineDelegate OnHoveredWidgetChanged; // 0x1F0 (16)
	int32_t VirtualUserIndex; // 0x210 (4)
	float PointerIndex; // 0x214 (4)
	enum class ECollisionChannel TraceChannel; // 0x218 (1)
	float InteractionDistance; // 0x21C (4)
	enum class EWidgetInteractionSource InteractionSource; // 0x220 (1)
	bool bEnableHitTesting; // 0x221 (1)
	bool bShowDebug; // 0x222 (1)
	struct FLinearColor DebugColor; // 0x224 (16)
	struct FHitResult CustomHitResult; // 0x2B0 (136)
	struct FVector2D LocalHitLocation; // 0x338 (8)
	struct FVector2D LastLocalHitLocation; // 0x340 (8)
	struct UWidgetComponent HoveredWidgetComponent; // 0x348 (8)
	struct FHitResult LastHitResult; // 0x350 (136)
	bool bIsHoveredWidgetInteractable; // 0x3D8 (1)
	bool bIsHoveredWidgetFocusable; // 0x3D9 (1)
	bool bIsHoveredWidgetHitTestVisible; // 0x3DA (1)

	void SetFocus(struct UWidget FocusWidget); // Function UMG.WidgetInteractionComponent.SetFocus(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1CCD0>
	void SetCustomHitResult(struct FHitResult& HitResult); // Function UMG.WidgetInteractionComponent.SetCustomHitResult(Final|Native|Public|HasOutParms|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1CA90>
	bool SendKeyChar(struct FString Characters, bool bRepeat); // Function UMG.WidgetInteractionComponent.SendKeyChar(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1C8D0>
	void ScrollWheel(float ScrollDelta); // Function UMG.WidgetInteractionComponent.ScrollWheel(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1C850>
	void ReleasePointerKey(struct FKey Key); // Function UMG.WidgetInteractionComponent.ReleasePointerKey(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1C6E0>
	bool ReleaseKey(struct FKey Key); // Function UMG.WidgetInteractionComponent.ReleaseKey(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1C5E0>
	void PressPointerKey(struct FKey Key); // Function UMG.WidgetInteractionComponent.PressPointerKey(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1C3A0>
	bool PressKey(struct FKey Key, bool bRepeat); // Function UMG.WidgetInteractionComponent.PressKey(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1C260>
	bool PressAndReleaseKey(struct FKey Key); // Function UMG.WidgetInteractionComponent.PressAndReleaseKey(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1C160>
	bool IsOverInteractableWidget(); // Function UMG.WidgetInteractionComponent.IsOverInteractableWidget(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1C130>
	bool IsOverHitTestVisibleWidget(); // Function UMG.WidgetInteractionComponent.IsOverHitTestVisibleWidget(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1C100>
	bool IsOverFocusableWidget(); // Function UMG.WidgetInteractionComponent.IsOverFocusableWidget(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1C0D0>
	struct FHitResult GetLastHitResult(); // Function UMG.WidgetInteractionComponent.GetLastHitResult(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1BA30>
	struct UWidgetComponent GetHoveredWidgetComponent(); // Function UMG.WidgetInteractionComponent.GetHoveredWidgetComponent(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1BA00>
	struct FVector2D Get2DHitLocation(); // Function UMG.WidgetInteractionComponent.Get2DHitLocation(Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1B8E0>
};

// Class UMG.WidgetNavigation
class UWidgetNavigation : public Object {

public:

	struct FWidgetNavigationData Up; // 0x28 (36)
	struct FWidgetNavigationData Down; // 0x4C (36)
	struct FWidgetNavigationData Left; // 0x70 (36)
	struct FWidgetNavigationData Right; // 0x94 (36)
	struct FWidgetNavigationData Next; // 0xB8 (36)
	struct FWidgetNavigationData Previous; // 0xDC (36)
};

// Class UMG.WidgetSwitcher
class UWidgetSwitcher : public UPanelWidget {

public:

	int32_t ActiveWidgetIndex; // 0x120 (4)

	void SetActiveWidgetIndex(int32_t Index); // Function UMG.WidgetSwitcher.SetActiveWidgetIndex(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1ECC0>
	void SetActiveWidget(struct UWidget Widget); // Function UMG.WidgetSwitcher.SetActiveWidget(Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x29FC3B0>
	struct UWidget GetWidgetAtIndex(int32_t Index); // Function UMG.WidgetSwitcher.GetWidgetAtIndex(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1EC30>
	int32_t GetNumWidgets(); // Function UMG.WidgetSwitcher.GetNumWidgets(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1EC00>
	int32_t GetActiveWidgetIndex(); // Function UMG.WidgetSwitcher.GetActiveWidgetIndex(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1EBD0>
	struct UWidget GetActiveWidget(); // Function UMG.WidgetSwitcher.GetActiveWidget(Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // <VeiledExperts-Win64-Shipping.exe+0x2A1EBA0>
};

// Class UMG.WidgetSwitcherSlot
class UWidgetSwitcherSlot : public UPanelSlot {

public:

	struct FMargin Padding; // 0x40 (16)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x50 (1)
	enum class EVerticalAlignment VerticalAlignment; // 0x51 (1)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.WidgetSwitcherSlot.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1F290>
	void SetPadding(struct FMargin InPadding); // Function UMG.WidgetSwitcherSlot.SetPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A01DF0>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.WidgetSwitcherSlot.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1EE60>
};

// Class UMG.WidgetTree
class UWidgetTree : public Object {

public:

	struct UWidget RootWidget; // 0x28 (8)
};

// Class UMG.WindowTitleBarArea
class UWindowTitleBarArea : public UContentWidget {

public:

	bool bWindowButtonsEnabled; // 0x120 (1)
	bool bDoubleClickTogglesFullscreen; // 0x121 (1)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.WindowTitleBarArea.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1F310>
	void SetPadding(struct FMargin InPadding); // Function UMG.WindowTitleBarArea.SetPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1F0E0>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.WindowTitleBarArea.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1EEE0>
};

// Class UMG.WindowTitleBarAreaSlot
class UWindowTitleBarAreaSlot : public UPanelSlot {

public:

	struct FMargin Padding; // 0x38 (16)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x48 (1)
	enum class EVerticalAlignment VerticalAlignment; // 0x49 (1)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.WindowTitleBarAreaSlot.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1F390>
	void SetPadding(struct FMargin InPadding); // Function UMG.WindowTitleBarAreaSlot.SetPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1F170>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.WindowTitleBarAreaSlot.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1EF60>
};

// Class UMG.WrapBox
class UWrapBox : public UPanelWidget {

public:

	struct FVector2D InnerSlotPadding; // 0x120 (8)
	float WrapWidth; // 0x128 (4)
	bool bExplicitWrapWidth; // 0x12C (1)

	void SetInnerSlotPadding(struct FVector2D InPadding); // Function UMG.WrapBox.SetInnerSlotPadding(Final|Native|Public|HasDefaults|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1F060>
	struct UWrapBoxSlot AddChildToWrapBox(struct UWidget Content); // Function UMG.WrapBox.AddChildToWrapBox(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1EB10>
};

// Class UMG.WrapBoxSlot
class UWrapBoxSlot : public UPanelSlot {

public:

	struct FMargin Padding; // 0x38 (16)
	bool bFillEmptySpace; // 0x48 (1)
	float FillSpanWhenLessThan; // 0x4C (4)
	enum class EHorizontalAlignment HorizontalAlignment; // 0x50 (1)
	enum class EVerticalAlignment VerticalAlignment; // 0x51 (1)

	void SetVerticalAlignment(enum class EVerticalAlignment InVerticalAlignment); // Function UMG.WrapBoxSlot.SetVerticalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1F410>
	void SetPadding(struct FMargin InPadding); // Function UMG.WrapBoxSlot.SetPadding(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1F200>
	void SetHorizontalAlignment(enum class EHorizontalAlignment InHorizontalAlignment); // Function UMG.WrapBoxSlot.SetHorizontalAlignment(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1EFE0>
	void SetFillSpanWhenLessThan(float InFillSpanWhenLessThan); // Function UMG.WrapBoxSlot.SetFillSpanWhenLessThan(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1EDE0>
	void SetFillEmptySpace(bool InbFillEmptySpace); // Function UMG.WrapBoxSlot.SetFillEmptySpace(Final|Native|Public|BlueprintCallable) // <VeiledExperts-Win64-Shipping.exe+0x2A1ED50>
};

// ScriptStruct UMG.WidgetTransform
struct FWidgetTransform {
	struct FVector2D Translation; // 0x0 (8)
	struct FVector2D Scale; // 0x8 (8)
	struct FVector2D Shear; // 0x10 (8)
	float Angle; // 0x18 (4)
};

// ScriptStruct UMG.ShapedTextOptions
struct FShapedTextOptions {
	char bOverride_TextShapingMethod : 1; // 0x0 (1)
	char bOverride_TextFlowDirection : 1; // 0x0 (1)
	char pad_0_2 : 6; // 0x0 (1)
	enum class ETextShapingMethod TextShapingMethod; // 0x1 (1)
	enum class ETextFlowDirection TextFlowDirection; // 0x2 (1)
};

// ScriptStruct UMG.AnchorData
struct FAnchorData {
	struct FMargin Offsets; // 0x0 (16)
	struct FAnchors Anchors; // 0x10 (16)
	struct FVector2D Alignment; // 0x20 (8)
};

// ScriptStruct UMG.MovieScene2DTransformMask
struct FMovieScene2DTransformMask {
	uint32_t Mask; // 0x0 (4)
};

// ScriptStruct UMG.MovieScene2DTransformSectionTemplate
struct FMovieScene2DTransformSectionTemplate : FMovieScenePropertySectionTemplate {
	struct FMovieSceneFloatChannel Translation[0x2]; // 0x48 (320)
	struct FMovieSceneFloatChannel Rotation; // 0x188 (160)
	struct FMovieSceneFloatChannel Scale[0x2]; // 0x228 (320)
	struct FMovieSceneFloatChannel Shear[0x2]; // 0x368 (320)
	enum class EMovieSceneBlendType BlendType; // 0x4A8 (1)
	struct FMovieScene2DTransformMask Mask; // 0x4AC (4)
};

// ScriptStruct UMG.MovieSceneMarginSectionTemplate
struct FMovieSceneMarginSectionTemplate : FMovieScenePropertySectionTemplate {
	struct FMovieSceneFloatChannel TopCurve; // 0x48 (160)
	struct FMovieSceneFloatChannel LeftCurve; // 0xE8 (160)
	struct FMovieSceneFloatChannel RightCurve; // 0x188 (160)
	struct FMovieSceneFloatChannel BottomCurve; // 0x228 (160)
	enum class EMovieSceneBlendType BlendType; // 0x2C8 (1)
};

// ScriptStruct UMG.MovieSceneWidgetMaterialSectionTemplate
struct FMovieSceneWidgetMaterialSectionTemplate : FMovieSceneParameterSectionTemplate {
	struct TArray<struct FName> BrushPropertyNamePath; // 0x80 (16)
};

// ScriptStruct UMG.RichTextStyleRow
struct FRichTextStyleRow : FTableRowBase {
	struct FTextBlockStyle TextStyle; // 0x8 (616)
};

// ScriptStruct UMG.RichImageRow
struct FRichImageRow : FTableRowBase {
	struct FSlateBrush Brush; // 0x8 (136)
};

// ScriptStruct UMG.SlateMeshVertex
struct FSlateMeshVertex {
	struct FVector2D Position; // 0x0 (8)
	struct FColor Color; // 0x8 (4)
	struct FVector2D UV0; // 0xC (8)
	struct FVector2D UV1; // 0x14 (8)
	struct FVector2D UV2; // 0x1C (8)
	struct FVector2D UV3; // 0x24 (8)
	struct FVector2D UV4; // 0x2C (8)
	struct FVector2D UV5; // 0x34 (8)
};

// ScriptStruct UMG.SlateChildSize
struct FSlateChildSize {
	float Value; // 0x0 (4)
	enum class ESlateSizeRule SizeRule; // 0x4 (1)
};

// ScriptStruct UMG.NamedSlotBinding
struct FNamedSlotBinding {
	struct FName Name; // 0x0 (8)
	struct UWidget Content; // 0x8 (8)
};

// ScriptStruct UMG.AnimationEventBinding
struct FAnimationEventBinding {
	struct UWidgetAnimation Animation; // 0x0 (8)
	struct FDelegate Delegate; // 0x8 (16)
	enum class EWidgetAnimationEvent AnimationEvent; // 0x18 (1)
	struct FName UserTag; // 0x1C (8)
};

// ScriptStruct UMG.UserWidgetPool
struct FUserWidgetPool {
	struct TArray<struct UUserWidget> ActiveWidgets; // 0x0 (16)
	struct TArray<struct UUserWidget> InactiveWidgets; // 0x10 (16)
};

// ScriptStruct UMG.WidgetAnimationBinding
struct FWidgetAnimationBinding {
	struct FName WidgetName; // 0x0 (8)
	struct FName SlotWidgetName; // 0x8 (8)
	struct FGuid AnimationGuid; // 0x10 (16)
	bool bIsRootWidget; // 0x20 (1)
};

// ScriptStruct UMG.BlueprintWidgetAnimationDelegateBinding
struct FBlueprintWidgetAnimationDelegateBinding {
	enum class EWidgetAnimationEvent Action; // 0x0 (1)
	struct FName AnimationToBind; // 0x4 (8)
	struct FName FunctionNameToBind; // 0xC (8)
	struct FName UserTag; // 0x14 (8)
};

// ScriptStruct UMG.DelegateRuntimeBinding
struct FDelegateRuntimeBinding {
	struct FString ObjectName; // 0x0 (16)
	struct FName PropertyName; // 0x10 (8)
	struct FName FunctionName; // 0x18 (8)
	struct FDynamicPropertyPath SourcePath; // 0x20 (40)
	enum class EBindingKind Kind; // 0x48 (1)
};

// ScriptStruct UMG.WidgetNavigationData
struct FWidgetNavigationData {
	enum class EUINavigationRule Rule; // 0x0 (1)
	struct FName WidgetToFocus; // 0x4 (8)
	struct TWeakObjectPtr<struct UWidget> Widget; // 0xC (8)
	struct FDelegate CustomDelegate; // 0x14 (16)
};

// Function UMG.Widget.SetVisibility
inline void UWidget::SetVisibility(enum class ESlateVisibility InVisibility) {
	static auto fn = UObject::FindObject<UFunction>("Function UMG.Widget.SetVisibility");

	struct SetVisibility_Params {
		enum class ESlateVisibility InVisibility;
	}; SetVisibility_Params Params;

	Params.InVisibility = InVisibility;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UMG.Widget.SetUserFocus
inline void UWidget::SetUserFocus(struct APlayerController PlayerController) {
	static auto fn = UObject::FindObject<UFunction>("Function UMG.Widget.SetUserFocus");

	struct SetUserFocus_Params {
		struct APlayerController PlayerController;
	}; SetUserFocus_Params Params;

	Params.PlayerController = PlayerController;

	auto flags = fn->FunctionFlags;
	UObject::ProcessEvent(fn, &Params);
	fn->FunctionFlags = flags;
}

// Function UMG.Widget.SetToolTipText
