// WidgetBlueprintGeneratedClass UnKnownMarketUpgradeTooltip.UnKnownMarketUpgradeTooltip_C
class UUnKnownMarketUpgradeTooltip_C : public UPDUnKnownMarketUpgradeTooltip {

public:

	struct UImage IMG_Bg01; // 0x360 (8)
	struct UImage IMG_Bg02; // 0x368 (8)
	struct UImage IMG_Blinder; // 0x370 (8)
	struct UImage IMG_Divider_01; // 0x378 (8)
	struct UImage IMG_Divider_02; // 0x380 (8)
	struct UImage IMG_Mouse_L; // 0x388 (8)
	struct UImage IMG_Mouse_R; // 0x390 (8)
	struct UImage IMG_MouseGuide_Bg; // 0x398 (8)
	struct UImage IMG_Outline; // 0x3A0 (8)
	struct URetainerBox RetainerBox_1; // 0x3A8 (8)
};

