// WidgetBlueprintGeneratedClass UnKnownMarketTooltip.UnKnownMarketTooltip_C
class UUnKnownMarketTooltip_C : public UPDUnKnownMarketTooltip {

public:

	struct UWidgetAnimation Show; // 0x410 (8)
	struct UImage Img_Bg; // 0x418 (8)
	struct UImage IMG_Blinder; // 0x420 (8)
	struct UImage IMG_Divider; // 0x428 (8)
	struct UImage IMG_Divider_01; // 0x430 (8)
	struct UImage IMG_Divider_02; // 0x438 (8)
	struct UImage IMG_Divider_03; // 0x440 (8)
	struct UImage IMG_Divider_04; // 0x448 (8)
	struct UImage IMG_InfoBg; // 0x450 (8)
	struct UImage IMG_InfoBg_Pattern; // 0x458 (8)
	struct UImage IMG_Mouse_L; // 0x460 (8)
	struct UImage IMG_Mouse_R; // 0x468 (8)
	struct UImage IMG_Mouse_W; // 0x470 (8)
	struct UImage IMG_Outline; // 0x478 (8)
};

