// WidgetBlueprintGeneratedClass UnKnownMarketWeaponListItem.UnKnownMarketWeaponListItem_C
class UUnKnownMarketWeaponListItem_C : public UPDUnKnownMarketListItem {

public:

	struct UWidgetAnimation Hover; // 0x4E8 (8)
	struct UImage IMG_BuyBtnBg; // 0x4F0 (8)
	struct UImage IMG_Cancel; // 0x4F8 (8)
	struct UImage IMG_EmptyBg; // 0x500 (8)
	struct UImage IMG_Lock_Bg; // 0x508 (8)
	struct UImage IMG_Owned_Bg; // 0x510 (8)
	struct UImage IMG_Sell_Bg; // 0x518 (8)
	struct UImage IMG_SoldOut_Bg; // 0x520 (8)
	struct UImage IMG_VXLogo; // 0x528 (8)
	struct URetainerBox RB_ItemSlot; // 0x530 (8)
};

