// WidgetBlueprintGeneratedClass UnKnownMarket.UnKnownMarket_C
class UUnKnownMarket_C : public UPDUnKnownMarket {

public:

	struct UWidgetAnimation Anim_TeamBuff; // 0x818 (8)
	struct UWidgetAnimation Anim_LoseCoin; // 0x820 (8)
	struct UWidgetAnimation Anim_GetCoin; // 0x828 (8)
	struct UImage IMG_CoinIcon; // 0x830 (8)
	struct UImage IMG_InvenBg; // 0x838 (8)
	struct UImage IMG_InvenDragable_Deco_01; // 0x840 (8)
	struct UImage IMG_InvenListDragable; // 0x848 (8)
	struct UImage IMG_ItemSlot_BottomLine; // 0x850 (8)
	struct UImage IMG_Market_Bg; // 0x858 (8)
	struct UImage IMG_Market_MidLine_01; // 0x860 (8)
	struct UImage IMG_Market_MidLine_02; // 0x868 (8)
	struct UImage IMG_Market_MidLine_03; // 0x870 (8)
	struct UImage IMG_Market_OutLine; // 0x878 (8)
	struct UImage IMG_Market_Shadow; // 0x880 (8)
	struct UImage IMG_Market_TopLine; // 0x888 (8)
	struct UImage IMG_MarketTabMenuBg; // 0x890 (8)
	struct UImage IMG_PickupDragable_Deco_01; // 0x898 (8)
	struct UImage IMG_PickupListDragable; // 0x8A0 (8)
	struct UImage IMG_Signature_Guide; // 0x8A8 (8)
	struct UImage IMG_SlotTitle_MissionItem_Bg; // 0x8B0 (8)
	struct UImage IMG_SlotTitle_MissionItem_BgBg; // 0x8B8 (8)
	struct UImage IMG_SlotTitle_Recover_Bg; // 0x8C0 (8)
	struct UImage IMG_SlotTitle_Recover_BgBg; // 0x8C8 (8)
	struct UImage IMG_SlotTitle_Throw_Bg; // 0x8D0 (8)
	struct UImage IMG_SlotTitle_Throw_BgBg; // 0x8D8 (8)
	struct UImage IMG_TeamCoinIcon; // 0x8E0 (8)
	struct UImage IMG_TooltipCoin; // 0x8E8 (8)
	struct UImage IMG_VicinityBg; // 0x8F0 (8)
	struct UImage IMG_WeaponSlot_BottomLine; // 0x8F8 (8)
};

