// WidgetBlueprintGeneratedClass UnKnownMarketInvenListItem.UnKnownMarketInvenListItem_C
class UUnKnownMarketInvenListItem_C : public UPDInvenListItem {

public:

	struct UImage IMG_Dragable; // 0x3D0 (8)
	struct UImage IMG_FullGuide_Bg; // 0x3D8 (8)
	struct UImage IMG_FullGuide_Deco01; // 0x3E0 (8)
	struct UImage IMG_FullGuide_Deco02; // 0x3E8 (8)
	struct UImage IMG_FullGuide_Deco03; // 0x3F0 (8)
	struct UImage IMG_FullGuide_Deco04; // 0x3F8 (8)
	struct UImage IMG_FullGuide_Icon; // 0x400 (8)
	struct UImage IMG_InvenDragable_Deco_01; // 0x408 (8)
	struct UImage IMG_Refund; // 0x410 (8)
	struct UImage IMG_SlotTitle_Recover_Bg; // 0x418 (8)
	struct UImage IMG_SlotTitle_Recover_BgBg; // 0x420 (8)
	struct UInvalidationBox InvalidationBox_4; // 0x428 (8)
};

