// WidgetBlueprintGeneratedClass WorldMessage.WorldMessage_C
class UWorldMessage_C : public UPDWorldMessageUI {

public:

	struct UWidgetAnimation EndSysMSG; // 0x2F0 (8)
	struct UWidgetAnimation StartSysMSG; // 0x2F8 (8)
	struct UWidgetAnimation NumCountDown; // 0x300 (8)
	struct UPDImage DecoL1; // 0x308 (8)
	struct UPDImage DecoL2; // 0x310 (8)
	struct UPDImage DecoR1; // 0x318 (8)
	struct UPDImage DecoR2; // 0x320 (8)
	struct UPDImage Img_lineb; // 0x328 (8)
	struct UPDImage Img_lineB_l; // 0x330 (8)
	struct UPDImage Img_lineB_l_2; // 0x338 (8)
	struct UPDImage Img_lineB_l_3; // 0x340 (8)
	struct UPDImage Img_lineB_l_4; // 0x348 (8)
	struct UPDImage IMG_LineGlowD; // 0x350 (8)
	struct UPDImage IMG_LineGlowT; // 0x358 (8)
	struct UPDImage Img_linet; // 0x360 (8)
	struct UPDImage Img_linet_d; // 0x368 (8)
	struct UPDImage Img_linet_d_2; // 0x370 (8)
	struct UPDImage Img_linet_l; // 0x378 (8)
	struct UPDImage Img_linet_l_2; // 0x380 (8)
};

